[Timeout] BlockStatement
src/apirest.js:14:31
   router, serviciosConfig
 }
 
-const generaFiltro = (req) => {
-  if (!req.query || Object.keys(req.query).length === 0)
-    return null
-  if ('_search' in req.query)
-    return item => JSON.stringify(Object.values(item)).includes(req.query._search)
-
-  const q = Object.keys(req.query).filter(item => !item.startsWith('_'));
-  if (q.length === 0)
-    return null
-  for (let cmp in q) {
-    if (req.query[q[cmp]] === 'true') req.query[q[cmp]] = true;
-    if (req.query[q[cmp]] === 'false') req.query[q[cmp]] = false;
-  }
-  return item => {
-    for (let cmp in q) {
-      if (item[q[cmp]] != req.query[q[cmp]]) return false;
-    }
-    return true;
-  }
-}
+const generaFiltro = (req) => {}
 const generaPagina = (req, list, rows) => {
   const page = req.query._page && !isNaN(+req.query._page) ? Math.abs(+req.query._page) : 0;

[Timeout] ConditionalExpression
src/apirest.js:15:7
 }
 
 const generaFiltro = (req) => {
-  if (!req.query || Object.keys(req.query).length === 0)
+  if (true)
     return null
   if ('_search' in req.query)

[Timeout] BooleanLiteral
src/apirest.js:15:7
 }
 
 const generaFiltro = (req) => {
-  if (!req.query || Object.keys(req.query).length === 0)
+  if (req.query || Object.keys(req.query).length === 0)
     return null
   if ('_search' in req.query)

[Timeout] ConditionalExpression
src/apirest.js:17:7
 const generaFiltro = (req) => {
   if (!req.query || Object.keys(req.query).length === 0)
     return null
-  if ('_search' in req.query)
+  if (false)
     return item => JSON.stringify(Object.values(item)).includes(req.query._search)
 

[Timeout] ConditionalExpression
src/apirest.js:17:7
 const generaFiltro = (req) => {
   if (!req.query || Object.keys(req.query).length === 0)
     return null
-  if ('_search' in req.query)
+  if (true)
     return item => JSON.stringify(Object.values(item)).includes(req.query._search)
 

[Timeout] ArrowFunction
src/apirest.js:18:12
   if (!req.query || Object.keys(req.query).length === 0)
     return null
   if ('_search' in req.query)
-    return item => JSON.stringify(Object.values(item)).includes(req.query._search)
+    return () => undefined
 
   const q = Object.keys(req.query).filter(item => !item.startsWith('_'));

[Timeout] ArrowFunction
src/apirest.js:20:43
   if ('_search' in req.query)
     return item => JSON.stringify(Object.values(item)).includes(req.query._search)
 
-  const q = Object.keys(req.query).filter(item => !item.startsWith('_'));
+  const q = Object.keys(req.query).filter(() => undefined);
   if (q.length === 0)
     return null

[Timeout] BooleanLiteral
src/apirest.js:20:51
   if ('_search' in req.query)
     return item => JSON.stringify(Object.values(item)).includes(req.query._search)
 
-  const q = Object.keys(req.query).filter(item => !item.startsWith('_'));
+  const q = Object.keys(req.query).filter(item => item.startsWith('_'));
   if (q.length === 0)
     return null

[Timeout] ConditionalExpression
src/apirest.js:21:7
     return item => JSON.stringify(Object.values(item)).includes(req.query._search)
 
   const q = Object.keys(req.query).filter(item => !item.startsWith('_'));
-  if (q.length === 0)
+  if (false)
     return null
   for (let cmp in q) {

[Timeout] ConditionalExpression
src/apirest.js:21:7
     return item => JSON.stringify(Object.values(item)).includes(req.query._search)
 
   const q = Object.keys(req.query).filter(item => !item.startsWith('_'));
-  if (q.length === 0)
+  if (true)
     return null
   for (let cmp in q) {

[Timeout] BlockStatement
src/apirest.js:23:22
   const q = Object.keys(req.query).filter(item => !item.startsWith('_'));
   if (q.length === 0)
     return null
-  for (let cmp in q) {
-    if (req.query[q[cmp]] === 'true') req.query[q[cmp]] = true;
-    if (req.query[q[cmp]] === 'false') req.query[q[cmp]] = false;
-  }
+  for (let cmp in q) {}
   return item => {
     for (let cmp in q) {

[Timeout] BooleanLiteral
src/apirest.js:24:59
   if (q.length === 0)
     return null
   for (let cmp in q) {
-    if (req.query[q[cmp]] === 'true') req.query[q[cmp]] = true;
+    if (req.query[q[cmp]] === 'true') req.query[q[cmp]] = false;
     if (req.query[q[cmp]] === 'false') req.query[q[cmp]] = false;
   }

[Timeout] ConditionalExpression
src/apirest.js:24:9
   if (q.length === 0)
     return null
   for (let cmp in q) {
-    if (req.query[q[cmp]] === 'true') req.query[q[cmp]] = true;
+    if (true) req.query[q[cmp]] = true;
     if (req.query[q[cmp]] === 'false') req.query[q[cmp]] = false;
   }

[NoCoverage] BooleanLiteral
src/apirest.js:25:60
     return null
   for (let cmp in q) {
     if (req.query[q[cmp]] === 'true') req.query[q[cmp]] = true;
-    if (req.query[q[cmp]] === 'false') req.query[q[cmp]] = false;
+    if (req.query[q[cmp]] === 'false') req.query[q[cmp]] = true;
   }
   return item => {

[Timeout] ConditionalExpression
src/apirest.js:25:9
     return null
   for (let cmp in q) {
     if (req.query[q[cmp]] === 'true') req.query[q[cmp]] = true;
-    if (req.query[q[cmp]] === 'false') req.query[q[cmp]] = false;
+    if (false) req.query[q[cmp]] = false;
   }
   return item => {

[Timeout] BlockStatement
src/apirest.js:27:18
     if (req.query[q[cmp]] === 'true') req.query[q[cmp]] = true;
     if (req.query[q[cmp]] === 'false') req.query[q[cmp]] = false;
   }
-  return item => {
-    for (let cmp in q) {
-      if (item[q[cmp]] != req.query[q[cmp]]) return false;
-    }
-    return true;
-  }
+  return item => {}
 }
 const generaPagina = (req, list, rows) => {

[Timeout] BlockStatement
src/apirest.js:28:24
     if (req.query[q[cmp]] === 'false') req.query[q[cmp]] = false;
   }
   return item => {
-    for (let cmp in q) {
-      if (item[q[cmp]] != req.query[q[cmp]]) return false;
-    }
+    for (let cmp in q) {}
     return true;
   }

[Timeout] ConditionalExpression
src/apirest.js:29:11
   }
   return item => {
     for (let cmp in q) {
-      if (item[q[cmp]] != req.query[q[cmp]]) return false;
+      if (false) return false;
     }
     return true;

[Timeout] BooleanLiteral
src/apirest.js:29:53
   }
   return item => {
     for (let cmp in q) {
-      if (item[q[cmp]] != req.query[q[cmp]]) return false;
+      if (item[q[cmp]] != req.query[q[cmp]]) return true;
     }
     return true;

[Timeout] BlockStatement
src/apirest.js:34:43
     return true;
   }
 }
-const generaPagina = (req, list, rows) => {
-  const page = req.query._page && !isNaN(+req.query._page) ? Math.abs(+req.query._page) : 0;
-  list = {
-    content: list.slice(page * rows, page * rows + rows),
-    totalElements: list.length,
-    totalPages: Math.ceil(list.length / rows),
-    number: list.length === 0 ? 0 : page,
-    size: rows,
-  }
-  list.empty = list.content.length === 0;
-  list.first = !list.empty && page === 0;
-  list.last = !list.empty && page === (list.totalPages - 1);
-  list.numberOfElements = list.content.length
-  return list
-}
+const generaPagina = (req, list, rows) => {}
 apis.getAll = async (servicio, req, res, next) => {
   try {

[Timeout] UnaryOperator
src/apirest.js:35:71
   }
 }
 const generaPagina = (req, list, rows) => {
-  const page = req.query._page && !isNaN(+req.query._page) ? Math.abs(+req.query._page) : 0;
+  const page = req.query._page && !isNaN(+req.query._page) ? Math.abs(-req.query._page) : 0;
   list = {
     content: list.slice(page * rows, page * rows + rows),

[Timeout] ConditionalExpression
src/apirest.js:35:16
   }
 }
 const generaPagina = (req, list, rows) => {
-  const page = req.query._page && !isNaN(+req.query._page) ? Math.abs(+req.query._page) : 0;
+  const page = false ? Math.abs(+req.query._page) : 0;
   list = {
     content: list.slice(page * rows, page * rows + rows),

[Timeout] ObjectLiteral
src/apirest.js:36:10
 }
 const generaPagina = (req, list, rows) => {
   const page = req.query._page && !isNaN(+req.query._page) ? Math.abs(+req.query._page) : 0;
-  list = {
-    content: list.slice(page * rows, page * rows + rows),
-    totalElements: list.length,
-    totalPages: Math.ceil(list.length / rows),
-    number: list.length === 0 ? 0 : page,
-    size: rows,
-  }
+  list = {}
   list.empty = list.content.length === 0;
   list.first = !list.empty && page === 0;

[Timeout] MethodExpression
src/apirest.js:37:14
 const generaPagina = (req, list, rows) => {
   const page = req.query._page && !isNaN(+req.query._page) ? Math.abs(+req.query._page) : 0;
   list = {
-    content: list.slice(page * rows, page * rows + rows),
+    content: list,
     totalElements: list.length,
     totalPages: Math.ceil(list.length / rows),

[Timeout] ArithmeticOperator
src/apirest.js:37:25
 const generaPagina = (req, list, rows) => {
   const page = req.query._page && !isNaN(+req.query._page) ? Math.abs(+req.query._page) : 0;
   list = {
-    content: list.slice(page * rows, page * rows + rows),
+    content: list.slice(page / rows, page * rows + rows),
     totalElements: list.length,
     totalPages: Math.ceil(list.length / rows),

[Timeout] ArithmeticOperator
src/apirest.js:39:27
   list = {
     content: list.slice(page * rows, page * rows + rows),
     totalElements: list.length,
-    totalPages: Math.ceil(list.length / rows),
+    totalPages: Math.ceil(list.length * rows),
     number: list.length === 0 ? 0 : page,
     size: rows,

[Timeout] ConditionalExpression
src/apirest.js:40:13
     content: list.slice(page * rows, page * rows + rows),
     totalElements: list.length,
     totalPages: Math.ceil(list.length / rows),
-    number: list.length === 0 ? 0 : page,
+    number: false ? 0 : page,
     size: rows,
   }

[Timeout] EqualityOperator
src/apirest.js:40:13
     content: list.slice(page * rows, page * rows + rows),
     totalElements: list.length,
     totalPages: Math.ceil(list.length / rows),
-    number: list.length === 0 ? 0 : page,
+    number: list.length !== 0 ? 0 : page,
     size: rows,
   }

[Timeout] ConditionalExpression
src/apirest.js:43:16
     number: list.length === 0 ? 0 : page,
     size: rows,
   }
-  list.empty = list.content.length === 0;
+  list.empty = true;
   list.first = !list.empty && page === 0;
   list.last = !list.empty && page === (list.totalPages - 1);

[Timeout] ConditionalExpression
src/apirest.js:43:16
     number: list.length === 0 ? 0 : page,
     size: rows,
   }
-  list.empty = list.content.length === 0;
+  list.empty = false;
   list.first = !list.empty && page === 0;
   list.last = !list.empty && page === (list.totalPages - 1);

[Timeout] ConditionalExpression
src/apirest.js:44:16
     size: rows,
   }
   list.empty = list.content.length === 0;
-  list.first = !list.empty && page === 0;
+  list.first = true;
   list.last = !list.empty && page === (list.totalPages - 1);
   list.numberOfElements = list.content.length

[Timeout] BooleanLiteral
src/apirest.js:44:16
     size: rows,
   }
   list.empty = list.content.length === 0;
-  list.first = !list.empty && page === 0;
+  list.first = list.empty && page === 0;
   list.last = !list.empty && page === (list.totalPages - 1);
   list.numberOfElements = list.content.length

[Timeout] ConditionalExpression
src/apirest.js:45:15
   }
   list.empty = list.content.length === 0;
   list.first = !list.empty && page === 0;
-  list.last = !list.empty && page === (list.totalPages - 1);
+  list.last = true;
   list.numberOfElements = list.content.length
   return list

[Timeout] ArithmeticOperator
src/apirest.js:45:40
   }
   list.empty = list.content.length === 0;
   list.first = !list.empty && page === 0;
-  list.last = !list.empty && page === (list.totalPages - 1);
+  list.last = !list.empty && page === (list.totalPages + 1);
   list.numberOfElements = list.content.length
   return list

[Timeout] BlockStatement
src/apirest.js:49:51
   list.numberOfElements = list.content.length
   return list
 }
-apis.getAll = async (servicio, req, res, next) => {
-  try {
-    await servicio.db.load()
-    let list = await servicio.db.select(req.query._projection, generaFiltro(req),
-      req.query._sort ? req.query._sort : servicio.pk)
-    if (req.query._page != undefined || req.query._rows != undefined) {
-      const rows = req.query._rows && !isNaN(+req.query._rows) ? Math.abs(+req.query._rows) : 20;
-      if (req.query._page && typeof(req.query._page) === "string" && req.query._page.toUpperCase() == "COUNT") {
-        res.json({ pages: Math.ceil(list.length / rows), rows: list.length }).end()
-        return;
-      }
-      list = generaPagina(req, list, rows)
-    }
-    res.json(list)
-  } catch (error) {
-    next(generateErrorByError(req, error))
-  }
-}
+apis.getAll = async (servicio, req, res, next) => {}
 apis.getOne = async (servicio, req, res, next) => {
   try {

[Timeout] BlockStatement
src/apirest.js:50:7
   return list
 }
 apis.getAll = async (servicio, req, res, next) => {
-  try {
-    await servicio.db.load()
-    let list = await servicio.db.select(req.query._projection, generaFiltro(req),
-      req.query._sort ? req.query._sort : servicio.pk)
-    if (req.query._page != undefined || req.query._rows != undefined) {
-      const rows = req.query._rows && !isNaN(+req.query._rows) ? Math.abs(+req.query._rows) : 20;
-      if (req.query._page && typeof(req.query._page) === "string" && req.query._page.toUpperCase() == "COUNT") {
-        res.json({ pages: Math.ceil(list.length / rows), rows: list.length }).end()
-        return;
-      }
-      list = generaPagina(req, list, rows)
-    }
-    res.json(list)
-  } catch (error) {
+  try {} catch (error) {
     next(generateErrorByError(req, error))
   }

[Timeout] ConditionalExpression
src/apirest.js:54:9
     await servicio.db.load()
     let list = await servicio.db.select(req.query._projection, generaFiltro(req),
       req.query._sort ? req.query._sort : servicio.pk)
-    if (req.query._page != undefined || req.query._rows != undefined) {
+    if (false) {
       const rows = req.query._rows && !isNaN(+req.query._rows) ? Math.abs(+req.query._rows) : 20;
       if (req.query._page && typeof(req.query._page) === "string" && req.query._page.toUpperCase() == "COUNT") {

[Timeout] ConditionalExpression
src/apirest.js:54:9
     await servicio.db.load()
     let list = await servicio.db.select(req.query._projection, generaFiltro(req),
       req.query._sort ? req.query._sort : servicio.pk)
-    if (req.query._page != undefined || req.query._rows != undefined) {
+    if (false || req.query._rows != undefined) {
       const rows = req.query._rows && !isNaN(+req.query._rows) ? Math.abs(+req.query._rows) : 20;
       if (req.query._page && typeof(req.query._page) === "string" && req.query._page.toUpperCase() == "COUNT") {

[Timeout] UnaryOperator
src/apirest.js:55:75
     let list = await servicio.db.select(req.query._projection, generaFiltro(req),
       req.query._sort ? req.query._sort : servicio.pk)
     if (req.query._page != undefined || req.query._rows != undefined) {
-      const rows = req.query._rows && !isNaN(+req.query._rows) ? Math.abs(+req.query._rows) : 20;
+      const rows = req.query._rows && !isNaN(+req.query._rows) ? Math.abs(-req.query._rows) : 20;
       if (req.query._page && typeof(req.query._page) === "string" && req.query._page.toUpperCase() == "COUNT") {
         res.json({ pages: Math.ceil(list.length / rows), rows: list.length }).end()

[Timeout] UnaryOperator
src/apirest.js:55:46
     let list = await servicio.db.select(req.query._projection, generaFiltro(req),
       req.query._sort ? req.query._sort : servicio.pk)
     if (req.query._page != undefined || req.query._rows != undefined) {
-      const rows = req.query._rows && !isNaN(+req.query._rows) ? Math.abs(+req.query._rows) : 20;
+      const rows = req.query._rows && !isNaN(-req.query._rows) ? Math.abs(+req.query._rows) : 20;
       if (req.query._page && typeof(req.query._page) === "string" && req.query._page.toUpperCase() == "COUNT") {
         res.json({ pages: Math.ceil(list.length / rows), rows: list.length }).end()

[Timeout] ConditionalExpression
src/apirest.js:56:30
       req.query._sort ? req.query._sort : servicio.pk)
     if (req.query._page != undefined || req.query._rows != undefined) {
       const rows = req.query._rows && !isNaN(+req.query._rows) ? Math.abs(+req.query._rows) : 20;
-      if (req.query._page && typeof(req.query._page) === "string" && req.query._page.toUpperCase() == "COUNT") {
+      if (req.query._page && true && req.query._page.toUpperCase() == "COUNT") {
         res.json({ pages: Math.ceil(list.length / rows), rows: list.length }).end()
         return;

[Timeout] LogicalOperator
src/apirest.js:56:11
       req.query._sort ? req.query._sort : servicio.pk)
     if (req.query._page != undefined || req.query._rows != undefined) {
       const rows = req.query._rows && !isNaN(+req.query._rows) ? Math.abs(+req.query._rows) : 20;
-      if (req.query._page && typeof(req.query._page) === "string" && req.query._page.toUpperCase() == "COUNT") {
+      if (req.query._page || typeof req.query._page === "string" && req.query._page.toUpperCase() == "COUNT") {
         res.json({ pages: Math.ceil(list.length / rows), rows: list.length }).end()
         return;

[Timeout] ArithmeticOperator
src/apirest.js:57:37
     if (req.query._page != undefined || req.query._rows != undefined) {
       const rows = req.query._rows && !isNaN(+req.query._rows) ? Math.abs(+req.query._rows) : 20;
       if (req.query._page && typeof(req.query._page) === "string" && req.query._page.toUpperCase() == "COUNT") {
-        res.json({ pages: Math.ceil(list.length / rows), rows: list.length }).end()
+        res.json({ pages: Math.ceil(list.length * rows), rows: list.length }).end()
         return;
       }

[Timeout] BlockStatement
src/apirest.js:63:19
       list = generaPagina(req, list, rows)
     }
     res.json(list)
-  } catch (error) {
-    next(generateErrorByError(req, error))
-  }
+  } catch (error) {}
 }
 apis.getOne = async (servicio, req, res, next) => {

[Timeout] BlockStatement
src/apirest.js:67:51
     next(generateErrorByError(req, error))
   }
 }
-apis.getOne = async (servicio, req, res, next) => {
-  try {
-    await servicio.db.load()
-    let element = servicio.db.getById(req.params.id, req.query._projection)
-    if (element) {
-      res.status(200).json(element)
-    } else {
-      return next(generateErrorByStatus(req, 404))
-    }
-  } catch (err) {
-    next(generateErrorByError(req, err))
-  }
-}
+apis.getOne = async (servicio, req, res, next) => {}
 apis.post = async (servicio, req, res, next) => {
   if (!req.is('json') || !req.body) {

[Timeout] BlockStatement
src/apirest.js:68:7
   }
 }
 apis.getOne = async (servicio, req, res, next) => {
-  try {
-    await servicio.db.load()
-    let element = servicio.db.getById(req.params.id, req.query._projection)
-    if (element) {
-      res.status(200).json(element)
-    } else {
-      return next(generateErrorByStatus(req, 404))
-    }
-  } catch (err) {
+  try {} catch (err) {
     next(generateErrorByError(req, err))
   }

[Timeout] ConditionalExpression
src/apirest.js:71:9
   try {
     await servicio.db.load()
     let element = servicio.db.getById(req.params.id, req.query._projection)
-    if (element) {
+    if (false) {
       res.status(200).json(element)
     } else {

[Timeout] BlockStatement
src/apirest.js:71:18
   try {
     await servicio.db.load()
     let element = servicio.db.getById(req.params.id, req.query._projection)
-    if (element) {
-      res.status(200).json(element)
-    } else {
+    if (element) {} else {
       return next(generateErrorByStatus(req, 404))
     }

[Timeout] BlockStatement
src/apirest.js:73:12
     let element = servicio.db.getById(req.params.id, req.query._projection)
     if (element) {
       res.status(200).json(element)
-    } else {
-      return next(generateErrorByStatus(req, 404))
-    }
+    } else {}
   } catch (err) {
     next(generateErrorByError(req, err))

[Timeout] BlockStatement
src/apirest.js:76:17
     } else {
       return next(generateErrorByStatus(req, 404))
     }
-  } catch (err) {
-    next(generateErrorByError(req, err))
-  }
+  } catch (err) {}
 }
 apis.post = async (servicio, req, res, next) => {

[Timeout] BlockStatement
src/apirest.js:80:49
     next(generateErrorByError(req, err))
   }
 }
-apis.post = async (servicio, req, res, next) => {
-  if (!req.is('json') || !req.body) {
-    return next(generateErrorByStatus(req, 406))
-  }
-  if (Object.keys(req.body).length == 0) {
-    return next(generateError(req, 'Faltan los datos.', 400))
-  }
-  try {
-    await servicio.db.load()
-    let element = req.body
-    if (element[servicio.pk] == undefined) {
-      element[servicio.pk] = 0
-    }
-    element = await servicio.db.add(element, true);
-    res.status(201).header('location', formatLocation(req, element[servicio.pk])).end()
-  } catch (error) {
-    next(generateErrorByError(req, error))
-  }
-}
+apis.post = async (servicio, req, res, next) => {}
 apis.put = async (servicio, req, res, next) => {
   if (!req.is('json') || !req.body) {

[Timeout] LogicalOperator
src/apirest.js:81:7
   }
 }
 apis.post = async (servicio, req, res, next) => {
-  if (!req.is('json') || !req.body) {
+  if (!req.is('json') && !req.body) {
     return next(generateErrorByStatus(req, 406))
   }

[Timeout] ConditionalExpression
src/apirest.js:81:7
   }
 }
 apis.post = async (servicio, req, res, next) => {
-  if (!req.is('json') || !req.body) {
+  if (false) {
     return next(generateErrorByStatus(req, 406))
   }

[Timeout] ConditionalExpression
src/apirest.js:84:7
   if (!req.is('json') || !req.body) {
     return next(generateErrorByStatus(req, 406))
   }
-  if (Object.keys(req.body).length == 0) {
+  if (false) {
     return next(generateError(req, 'Faltan los datos.', 400))
   }

[Timeout] EqualityOperator
src/apirest.js:84:7
   if (!req.is('json') || !req.body) {
     return next(generateErrorByStatus(req, 406))
   }
-  if (Object.keys(req.body).length == 0) {
+  if (Object.keys(req.body).length != 0) {
     return next(generateError(req, 'Faltan los datos.', 400))
   }

[Timeout] BlockStatement
src/apirest.js:87:7
   if (Object.keys(req.body).length == 0) {
     return next(generateError(req, 'Faltan los datos.', 400))
   }
-  try {
-    await servicio.db.load()
-    let element = req.body
-    if (element[servicio.pk] == undefined) {
-      element[servicio.pk] = 0
-    }
-    element = await servicio.db.add(element, true);
-    res.status(201).header('location', formatLocation(req, element[servicio.pk])).end()
-  } catch (error) {
+  try {} catch (error) {
     next(generateErrorByError(req, error))
   }

[Timeout] ConditionalExpression
src/apirest.js:90:9
   try {
     await servicio.db.load()
     let element = req.body
-    if (element[servicio.pk] == undefined) {
+    if (false) {
       element[servicio.pk] = 0
     }

[Timeout] BlockStatement
src/apirest.js:90:44
   try {
     await servicio.db.load()
     let element = req.body
-    if (element[servicio.pk] == undefined) {
-      element[servicio.pk] = 0
-    }
+    if (element[servicio.pk] == undefined) {}
     element = await servicio.db.add(element, true);
     res.status(201).header('location', formatLocation(req, element[servicio.pk])).end()

[Timeout] BooleanLiteral
src/apirest.js:93:46
     if (element[servicio.pk] == undefined) {
       element[servicio.pk] = 0
     }
-    element = await servicio.db.add(element, true);
+    element = await servicio.db.add(element, false);
     res.status(201).header('location', formatLocation(req, element[servicio.pk])).end()
   } catch (error) {

[Timeout] StringLiteral
src/apirest.js:94:28
       element[servicio.pk] = 0
     }
     element = await servicio.db.add(element, true);
-    res.status(201).header('location', formatLocation(req, element[servicio.pk])).end()
+    res.status(201).header("", formatLocation(req, element[servicio.pk])).end()
   } catch (error) {
     next(generateErrorByError(req, error))

[Timeout] BlockStatement
src/apirest.js:95:19
     }
     element = await servicio.db.add(element, true);
     res.status(201).header('location', formatLocation(req, element[servicio.pk])).end()
-  } catch (error) {
-    next(generateErrorByError(req, error))
-  }
+  } catch (error) {}
 }
 apis.put = async (servicio, req, res, next) => {

[Timeout] BlockStatement
src/apirest.js:99:48
     next(generateErrorByError(req, error))
   }
 }
-apis.put = async (servicio, req, res, next) => {
-  if (!req.is('json') || !req.body) {
-    return next(generateErrorByStatus(req, 406))
-  }
-  let element = req.body
-  if (req.body[servicio.pk] == undefined) {
-    if (Object.keys(req.body).length == 0) {
-      return next(generateError(req, 'Faltan los datos.', 400))
-    }
-    element[servicio.pk] = req.params.id
-  } else if (req.body[servicio.pk] != req.params.id) {
-    return next(generateError(req, 'Invalid identifier', 400))
-  }
-  try {
-    await servicio.db.load()
-    await servicio.db.update(element, true);
-    res.sendStatus(204)
-  } catch (error) {
-    next(generateErrorByError(req, error))
-  }
-}
+apis.put = async (servicio, req, res, next) => {}
 apis.putWithoutId = async (servicio, req, res, next) => {
   if (!req.is('json') || !req.body) {

[Timeout] ConditionalExpression
src/apirest.js:100:7
   }
 }
 apis.put = async (servicio, req, res, next) => {
-  if (!req.is('json') || !req.body) {
+  if (true) {
     return next(generateErrorByStatus(req, 406))
   }

[Timeout] BooleanLiteral
src/apirest.js:100:26
   }
 }
 apis.put = async (servicio, req, res, next) => {
-  if (!req.is('json') || !req.body) {
+  if (!req.is('json') || req.body) {
     return next(generateErrorByStatus(req, 406))
   }

[Timeout] BlockStatement
src/apirest.js:104:43
     return next(generateErrorByStatus(req, 406))
   }
   let element = req.body
-  if (req.body[servicio.pk] == undefined) {
-    if (Object.keys(req.body).length == 0) {
-      return next(generateError(req, 'Faltan los datos.', 400))
-    }
-    element[servicio.pk] = req.params.id
-  } else if (req.body[servicio.pk] != req.params.id) {
+  if (req.body[servicio.pk] == undefined) {} else if (req.body[servicio.pk] != req.params.id) {
     return next(generateError(req, 'Invalid identifier', 400))
   }

[Timeout] ConditionalExpression
src/apirest.js:104:7
     return next(generateErrorByStatus(req, 406))
   }
   let element = req.body
-  if (req.body[servicio.pk] == undefined) {
+  if (true) {
     if (Object.keys(req.body).length == 0) {
       return next(generateError(req, 'Faltan los datos.', 400))

[Timeout] ConditionalExpression
src/apirest.js:105:9
   }
   let element = req.body
   if (req.body[servicio.pk] == undefined) {
-    if (Object.keys(req.body).length == 0) {
+    if (false) {
       return next(generateError(req, 'Faltan los datos.', 400))
     }

[Timeout] ConditionalExpression
src/apirest.js:105:9
   }
   let element = req.body
   if (req.body[servicio.pk] == undefined) {
-    if (Object.keys(req.body).length == 0) {
+    if (true) {
       return next(generateError(req, 'Faltan los datos.', 400))
     }

[Timeout] ConditionalExpression
src/apirest.js:109:14
       return next(generateError(req, 'Faltan los datos.', 400))
     }
     element[servicio.pk] = req.params.id
-  } else if (req.body[servicio.pk] != req.params.id) {
+  } else if (true) {
     return next(generateError(req, 'Invalid identifier', 400))
   }

[Timeout] EqualityOperator
src/apirest.js:109:14
       return next(generateError(req, 'Faltan los datos.', 400))
     }
     element[servicio.pk] = req.params.id
-  } else if (req.body[servicio.pk] != req.params.id) {
+  } else if (req.body[servicio.pk] == req.params.id) {
     return next(generateError(req, 'Invalid identifier', 400))
   }

[Timeout] StringLiteral
src/apirest.js:110:36
     }
     element[servicio.pk] = req.params.id
   } else if (req.body[servicio.pk] != req.params.id) {
-    return next(generateError(req, 'Invalid identifier', 400))
+    return next(generateError(req, "", 400))
   }
   try {

[Timeout] BlockStatement
src/apirest.js:112:7
   } else if (req.body[servicio.pk] != req.params.id) {
     return next(generateError(req, 'Invalid identifier', 400))
   }
-  try {
-    await servicio.db.load()
-    await servicio.db.update(element, true);
-    res.sendStatus(204)
-  } catch (error) {
+  try {} catch (error) {
     next(generateErrorByError(req, error))
   }

[Timeout] BooleanLiteral
src/apirest.js:114:39
   }
   try {
     await servicio.db.load()
-    await servicio.db.update(element, true);
+    await servicio.db.update(element, false);
     res.sendStatus(204)
   } catch (error) {

[Timeout] BlockStatement
src/apirest.js:116:19
     await servicio.db.load()
     await servicio.db.update(element, true);
     res.sendStatus(204)
-  } catch (error) {
-    next(generateErrorByError(req, error))
-  }
+  } catch (error) {}
 }
 apis.putWithoutId = async (servicio, req, res, next) => {

[Timeout] BlockStatement
src/apirest.js:120:57
     next(generateErrorByError(req, error))
   }
 }
-apis.putWithoutId = async (servicio, req, res, next) => {
-  if (!req.is('json') || !req.body) {
-    return next(generateErrorByStatus(req, 406))
-  }
-  if (req.body[servicio.pk] == undefined) {
-    return next(generateError(req, 'Invalid identifier', 400))
-  }
-  let element = req.body
-  try {
-    await servicio.db.load()
-    element = await servicio.db.update(element, true);
-    res.status(200).json(element).end()
-  } catch (error) {
-    next(generateErrorByError(req, error))
-  }
-}
+apis.putWithoutId = async (servicio, req, res, next) => {}
 apis.patch = async (servicio, req, res, next) => {
   if (!req.is('json') || !req.body) {

[Timeout] LogicalOperator
src/apirest.js:121:7
   }
 }
 apis.putWithoutId = async (servicio, req, res, next) => {
-  if (!req.is('json') || !req.body) {
+  if (!req.is('json') && !req.body) {
     return next(generateErrorByStatus(req, 406))
   }
