[Timeout] BooleanLiteral
src/app.js:23:27
 const seguridad = require('./seguridad')
 const apiRouter = require('./apirest');
 
-let VALIDATE_XSRF_TOKEN = false;
+let VALIDATE_XSRF_TOKEN = true;
 
 const app = express()

[Survived] StringLiteral
src/app.js:26:13
 let VALIDATE_XSRF_TOKEN = false;
 
 const app = express()
-app.disable('x-powered-by');
+app.disable("");
 app.PUERTO = process.env.PORT || '4321';
 app.URL_SERVER = ''

[Timeout] ConditionalExpression
src/app.js:27:14
 
 const app = express()
 app.disable('x-powered-by');
-app.PUERTO = process.env.PORT || '4321';
+app.PUERTO = true;
 app.URL_SERVER = ''
 app.DIR_API_REST = config.paths.API_REST

[Timeout] ConditionalExpression
src/app.js:27:14
 
 const app = express()
 app.disable('x-powered-by');
-app.PUERTO = process.env.PORT || '4321';
+app.PUERTO = false;
 app.URL_SERVER = ''
 app.DIR_API_REST = config.paths.API_REST

[NoCoverage] BlockStatement
src/app.js:33:24
 app.server = createServer(app)
 app.wss = createWSServer(app)
 
-const shutdown = () => {
-  if (app.server) {
-    app.server.close()
-  }
-  process.kill(process.pid, 'SIGTERM');
-}
+const shutdown = () => {}
 
 // Argumentos de entrada

[NoCoverage] ConditionalExpression
src/app.js:34:7
 app.wss = createWSServer(app)
 
 const shutdown = () => {
-  if (app.server) {
+  if (false) {
     app.server.close()
   }

[NoCoverage] ConditionalExpression
src/app.js:34:7
 app.wss = createWSServer(app)
 
 const shutdown = () => {
-  if (app.server) {
+  if (true) {
     app.server.close()
   }

[Survived] BlockStatement
src/app.js:41:29
 }
 
 // Argumentos de entrada
-process.argv.forEach(val => {
-  if (val.toLocaleLowerCase().startsWith('--port='))
-    app.PUERTO = val.substring('--port='.length)
-  else if (val.toLocaleLowerCase().startsWith('--xsrf')) {
-    VALIDATE_XSRF_TOKEN = true
-    console.info('Activada protección XSRF.')
-  }
-});
+process.argv.forEach(val => {});
 
 // Registro

[Killed] MethodExpression
src/app.js:42:7
 
 // Argumentos de entrada
 process.argv.forEach(val => {
-  if (val.toLocaleLowerCase().startsWith('--port='))
+  if (val.toLocaleLowerCase().endsWith('--port='))
     app.PUERTO = val.substring('--port='.length)
   else if (val.toLocaleLowerCase().startsWith('--xsrf')) {
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ConditionalExpression
src/app.js:42:7
 
 // Argumentos de entrada
 process.argv.forEach(val => {
-  if (val.toLocaleLowerCase().startsWith('--port='))
+  if (false)
     app.PUERTO = val.substring('--port='.length)
   else if (val.toLocaleLowerCase().startsWith('--xsrf')) {
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[NoCoverage] MethodExpression
src/app.js:43:18
 // Argumentos de entrada
 process.argv.forEach(val => {
   if (val.toLocaleLowerCase().startsWith('--port='))
-    app.PUERTO = val.substring('--port='.length)
+    app.PUERTO = val
   else if (val.toLocaleLowerCase().startsWith('--xsrf')) {
     VALIDATE_XSRF_TOKEN = true

[Killed] ConditionalExpression
src/app.js:44:12
 process.argv.forEach(val => {
   if (val.toLocaleLowerCase().startsWith('--port='))
     app.PUERTO = val.substring('--port='.length)
-  else if (val.toLocaleLowerCase().startsWith('--xsrf')) {
+  else if (true) {
     VALIDATE_XSRF_TOKEN = true
     console.info('Activada protección XSRF.')
killedBy: Seguridad Pruebas con ficheros simulados /login OK POST: Login Admin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] MethodExpression
src/app.js:44:12
 process.argv.forEach(val => {
   if (val.toLocaleLowerCase().startsWith('--port='))
     app.PUERTO = val.substring('--port='.length)
-  else if (val.toLocaleLowerCase().startsWith('--xsrf')) {
+  else if (val.toLocaleUpperCase().startsWith('--xsrf')) {
     VALIDATE_XSRF_TOKEN = true
     console.info('Activada protección XSRF.')
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[NoCoverage] BooleanLiteral
src/app.js:45:27
   if (val.toLocaleLowerCase().startsWith('--port='))
     app.PUERTO = val.substring('--port='.length)
   else if (val.toLocaleLowerCase().startsWith('--xsrf')) {
-    VALIDATE_XSRF_TOKEN = true
+    VALIDATE_XSRF_TOKEN = false
     console.info('Activada protección XSRF.')
   }

[Killed] ConditionalExpression
src/app.js:51:5
 });
 
 // Registro
-if (process.env.NODE_ENV !== 'test')
+if (false)
   app.use(morgan('combined', {
     stream: rfs.createStream('file.log', {
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Survived] ConditionalExpression
src/app.js:51:5
 });
 
 // Registro
-if (process.env.NODE_ENV !== 'test')
+if (true)
   app.use(morgan('combined', {
     stream: rfs.createStream('file.log', {

[NoCoverage] ObjectLiteral
src/app.js:52:30
 
 // Registro
 if (process.env.NODE_ENV !== 'test')
-  app.use(morgan('combined', {
-    stream: rfs.createStream('file.log', {
-      path: path.join(__dirname, '../log'), // directory
-      size: '10M', // rotate every 10 MegaBytes written
-      interval: '1d', // rotate daily
-      compress: 'gzip' // compress rotated files
-    })
-  }))
+  app.use(morgan('combined', {}))
 
 // parse application/json

[NoCoverage] StringLiteral
src/app.js:53:30
 // Registro
 if (process.env.NODE_ENV !== 'test')
   app.use(morgan('combined', {
-    stream: rfs.createStream('file.log', {
+    stream: rfs.createStream("", {
       path: path.join(__dirname, '../log'), // directory
       size: '10M', // rotate every 10 MegaBytes written

[NoCoverage] StringLiteral
src/app.js:56:17
     stream: rfs.createStream('file.log', {
       path: path.join(__dirname, '../log'), // directory
       size: '10M', // rotate every 10 MegaBytes written
-      interval: '1d', // rotate daily
+      interval: "", // rotate daily
       compress: 'gzip' // compress rotated files
     })

[NoCoverage] StringLiteral
src/app.js:57:17
       path: path.join(__dirname, '../log'), // directory
       size: '10M', // rotate every 10 MegaBytes written
       interval: '1d', // rotate daily
-      compress: 'gzip' // compress rotated files
+      compress: "" // compress rotated files
     })
   }))

[Timeout] ObjectLiteral
src/app.js:64:28
 // parse application/json
 app.use(express.json())
 // parse application/x-www-form-urlencoded
-app.use(express.urlencoded({
-  extended: false
-}))
+app.use(express.urlencoded({}))
 // parse header/cookies
 app.use(cookieParser())

[Killed] BooleanLiteral
src/app.js:65:13
 app.use(express.json())
 // parse application/x-www-form-urlencoded
 app.use(express.urlencoded({
-  extended: false
+  extended: true
 }))
 // parse header/cookies
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] ArrowFunction
src/app.js:75:18
 
 const upload = multer({
   storage: {
-    destination: (_req, _file, cb) => cb(null, 'uploads/'),
+    destination: () => undefined,
     filename: (_req, file, cb) => cb(null, file.originalname),
     limits: { fileSize: 100000 /* 2 * 1024 * 1024 /* 2mb */ },

[Killed] ArrowFunction
src/app.js:76:15
 const upload = multer({
   storage: {
     destination: (_req, _file, cb) => cb(null, 'uploads/'),
-    filename: (_req, file, cb) => cb(null, file.originalname),
+    filename: () => undefined,
     limits: { fileSize: 100000 /* 2 * 1024 * 1024 /* 2mb */ },
   },
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] BlockStatement
src/app.js:82:45
   limits: { fileSize: 100000 /* 2 * 1024 * 1024 /* 2mb */ },
 })
 app.use('/files', express.static('uploads'))
-app.get('/fileupload', function (_req, res) {
-  res.status(200).end(plantillaHTML('fileupload', `
-    <h1>Multiple file uploads</h1>
-    <form action="fileupload" method="post" enctype="multipart/form-data">
-      <p>
-        <input type="file" name="filestoupload" multiple="multiple" required><br>
-        <input type="submit">
-      </p>
-    </form>
-  `))
-})
+app.get('/fileupload', function (_req, res) {})
 
 app.post('/fileupload', upload.array('filestoupload'), function (req, res, next) {

[Timeout] StringLiteral
src/app.js:83:51
 })
 app.use('/files', express.static('uploads'))
 app.get('/fileupload', function (_req, res) {
-  res.status(200).end(plantillaHTML('fileupload', `
-    <h1>Multiple file uploads</h1>
-    <form action="fileupload" method="post" enctype="multipart/form-data">
-      <p>
-        <input type="file" name="filestoupload" multiple="multiple" required><br>
-        <input type="submit">
-      </p>
-    </form>
-  `))
+  res.status(200).end(plantillaHTML('fileupload', ``))
 })
 

[Survived] StringLiteral
src/app.js:83:37
 })
 app.use('/files', express.static('uploads'))
 app.get('/fileupload', function (_req, res) {
-  res.status(200).end(plantillaHTML('fileupload', `
+  res.status(200).end(plantillaHTML("", `
     <h1>Multiple file uploads</h1>
     <form action="fileupload" method="post" enctype="multipart/form-data">

[Timeout] BlockStatement
src/app.js:94:82
   `))
 })
 
-app.post('/fileupload', upload.array('filestoupload'), function (req, res, next) {
-  try {
-    let rutas = req.files.map(f => ({ url: `${app.URL_SERVER}/files/${f.originalname}` }))
-    if (req.headers?.accept?.includes('application/json'))
-      res.status(200).json(rutas).end();
-    else {
-      res.status(200).end(plantillaHTML('Ficheros', xss(`
-        <h1>Ficheros subidos</h1>
-        <ul>${rutas.map(r => `<li><a href="${r.url}">${r.url}</a></li>`).join('')}</ul>
-      `)));
-    }
-  } catch (error) {
-    next(generateErrorByError(req, error, 500))
-  }
-})
+app.post('/fileupload', upload.array('filestoupload'), function (req, res, next) {})
 
 // Cross-origin resource sharing (CORS)

[Timeout] BlockStatement
src/app.js:95:7
 })
 
 app.post('/fileupload', upload.array('filestoupload'), function (req, res, next) {
-  try {
-    let rutas = req.files.map(f => ({ url: `${app.URL_SERVER}/files/${f.originalname}` }))
-    if (req.headers?.accept?.includes('application/json'))
-      res.status(200).json(rutas).end();
-    else {
-      res.status(200).end(plantillaHTML('Ficheros', xss(`
-        <h1>Ficheros subidos</h1>
-        <ul>${rutas.map(r => `<li><a href="${r.url}">${r.url}</a></li>`).join('')}</ul>
-      `)));
-    }
-  } catch (error) {
+  try {} catch (error) {
     next(generateErrorByError(req, error, 500))
   }

[NoCoverage] ArrowFunction
src/app.js:96:31
 
 app.post('/fileupload', upload.array('filestoupload'), function (req, res, next) {
   try {
-    let rutas = req.files.map(f => ({ url: `${app.URL_SERVER}/files/${f.originalname}` }))
+    let rutas = req.files.map(() => undefined)
     if (req.headers?.accept?.includes('application/json'))
       res.status(200).json(rutas).end();

[NoCoverage] StringLiteral
src/app.js:96:44
 
 app.post('/fileupload', upload.array('filestoupload'), function (req, res, next) {
   try {
-    let rutas = req.files.map(f => ({ url: `${app.URL_SERVER}/files/${f.originalname}` }))
+    let rutas = req.files.map(f => ({ url: `` }))
     if (req.headers?.accept?.includes('application/json'))
       res.status(200).json(rutas).end();

[NoCoverage] ConditionalExpression
src/app.js:97:9
 app.post('/fileupload', upload.array('filestoupload'), function (req, res, next) {
   try {
     let rutas = req.files.map(f => ({ url: `${app.URL_SERVER}/files/${f.originalname}` }))
-    if (req.headers?.accept?.includes('application/json'))
+    if (false)
       res.status(200).json(rutas).end();
     else {

[NoCoverage] ConditionalExpression
src/app.js:97:9
 app.post('/fileupload', upload.array('filestoupload'), function (req, res, next) {
   try {
     let rutas = req.files.map(f => ({ url: `${app.URL_SERVER}/files/${f.originalname}` }))
-    if (req.headers?.accept?.includes('application/json'))
+    if (true)
       res.status(200).json(rutas).end();
     else {

[NoCoverage] BlockStatement
src/app.js:99:10
     let rutas = req.files.map(f => ({ url: `${app.URL_SERVER}/files/${f.originalname}` }))
     if (req.headers?.accept?.includes('application/json'))
       res.status(200).json(rutas).end();
-    else {
-      res.status(200).end(plantillaHTML('Ficheros', xss(`
-        <h1>Ficheros subidos</h1>
-        <ul>${rutas.map(r => `<li><a href="${r.url}">${r.url}</a></li>`).join('')}</ul>
-      `)));
-    }
+    else {}
   } catch (error) {
     next(generateErrorByError(req, error, 500))

[NoCoverage] ArrowFunction
src/app.js:102:25
     else {
       res.status(200).end(plantillaHTML('Ficheros', xss(`
         <h1>Ficheros subidos</h1>
-        <ul>${rutas.map(r => `<li><a href="${r.url}">${r.url}</a></li>`).join('')}</ul>
+        <ul>${rutas.map(() => undefined).join('')}</ul>
       `)));
     }

[Timeout] BlockStatement
src/app.js:105:19
         <ul>${rutas.map(r => `<li><a href="${r.url}">${r.url}</a></li>`).join('')}</ul>
       `)));
     }
-  } catch (error) {
-    next(generateErrorByError(req, error, 500))
-  }
+  } catch (error) {}
 })
 

[Killed] ConditionalExpression
src/app.js:114:5
 app.use(seguridad.useCORS)
 
 // Cookie-to-Header Token
-if (VALIDATE_XSRF_TOKEN) {
+if (false) {
   app.use(seguridad.useXSRF)
 }
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] ConditionalExpression
src/app.js:114:5
 app.use(seguridad.useCORS)
 
 // Cookie-to-Header Token
-if (VALIDATE_XSRF_TOKEN) {
+if (true) {
   app.use(seguridad.useXSRF)
 }

[Survived] LogicalOperator
src/app.js:121:86
 // Validación OpenApi
 app.use(
   OpenApiValidator.middleware({
-    apiSpec: generaSwaggerSpecification(app.PUERTO, config.paths.API_REST, shutdown, config.paths.API_AUTH ?? '/'),
+    apiSpec: generaSwaggerSpecification(app.PUERTO, config.paths.API_REST, shutdown, config.paths.API_AUTH && '/'),
     validateRequests: {
       allowUnknownQueryParameters: true,

[NoCoverage] StringLiteral
src/app.js:121:111
 // Validación OpenApi
 app.use(
   OpenApiValidator.middleware({
-    apiSpec: generaSwaggerSpecification(app.PUERTO, config.paths.API_REST, shutdown, config.paths.API_AUTH ?? '/'),
+    apiSpec: generaSwaggerSpecification(app.PUERTO, config.paths.API_REST, shutdown, config.paths.API_AUTH ?? ""),
     validateRequests: {
       allowUnknownQueryParameters: true,

[Killed] ObjectLiteral
src/app.js:122:23
 app.use(
   OpenApiValidator.middleware({
     apiSpec: generaSwaggerSpecification(app.PUERTO, config.paths.API_REST, shutdown, config.paths.API_AUTH ?? '/'),
-    validateRequests: {
-      allowUnknownQueryParameters: true,
-    },
+    validateRequests: {},
     validateResponses: true, // false by default
     validateSecurity: false,
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] BooleanLiteral
src/app.js:123:36
   OpenApiValidator.middleware({
     apiSpec: generaSwaggerSpecification(app.PUERTO, config.paths.API_REST, shutdown, config.paths.API_AUTH ?? '/'),
     validateRequests: {
-      allowUnknownQueryParameters: true,
+      allowUnknownQueryParameters: false,
     },
     validateResponses: true, // false by default
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] BooleanLiteral
src/app.js:125:24
     validateRequests: {
       allowUnknownQueryParameters: true,
     },
-    validateResponses: true, // false by default
+    validateResponses: false, // false by default
     validateSecurity: false,
     ignoreUndocumented: true,
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] BooleanLiteral
src/app.js:126:23
       allowUnknownQueryParameters: true,
     },
     validateResponses: true, // false by default
-    validateSecurity: false,
+    validateSecurity: true,
     ignoreUndocumented: true,
     formats: [

[Timeout] BooleanLiteral
src/app.js:127:25
     },
     validateResponses: true, // false by default
     validateSecurity: false,
-    ignoreUndocumented: true,
+    ignoreUndocumented: false,
     formats: [
       { name: 'nif', type: 'string', validate: (v) => validator.isIdentityCard(v, 'ES') },

[Survived] ArrayDeclaration
src/app.js:128:14
     validateResponses: true, // false by default
     validateSecurity: false,
     ignoreUndocumented: true,
-    formats: [
-      { name: 'nif', type: 'string', validate: (v) => validator.isIdentityCard(v, 'ES') },
-    ]
+    formats: []
   })
 )

[Killed] ArrowFunction
src/app.js:129:48
     validateSecurity: false,
     ignoreUndocumented: true,
     formats: [
-      { name: 'nif', type: 'string', validate: (v) => validator.isIdentityCard(v, 'ES') },
+      { name: 'nif', type: 'string', validate: () => undefined },
     ]
   })
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ObjectLiteral
src/app.js:129:7
     validateSecurity: false,
     ignoreUndocumented: true,
     formats: [
-      { name: 'nif', type: 'string', validate: (v) => validator.isIdentityCard(v, 'ES') },
+      {},
     ]
   })
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] LogicalOperator
src/app.js:136:9
 
 // Control de acceso
 // app.use(DIR_API_REST, seguridad)
-app.use(config.paths.API_AUTH ?? '/', seguridad)
+app.use(config.paths.API_AUTH && '/', seguridad)
 app.use(config.paths.API_REST ?? '/', seguridad)
 

[Killed] LogicalOperator
src/app.js:137:9
 // Control de acceso
 // app.use(DIR_API_REST, seguridad)
 app.use(config.paths.API_AUTH ?? '/', seguridad)
-app.use(config.paths.API_REST ?? '/', seguridad)
+app.use(config.paths.API_REST && '/', seguridad)
 
 // Servicios web
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] BlockStatement
src/app.js:143:59
 app.use(config.paths.API_REST, apiRouter.router);
 
 // Documentación OpenApi
-app.all('/api-docs/v1/openapi.json', function (_req, res) {
-  let result = generaSwaggerSpecification(app.PUERTO, config.paths.API_REST, shutdown, config.paths.API_AUTH ?? '/')
-  res.json(result)
-});
+app.all('/api-docs/v1/openapi.json', function (_req, res) {});
 app.all('/api-docs/v1/openapi.yaml', function (_req, res) {
   let result = generaSwaggerSpecification(app.PUERTO, config.paths.API_REST, shutdown, config.paths.API_AUTH ?? '/')

[Timeout] LogicalOperator
src/app.js:144:88
 
 // Documentación OpenApi
 app.all('/api-docs/v1/openapi.json', function (_req, res) {
-  let result = generaSwaggerSpecification(app.PUERTO, config.paths.API_REST, shutdown, config.paths.API_AUTH ?? '/')
+  let result = generaSwaggerSpecification(app.PUERTO, config.paths.API_REST, shutdown, config.paths.API_AUTH && '/')
   res.json(result)
 });

[Timeout] BlockStatement
src/app.js:147:59
   let result = generaSwaggerSpecification(app.PUERTO, config.paths.API_REST, shutdown, config.paths.API_AUTH ?? '/')
   res.json(result)
 });
-app.all('/api-docs/v1/openapi.yaml', function (_req, res) {
-  let result = generaSwaggerSpecification(app.PUERTO, config.paths.API_REST, shutdown, config.paths.API_AUTH ?? '/')
-  res.contentType('text/yaml').end(YAML.stringify(result))
-});
+app.all('/api-docs/v1/openapi.yaml', function (_req, res) {});
 
 // Swaggger-ui

[Timeout] LogicalOperator
src/app.js:148:88
   res.json(result)
 });
 app.all('/api-docs/v1/openapi.yaml', function (_req, res) {
-  let result = generaSwaggerSpecification(app.PUERTO, config.paths.API_REST, shutdown, config.paths.API_AUTH ?? '/')
+  let result = generaSwaggerSpecification(app.PUERTO, config.paths.API_REST, shutdown, config.paths.API_AUTH && '/')
   res.contentType('text/yaml').end(YAML.stringify(result))
 });

[Killed] BooleanLiteral
src/app.js:154:13
 
 // Swaggger-ui
 const options = {
-  explorer: true,
+  explorer: false,
   swaggerOptions: {
     url: '/api-docs/v1/openapi.json',
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Survived] StringLiteral
src/app.js:156:10
 const options = {
   explorer: true,
   swaggerOptions: {
-    url: '/api-docs/v1/openapi.json',
+    url: "",
     docExpansion: 'none',
     tagsSorter: 'alpha',

[Timeout] StringLiteral
src/app.js:157:19
   explorer: true,
   swaggerOptions: {
     url: '/api-docs/v1/openapi.json',
-    docExpansion: 'none',
+    docExpansion: "",
     tagsSorter: 'alpha',
     operationsSorter: 'alpha',

[Timeout] LogicalOperator
src/app.js:162:127
     operationsSorter: 'alpha',
   }
 };
-app.use('/api-docs', swaggerUi.serve, swaggerUi.setup(generaSwaggerSpecification(app.PUERTO, config.paths.API_REST, shutdown, config.paths.API_AUTH ?? '/'), options));
+app.use('/api-docs', swaggerUi.serve, swaggerUi.setup(generaSwaggerSpecification(app.PUERTO, config.paths.API_REST, shutdown, config.paths.API_AUTH && '/'), options));
 
 

[Timeout] BlockStatement
src/app.js:166:38
 
 
 // Páginas HTML
-function plantillaHTML(titulo, body) {
-  return `<!DOCTYPE html>
-    <html lang="es">
-    <head>
-        <meta charset="UTF-8">
-        <title>${titulo}</title>
-        <meta name="viewport" content="width=device-width, initial-scale=1.0">
-        <link rel="stylesheet" href="/mockwebserver/style.css">
-        <link rel="icon" href="/mockwebserver/favicon.ico">
-        <style>
-        </style>
-    </head>
-    <body>
-      ${body}
-    </body>
-  </html>`
-}
+function plantillaHTML(titulo, body) {}
 
 // Autorespondedor de formularios

[Timeout] StringLiteral
src/app.js:167:10
 
 // Páginas HTML
 function plantillaHTML(titulo, body) {
-  return `<!DOCTYPE html>
-    <html lang="es">
-    <head>
-        <meta charset="UTF-8">
-        <title>${titulo}</title>
-        <meta name="viewport" content="width=device-width, initial-scale=1.0">
-        <link rel="stylesheet" href="/mockwebserver/style.css">
-        <link rel="icon" href="/mockwebserver/favicon.ico">
-        <style>
-        </style>
-    </head>
-    <body>
-      ${body}
-    </body>
-  </html>`
+  return ``
 }
 

[Timeout] BlockStatement
src/app.js:185:39
 }
 
 // Autorespondedor de formularios
-function formatColeccion(titulo, col) {
-  let rslt = `<tr><th colspan="2">${titulo}</th></tr>`;
-  for (let c in col)
-    rslt += `<tr><th>${c}</th><td>${col[c]}</td></tr>`
-  return rslt
-}
+function formatColeccion(titulo, col) {}
 app.all('/form', function (req, res) {
   let rslt = ''

[Timeout] StringLiteral
src/app.js:186:14
 
 // Autorespondedor de formularios
 function formatColeccion(titulo, col) {
-  let rslt = `<tr><th colspan="2">${titulo}</th></tr>`;
+  let rslt = ``;
   for (let c in col)
     rslt += `<tr><th>${c}</th><td>${col[c]}</td></tr>`

[Timeout] BlockStatement
src/app.js:191:38
     rslt += `<tr><th>${c}</th><td>${col[c]}</td></tr>`
   return rslt
 }
-app.all('/form', function (req, res) {
-  let rslt = ''
-  let volver = ''
-  let peticion = {};
-  peticion['Method'] = req.method + ' ' + req.protocol + ' ' + req.httpVersion
-  peticion['AJAX'] = req.xhr
-  if (req.header('referer'))
-    volver = `<center><a href="${req.header('referer')}">Volver</a></center>`
-  rslt = `<h1>Datos de la petición</h1>
-  <table border="1">
-  ${formatColeccion('Petici&oacuten', peticion)}
-  ${formatColeccion('Cabeceras', req.headers)}
-  ${formatColeccion('Query Strings', req.query)}
-  ${formatColeccion('Cuerpo', req.body)}
-  </table>
-  ${volver}
-  `
-  res.status(200).end(plantillaHTML('Petición', xss(rslt)))
-})
+app.all('/form', function (req, res) {})
 
 // Eco de la petición

[Timeout] StringLiteral
src/app.js:191:9
     rslt += `<tr><th>${c}</th><td>${col[c]}</td></tr>`
   return rslt
 }
-app.all('/form', function (req, res) {
+app.all("", function (req, res) {
   let rslt = ''
   let volver = ''

[Timeout] StringLiteral
src/app.js:195:58
   let rslt = ''
   let volver = ''
   let peticion = {};
-  peticion['Method'] = req.method + ' ' + req.protocol + ' ' + req.httpVersion
+  peticion['Method'] = req.method + ' ' + req.protocol + "" + req.httpVersion
   peticion['AJAX'] = req.xhr
   if (req.header('referer'))

[Timeout] StringLiteral
src/app.js:196:12
   let volver = ''
   let peticion = {};
   peticion['Method'] = req.method + ' ' + req.protocol + ' ' + req.httpVersion
-  peticion['AJAX'] = req.xhr
+  peticion[""] = req.xhr
   if (req.header('referer'))
     volver = `<center><a href="${req.header('referer')}">Volver</a></center>`

[Timeout] ConditionalExpression
src/app.js:197:7
   let peticion = {};
   peticion['Method'] = req.method + ' ' + req.protocol + ' ' + req.httpVersion
   peticion['AJAX'] = req.xhr
-  if (req.header('referer'))
+  if (false)
     volver = `<center><a href="${req.header('referer')}">Volver</a></center>`
   rslt = `<h1>Datos de la petición</h1>

[Timeout] ConditionalExpression
src/app.js:197:7
   let peticion = {};
   peticion['Method'] = req.method + ' ' + req.protocol + ' ' + req.httpVersion
   peticion['AJAX'] = req.xhr
-  if (req.header('referer'))
+  if (true)
     volver = `<center><a href="${req.header('referer')}">Volver</a></center>`
   rslt = `<h1>Datos de la petición</h1>

[Timeout] BlockStatement
src/app.js:212:42
 })
 
 // Eco de la petición
-app.all('/eco(/*)?', function (req, res) {
-  res.status(200).json({
-    url: req.url,
-    method: req.method,
-    headers: req.headers,
-    authentication: res.locals,
-    'XSRF-TOKEN': VALIDATE_XSRF_TOKEN ? seguridad.generateXsrfToken(req) : 'disabled',
-    cookies: req.cookies,
-    params: req.params,
-    query: req.query,
-    body: req.body,
-    path: path.parse('../')
-  }).end();
-});
+app.all('/eco(/*)?', function (req, res) {});
 
 // Página principal

[Timeout] StringLiteral
src/app.js:229:14
 
 // Página principal
 app.get('/', function (req, res) {
-  let rslt = ''
+  let rslt = "Stryker was here!"
   let srv = app.URL_SERVER
   let apis = `<li><a href='${srv}/eco'>${srv}/eco</a>`

[Timeout] BlockStatement
src/app.js:232:39
   let rslt = ''
   let srv = app.URL_SERVER
   let apis = `<li><a href='${srv}/eco'>${srv}/eco</a>`
-  serviciosConfig.forEach(servicio => {
-    apis += `<li><a href='${srv}${config.paths.API_REST}/${servicio.endpoint}'>${srv}${config.paths.API_REST}/${servicio.endpoint}</a></li>`
-  })
+  serviciosConfig.forEach(servicio => {})
   let token = ''
   if (VALIDATE_XSRF_TOKEN) {

[Timeout] StringLiteral
src/app.js:235:15
   serviciosConfig.forEach(servicio => {
     apis += `<li><a href='${srv}${config.paths.API_REST}/${servicio.endpoint}'>${srv}${config.paths.API_REST}/${servicio.endpoint}</a></li>`
   })
-  let token = ''
+  let token = "Stryker was here!"
   if (VALIDATE_XSRF_TOKEN) {
     // eslint-disable-next-line no-undef

[Timeout] ConditionalExpression
src/app.js:236:7
     apis += `<li><a href='${srv}${config.paths.API_REST}/${servicio.endpoint}'>${srv}${config.paths.API_REST}/${servicio.endpoint}</a></li>`
   })
   let token = ''
-  if (VALIDATE_XSRF_TOKEN) {
+  if (true) {
     // eslint-disable-next-line no-undef
     token = `<input type="hidden" name="xsrftoken" value="${seguridad.generateXsrfToken(req)}">`

[NoCoverage] BlockStatement
src/app.js:236:28
     apis += `<li><a href='${srv}${config.paths.API_REST}/${servicio.endpoint}'>${srv}${config.paths.API_REST}/${servicio.endpoint}</a></li>`
   })
   let token = ''
-  if (VALIDATE_XSRF_TOKEN) {
-    // eslint-disable-next-line no-undef
-    token = `<input type="hidden" name="xsrftoken" value="${seguridad.generateXsrfToken(req)}">`
-  }
+  if (VALIDATE_XSRF_TOKEN) {}
   rslt = `<h1>MOCK Server</h1>
   <div class="flex-container">

[NoCoverage] StringLiteral
src/app.js:238:13
   let token = ''
   if (VALIDATE_XSRF_TOKEN) {
     // eslint-disable-next-line no-undef
-    token = `<input type="hidden" name="xsrftoken" value="${seguridad.generateXsrfToken(req)}">`
+    token = ``
   }
   rslt = `<h1>MOCK Server</h1>

[Timeout] BlockStatement
src/app.js:304:46
 })
 
 // favicon.ico por defecto 
-app.all('/favicon.ico', function (_req, res) {
-  res.download(__dirname + '/favicon.ico')
-});
+app.all('/favicon.ico', function (_req, res) {});
 
 // PushState de HTML5

[Timeout] StringLiteral
src/app.js:305:28
 
 // favicon.ico por defecto 
 app.all('/favicon.ico', function (_req, res) {
-  res.download(__dirname + '/favicon.ico')
+  res.download(__dirname + "")
 });
 

[Timeout] BlockStatement
src/app.js:309:41
 });
 
 // PushState de HTML5
-app.get('/*', function (req, res, next) {
-  const fn = async () => {
-      try {
-        console.info('NOT FOUND 1: %s', req.originalUrl)
-        await fs.access(config.paths.PUBLIC + '/index.html', fs.constants.R_OK | fs.constants.W_OK);
-        res.sendFile('index.html', { root: config.paths.PUBLIC });
-      } catch {
-        console.info('NOT FOUND 2: %s', req.originalUrl)
-        next();
-      }
-    }
-  fn()
-});
+app.get('/*', function (req, res, next) {});
 
 // eslint-disable-next-line no-unused-vars

[Timeout] BlockStatement
src/app.js:310:26
 
 // PushState de HTML5
 app.get('/*', function (req, res, next) {
-  const fn = async () => {
-      try {
-        console.info('NOT FOUND 1: %s', req.originalUrl)
-        await fs.access(config.paths.PUBLIC + '/index.html', fs.constants.R_OK | fs.constants.W_OK);
-        res.sendFile('index.html', { root: config.paths.PUBLIC });
-      } catch {
-        console.info('NOT FOUND 2: %s', req.originalUrl)
-        next();
-      }
-    }
+  const fn = async () => {}
   fn()
 });
