[Timeout] BlockStatement
src/app.js:311:11
 // PushState de HTML5
 app.get('/*', function (req, res, next) {
   const fn = async () => {
-      try {
-        console.info('NOT FOUND 1: %s', req.originalUrl)
-        await fs.access(config.paths.PUBLIC + '/index.html', fs.constants.R_OK | fs.constants.W_OK);
-        res.sendFile('index.html', { root: config.paths.PUBLIC });
-      } catch {
+      try {} catch {
         console.info('NOT FOUND 2: %s', req.originalUrl)
         next();

[Timeout] StringLiteral
src/app.js:312:22
 app.get('/*', function (req, res, next) {
   const fn = async () => {
       try {
-        console.info('NOT FOUND 1: %s', req.originalUrl)
+        console.info("", req.originalUrl)
         await fs.access(config.paths.PUBLIC + '/index.html', fs.constants.R_OK | fs.constants.W_OK);
         res.sendFile('index.html', { root: config.paths.PUBLIC });

[NoCoverage] ObjectLiteral
src/app.js:314:36
       try {
         console.info('NOT FOUND 1: %s', req.originalUrl)
         await fs.access(config.paths.PUBLIC + '/index.html', fs.constants.R_OK | fs.constants.W_OK);
-        res.sendFile('index.html', { root: config.paths.PUBLIC });
+        res.sendFile('index.html', {});
       } catch {
         console.info('NOT FOUND 2: %s', req.originalUrl)

[NoCoverage] StringLiteral
src/app.js:314:22
       try {
         console.info('NOT FOUND 1: %s', req.originalUrl)
         await fs.access(config.paths.PUBLIC + '/index.html', fs.constants.R_OK | fs.constants.W_OK);
-        res.sendFile('index.html', { root: config.paths.PUBLIC });
+        res.sendFile("", { root: config.paths.PUBLIC });
       } catch {
         console.info('NOT FOUND 2: %s', req.originalUrl)

[Timeout] BlockStatement
src/app.js:315:15
         console.info('NOT FOUND 1: %s', req.originalUrl)
         await fs.access(config.paths.PUBLIC + '/index.html', fs.constants.R_OK | fs.constants.W_OK);
         res.sendFile('index.html', { root: config.paths.PUBLIC });
-      } catch {
-        console.info('NOT FOUND 2: %s', req.originalUrl)
-        next();
-      }
+      } catch {}
     }
   fn()

[Timeout] BlockStatement
src/app.js:324:41
 });
 
 // eslint-disable-next-line no-unused-vars
-app.use(function (err, req, res, _next) {
-  const status = err.status ?? err.statusCode ?? 500
-  if (req.accepts('application/json') || req.originalUrl.startsWith(`${config.API_REST}/`)) {
-    res.status(status).json(err.payload ? err.payload : generateErrorByError(req, err, status).payload)
-    return
-  }
-  // render the error page
-  res.locals.message = err.message;
-  res.locals.error = req.app.get('env') === 'development' ? err : {};
-  res.status(status);
-  res.render('error');
-
-});
+app.use(function (err, req, res, _next) {});
 
 module.exports = app;

[Timeout] LogicalOperator
src/app.js:325:18
 
 // eslint-disable-next-line no-unused-vars
 app.use(function (err, req, res, _next) {
-  const status = err.status ?? err.statusCode ?? 500
+  const status = (err.status ?? err.statusCode) && 500
   if (req.accepts('application/json') || req.originalUrl.startsWith(`${config.API_REST}/`)) {
     res.status(status).json(err.payload ? err.payload : generateErrorByError(req, err, status).payload)

[Timeout] LogicalOperator
src/app.js:325:18
 
 // eslint-disable-next-line no-unused-vars
 app.use(function (err, req, res, _next) {
-  const status = err.status ?? err.statusCode ?? 500
+  const status = err.status && err.statusCode ?? 500
   if (req.accepts('application/json') || req.originalUrl.startsWith(`${config.API_REST}/`)) {
     res.status(status).json(err.payload ? err.payload : generateErrorByError(req, err, status).payload)

[Timeout] BlockStatement
src/app.js:326:93
 // eslint-disable-next-line no-unused-vars
 app.use(function (err, req, res, _next) {
   const status = err.status ?? err.statusCode ?? 500
-  if (req.accepts('application/json') || req.originalUrl.startsWith(`${config.API_REST}/`)) {
-    res.status(status).json(err.payload ? err.payload : generateErrorByError(req, err, status).payload)
-    return
-  }
+  if (req.accepts('application/json') || req.originalUrl.startsWith(`${config.API_REST}/`)) {}
   // render the error page
   res.locals.message = err.message;

[Timeout] ConditionalExpression
src/app.js:326:7
 // eslint-disable-next-line no-unused-vars
 app.use(function (err, req, res, _next) {
   const status = err.status ?? err.statusCode ?? 500
-  if (req.accepts('application/json') || req.originalUrl.startsWith(`${config.API_REST}/`)) {
+  if (false) {
     res.status(status).json(err.payload ? err.payload : generateErrorByError(req, err, status).payload)
     return

[Timeout] ConditionalExpression
src/app.js:332:22
   }
   // render the error page
   res.locals.message = err.message;
-  res.locals.error = req.app.get('env') === 'development' ? err : {};
+  res.locals.error = true ? err : {};
   res.status(status);
   res.render('error');
