[NoCoverage] BlockStatement
src/apirest.js:121:37
   }
 }
 apis.putWithoutId = async (servicio, req, res, next) => {
-  if (!req.is('json') || !req.body) {
-    return next(generateErrorByStatus(req, 406))
-  }
+  if (!req.is('json') || !req.body) {}
   if (req.body[servicio.pk] == undefined) {
     return next(generateError(req, 'Invalid identifier', 400))

[Timeout] ConditionalExpression
src/apirest.js:124:7
   if (!req.is('json') || !req.body) {
     return next(generateErrorByStatus(req, 406))
   }
-  if (req.body[servicio.pk] == undefined) {
+  if (false) {
     return next(generateError(req, 'Invalid identifier', 400))
   }

[Timeout] EqualityOperator
src/apirest.js:124:7
   if (!req.is('json') || !req.body) {
     return next(generateErrorByStatus(req, 406))
   }
-  if (req.body[servicio.pk] == undefined) {
+  if (req.body[servicio.pk] != undefined) {
     return next(generateError(req, 'Invalid identifier', 400))
   }

[Timeout] StringLiteral
src/apirest.js:125:36
     return next(generateErrorByStatus(req, 406))
   }
   if (req.body[servicio.pk] == undefined) {
-    return next(generateError(req, 'Invalid identifier', 400))
+    return next(generateError(req, "", 400))
   }
   let element = req.body

[Timeout] BlockStatement
src/apirest.js:128:7
     return next(generateError(req, 'Invalid identifier', 400))
   }
   let element = req.body
-  try {
-    await servicio.db.load()
-    element = await servicio.db.update(element, true);
-    res.status(200).json(element).end()
-  } catch (error) {
+  try {} catch (error) {
     next(generateErrorByError(req, error))
   }

[Timeout] BooleanLiteral
src/apirest.js:130:49
   let element = req.body
   try {
     await servicio.db.load()
-    element = await servicio.db.update(element, true);
+    element = await servicio.db.update(element, false);
     res.status(200).json(element).end()
   } catch (error) {

[Timeout] BlockStatement
src/apirest.js:132:19
     await servicio.db.load()
     element = await servicio.db.update(element, true);
     res.status(200).json(element).end()
-  } catch (error) {
-    next(generateErrorByError(req, error))
-  }
+  } catch (error) {}
 }
 apis.patch = async (servicio, req, res, next) => {

[Timeout] BlockStatement
src/apirest.js:136:50
     next(generateErrorByError(req, error))
   }
 }
-apis.patch = async (servicio, req, res, next) => {
-  if (!req.is('json') || !req.body) {
-    return next(generateErrorByStatus(req, 406))
-  }
-  if (Object.keys(req.body).length == 0) {
-    return next(generateError(req, 'Faltan los datos.', 400))
-  }
-  if (req.body[servicio.pk] != undefined && req.body[servicio.pk] != req.params.id) {
-    return next(generateError(req, 'Invalid identifier', 400))
-  }
-  let partial = req.body
-  try {
-    await servicio.db.load()
-    let element = await servicio.db.change(req.params.id, partial, true);
-    res.status(200).json(element)
-  } catch (error) {
-    next(generateErrorByError(req, error))
-  }
-}
+apis.patch = async (servicio, req, res, next) => {}
 apis.delete = async (servicio, req, res, next) => {
   try {

[NoCoverage] BlockStatement
src/apirest.js:137:37
   }
 }
 apis.patch = async (servicio, req, res, next) => {
-  if (!req.is('json') || !req.body) {
-    return next(generateErrorByStatus(req, 406))
-  }
+  if (!req.is('json') || !req.body) {}
   if (Object.keys(req.body).length == 0) {
     return next(generateError(req, 'Faltan los datos.', 400))

[Timeout] ConditionalExpression
src/apirest.js:137:7
   }
 }
 apis.patch = async (servicio, req, res, next) => {
-  if (!req.is('json') || !req.body) {
+  if (true) {
     return next(generateErrorByStatus(req, 406))
   }

[Timeout] EqualityOperator
src/apirest.js:143:7
   if (Object.keys(req.body).length == 0) {
     return next(generateError(req, 'Faltan los datos.', 400))
   }
-  if (req.body[servicio.pk] != undefined && req.body[servicio.pk] != req.params.id) {
+  if (req.body[servicio.pk] == undefined && req.body[servicio.pk] != req.params.id) {
     return next(generateError(req, 'Invalid identifier', 400))
   }

[Timeout] LogicalOperator
src/apirest.js:143:7
   if (Object.keys(req.body).length == 0) {
     return next(generateError(req, 'Faltan los datos.', 400))
   }
-  if (req.body[servicio.pk] != undefined && req.body[servicio.pk] != req.params.id) {
+  if (req.body[servicio.pk] != undefined || req.body[servicio.pk] != req.params.id) {
     return next(generateError(req, 'Invalid identifier', 400))
   }

[Timeout] BlockStatement
src/apirest.js:147:7
     return next(generateError(req, 'Invalid identifier', 400))
   }
   let partial = req.body
-  try {
-    await servicio.db.load()
-    let element = await servicio.db.change(req.params.id, partial, true);
-    res.status(200).json(element)
-  } catch (error) {
+  try {} catch (error) {
     next(generateErrorByError(req, error))
   }

[Killed] BooleanLiteral
src/apirest.js:149:68
   let partial = req.body
   try {
     await servicio.db.load()
-    let element = await servicio.db.change(req.params.id, partial, true);
+    let element = await servicio.db.change(req.params.id, partial, false);
     res.status(200).json(element)
   } catch (error) {
killedBy: API Rest: Ficheros simulados PATCH OK Con id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -23,10 +23,10 @@
    "fecha": "2015-01-22T16:12:24Z",
    "gender": "Male",

[Timeout] BlockStatement
src/apirest.js:151:19
     await servicio.db.load()
     let element = await servicio.db.change(req.params.id, partial, true);
     res.status(200).json(element)
-  } catch (error) {
-    next(generateErrorByError(req, error))
-  }
+  } catch (error) {}
 }
 apis.delete = async (servicio, req, res, next) => {

[Timeout] BlockStatement
src/apirest.js:155:51
     next(generateErrorByError(req, error))
   }
 }
-apis.delete = async (servicio, req, res, next) => {
-  try {
-    await servicio.db.load()
-    await servicio.db.delete(req.params.id, true)
-    res.sendStatus(204)
-  } catch (error) {
-    next(generateErrorByError(req, error))
-  }
-}
+apis.delete = async (servicio, req, res, next) => {}
 apis.options = async (_servicio, _req, res) => {
   res.status(200).end()

[Timeout] BlockStatement
src/apirest.js:156:7
   }
 }
 apis.delete = async (servicio, req, res, next) => {
-  try {
-    await servicio.db.load()
-    await servicio.db.delete(req.params.id, true)
-    res.sendStatus(204)
-  } catch (error) {
+  try {} catch (error) {
     next(generateErrorByError(req, error))
   }

[Killed] BooleanLiteral
src/apirest.js:158:45
 apis.delete = async (servicio, req, res, next) => {
   try {
     await servicio.db.load()
-    await servicio.db.delete(req.params.id, true)
+    await servicio.db.delete(req.params.id, false)
     res.sendStatus(204)
   } catch (error) {
killedBy: API Rest: Ficheros simulados DELETE OK Exite
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 19
Received: 20

[Timeout] BlockStatement
src/apirest.js:164:48
     next(generateErrorByError(req, error))
   }
 }
-apis.options = async (_servicio, _req, res) => {
-  res.status(200).end()
-}
+apis.options = async (_servicio, _req, res) => {}
 
 serviciosConfig.forEach(servicio => {

[Killed] ConditionalExpression
src/apirest.js:171:31
 serviciosConfig.forEach(servicio => {
   const apiRouter = express.Router();
   // servicio.file = DIR_DATA + servicio.file
-  if (!servicio.operations || servicio.operations.length === 0) servicio.operations = ["GET", "POST", "PUT", "PATCH", "DELETE", "OPTIONS"]
+  if (!servicio.operations || false) servicio.operations = ["GET", "POST", "PUT", "PATCH", "DELETE", "OPTIONS"]
   if (servicio.security) {
     apiRouter.use(useAuthentication)
killedBy: API Rest: Ficheros reales Autenticación bearer CONTACTOS
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
src/apirest.js:171:7
 serviciosConfig.forEach(servicio => {
   const apiRouter = express.Router();
   // servicio.file = DIR_DATA + servicio.file
-  if (!servicio.operations || servicio.operations.length === 0) servicio.operations = ["GET", "POST", "PUT", "PATCH", "DELETE", "OPTIONS"]
+  if (true) servicio.operations = ["GET", "POST", "PUT", "PATCH", "DELETE", "OPTIONS"]
   if (servicio.security) {
     apiRouter.use(useAuthentication)
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ConditionalExpression
src/apirest.js:172:7
   const apiRouter = express.Router();
   // servicio.file = DIR_DATA + servicio.file
   if (!servicio.operations || servicio.operations.length === 0) servicio.operations = ["GET", "POST", "PUT", "PATCH", "DELETE", "OPTIONS"]
-  if (servicio.security) {
+  if (true) {
     apiRouter.use(useAuthentication)
     if (typeof (servicio.security) === 'string') {
killedBy: API Rest: Sin fichero /GET
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 401

[Timeout] BlockStatement
src/apirest.js:172:26
   const apiRouter = express.Router();
   // servicio.file = DIR_DATA + servicio.file
   if (!servicio.operations || servicio.operations.length === 0) servicio.operations = ["GET", "POST", "PUT", "PATCH", "DELETE", "OPTIONS"]
-  if (servicio.security) {
-    apiRouter.use(useAuthentication)
-    if (typeof (servicio.security) === 'string') {
-      apiRouter.use(onlyInRole(servicio.security))
-    } else {
-      apiRouter.use(onlyAuthenticated)
-    }
-  } else if (servicio.readonly) {
+  if (servicio.security) {} else if (servicio.readonly) {
     apiRouter.use(useAuthentication)
     apiRouter.use(readOnly)

[Killed] BlockStatement
src/apirest.js:174:50
   if (!servicio.operations || servicio.operations.length === 0) servicio.operations = ["GET", "POST", "PUT", "PATCH", "DELETE", "OPTIONS"]
   if (servicio.security) {
     apiRouter.use(useAuthentication)
-    if (typeof (servicio.security) === 'string') {
-      apiRouter.use(onlyInRole(servicio.security))
-    } else {
+    if (typeof (servicio.security) === 'string') {} else {
       apiRouter.use(onlyAuthenticated)
     }
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] ConditionalExpression
src/apirest.js:174:9
   if (!servicio.operations || servicio.operations.length === 0) servicio.operations = ["GET", "POST", "PUT", "PATCH", "DELETE", "OPTIONS"]
   if (servicio.security) {
     apiRouter.use(useAuthentication)
-    if (typeof (servicio.security) === 'string') {
+    if (true) {
       apiRouter.use(onlyInRole(servicio.security))
     } else {

[Survived] BlockStatement
src/apirest.js:176:12
     apiRouter.use(useAuthentication)
     if (typeof (servicio.security) === 'string') {
       apiRouter.use(onlyInRole(servicio.security))
-    } else {
-      apiRouter.use(onlyAuthenticated)
-    }
+    } else {}
   } else if (servicio.readonly) {
     apiRouter.use(useAuthentication)

[Killed] ConditionalExpression
src/apirest.js:179:14
     } else {
       apiRouter.use(onlyAuthenticated)
     }
-  } else if (servicio.readonly) {
+  } else if (true) {
     apiRouter.use(useAuthentication)
     apiRouter.use(readOnly)
killedBy: API Rest: Ficheros simulados POST OK Con id=0
statusReason: Error: expected 201 "Created", got 401 "Unauthorized"

[Timeout] BlockStatement
src/apirest.js:179:33
     } else {
       apiRouter.use(onlyAuthenticated)
     }
-  } else if (servicio.readonly) {
-    apiRouter.use(useAuthentication)
-    apiRouter.use(readOnly)
-  }
+  } else if (servicio.readonly) {}
 
   if (servicio.endpoint === 'usuarios') {

[Killed] ConditionalExpression
src/apirest.js:184:7
     apiRouter.use(readOnly)
   }
 
-  if (servicio.endpoint === 'usuarios') {
+  if (false) {
     apiRouter.use(useAuthentication)
     apiRouter.use(onlyInRole('Administradores'))
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] EqualityOperator
src/apirest.js:184:7
     apiRouter.use(readOnly)
   }
 
-  if (servicio.endpoint === 'usuarios') {
+  if (servicio.endpoint !== 'usuarios') {
     apiRouter.use(useAuthentication)
     apiRouter.use(onlyInRole('Administradores'))
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ArithmeticOperator
src/apirest.js:188:28
     apiRouter.use(useAuthentication)
     apiRouter.use(onlyInRole('Administradores'))
   }
-  servicio.db = new DbJSON(config.paths.DATA + servicio.file, servicio.pk);
+  servicio.db = new DbJSON(config.paths.DATA - servicio.file, servicio.pk);
   let sinID = apiRouter.route('/')
   let conID = apiRouter.route('/:id')
killedBy: API Rest: Ficheros simulados GET OK Sin paginar
statusReason: Error: expected 200 "OK", got 500 "Internal Server Error"

[Killed] BlockStatement
src/apirest.js:191:44
   servicio.db = new DbJSON(config.paths.DATA + servicio.file, servicio.pk);
   let sinID = apiRouter.route('/')
   let conID = apiRouter.route('/:id')
-  if (servicio.operations.includes('GET')) {
-    sinID.get((req, res, next) => apis.getAll(servicio, req, res, next))
-    conID.get((req, res, next) => apis.getOne(servicio, req, res, next))
-  }
+  if (servicio.operations.includes('GET')) {}
   if (servicio.operations.includes('POST'))
     sinID.post((req, res, next) => apis.post(servicio, req, res, next))
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ConditionalExpression
src/apirest.js:191:7
   servicio.db = new DbJSON(config.paths.DATA + servicio.file, servicio.pk);
   let sinID = apiRouter.route('/')
   let conID = apiRouter.route('/:id')
-  if (servicio.operations.includes('GET')) {
+  if (false) {
     sinID.get((req, res, next) => apis.getAll(servicio, req, res, next))
     conID.get((req, res, next) => apis.getOne(servicio, req, res, next))
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] ArrowFunction
src/apirest.js:192:15
   let sinID = apiRouter.route('/')
   let conID = apiRouter.route('/:id')
   if (servicio.operations.includes('GET')) {
-    sinID.get((req, res, next) => apis.getAll(servicio, req, res, next))
+    sinID.get(() => undefined)
     conID.get((req, res, next) => apis.getOne(servicio, req, res, next))
   }

[Timeout] ArrowFunction
src/apirest.js:193:15
   let conID = apiRouter.route('/:id')
   if (servicio.operations.includes('GET')) {
     sinID.get((req, res, next) => apis.getAll(servicio, req, res, next))
-    conID.get((req, res, next) => apis.getOne(servicio, req, res, next))
+    conID.get(() => undefined)
   }
   if (servicio.operations.includes('POST'))

[Killed] ConditionalExpression
src/apirest.js:195:7
     sinID.get((req, res, next) => apis.getAll(servicio, req, res, next))
     conID.get((req, res, next) => apis.getOne(servicio, req, res, next))
   }
-  if (servicio.operations.includes('POST'))
+  if (false)
     sinID.post((req, res, next) => apis.post(servicio, req, res, next))
   if (servicio.operations.includes('PUT')) {
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Survived] ConditionalExpression
src/apirest.js:195:7
     sinID.get((req, res, next) => apis.getAll(servicio, req, res, next))
     conID.get((req, res, next) => apis.getOne(servicio, req, res, next))
   }
-  if (servicio.operations.includes('POST'))
+  if (true)
     sinID.post((req, res, next) => apis.post(servicio, req, res, next))
   if (servicio.operations.includes('PUT')) {

[Timeout] ArrowFunction
src/apirest.js:196:16
     conID.get((req, res, next) => apis.getOne(servicio, req, res, next))
   }
   if (servicio.operations.includes('POST'))
-    sinID.post((req, res, next) => apis.post(servicio, req, res, next))
+    sinID.post(() => undefined)
   if (servicio.operations.includes('PUT')) {
     sinID.put((req, res, next) => apis.putWithoutId(servicio, req, res, next))

[Killed] BlockStatement
src/apirest.js:197:44
   }
   if (servicio.operations.includes('POST'))
     sinID.post((req, res, next) => apis.post(servicio, req, res, next))
-  if (servicio.operations.includes('PUT')) {
-    sinID.put((req, res, next) => apis.putWithoutId(servicio, req, res, next))
-    conID.put((req, res, next) => apis.put(servicio, req, res, next))
-  }
+  if (servicio.operations.includes('PUT')) {}
   if (servicio.operations.includes('OPTIONS')) {
     sinID.options((req, res, next) => apis.options(servicio, req, res, next));
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ConditionalExpression
src/apirest.js:197:7
   }
   if (servicio.operations.includes('POST'))
     sinID.post((req, res, next) => apis.post(servicio, req, res, next))
-  if (servicio.operations.includes('PUT')) {
+  if (false) {
     sinID.put((req, res, next) => apis.putWithoutId(servicio, req, res, next))
     conID.put((req, res, next) => apis.put(servicio, req, res, next))
killedBy: API Rest: Ficheros simulados PUT OK Con id
statusReason: Error: expected 204 "No Content", got 404 "Not Found"

[Timeout] ArrowFunction
src/apirest.js:198:15
   if (servicio.operations.includes('POST'))
     sinID.post((req, res, next) => apis.post(servicio, req, res, next))
   if (servicio.operations.includes('PUT')) {
-    sinID.put((req, res, next) => apis.putWithoutId(servicio, req, res, next))
+    sinID.put(() => undefined)
     conID.put((req, res, next) => apis.put(servicio, req, res, next))
   }

[Timeout] ArrowFunction
src/apirest.js:199:15
     sinID.post((req, res, next) => apis.post(servicio, req, res, next))
   if (servicio.operations.includes('PUT')) {
     sinID.put((req, res, next) => apis.putWithoutId(servicio, req, res, next))
-    conID.put((req, res, next) => apis.put(servicio, req, res, next))
+    conID.put(() => undefined)
   }
   if (servicio.operations.includes('OPTIONS')) {

[Killed] BlockStatement
src/apirest.js:201:48
     sinID.put((req, res, next) => apis.putWithoutId(servicio, req, res, next))
     conID.put((req, res, next) => apis.put(servicio, req, res, next))
   }
-  if (servicio.operations.includes('OPTIONS')) {
-    sinID.options((req, res, next) => apis.options(servicio, req, res, next));
-    conID.options((req, res, next) => apis.options(servicio, req, res, next));
-  }
+  if (servicio.operations.includes('OPTIONS')) {}
   if (servicio.operations.includes('PATCH'))
     conID.patch((req, res, next) => apis.patch(servicio, req, res, next))
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Survived] ConditionalExpression
src/apirest.js:201:7
     sinID.put((req, res, next) => apis.putWithoutId(servicio, req, res, next))
     conID.put((req, res, next) => apis.put(servicio, req, res, next))
   }
-  if (servicio.operations.includes('OPTIONS')) {
+  if (true) {
     sinID.options((req, res, next) => apis.options(servicio, req, res, next));
     conID.options((req, res, next) => apis.options(servicio, req, res, next));

[Timeout] ArrowFunction
src/apirest.js:202:19
     conID.put((req, res, next) => apis.put(servicio, req, res, next))
   }
   if (servicio.operations.includes('OPTIONS')) {
-    sinID.options((req, res, next) => apis.options(servicio, req, res, next));
+    sinID.options(() => undefined);
     conID.options((req, res, next) => apis.options(servicio, req, res, next));
   }

[Timeout] ArrowFunction
src/apirest.js:203:19
   }
   if (servicio.operations.includes('OPTIONS')) {
     sinID.options((req, res, next) => apis.options(servicio, req, res, next));
-    conID.options((req, res, next) => apis.options(servicio, req, res, next));
+    conID.options(() => undefined);
   }
   if (servicio.operations.includes('PATCH'))

[Killed] ConditionalExpression
src/apirest.js:205:7
     sinID.options((req, res, next) => apis.options(servicio, req, res, next));
     conID.options((req, res, next) => apis.options(servicio, req, res, next));
   }
-  if (servicio.operations.includes('PATCH'))
+  if (false)
     conID.patch((req, res, next) => apis.patch(servicio, req, res, next))
   if (servicio.operations.includes('DELETE'))
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Survived] ConditionalExpression
src/apirest.js:205:7
     sinID.options((req, res, next) => apis.options(servicio, req, res, next));
     conID.options((req, res, next) => apis.options(servicio, req, res, next));
   }
-  if (servicio.operations.includes('PATCH'))
+  if (true)
     conID.patch((req, res, next) => apis.patch(servicio, req, res, next))
   if (servicio.operations.includes('DELETE'))

[Timeout] ArrowFunction
src/apirest.js:206:17
     conID.options((req, res, next) => apis.options(servicio, req, res, next));
   }
   if (servicio.operations.includes('PATCH'))
-    conID.patch((req, res, next) => apis.patch(servicio, req, res, next))
+    conID.patch(() => undefined)
   if (servicio.operations.includes('DELETE'))
     conID.delete((req, res, next) => apis.delete(servicio, req, res, next))

[Timeout] ConditionalExpression
src/apirest.js:207:7
   }
   if (servicio.operations.includes('PATCH'))
     conID.patch((req, res, next) => apis.patch(servicio, req, res, next))
-  if (servicio.operations.includes('DELETE'))
+  if (false)
     conID.delete((req, res, next) => apis.delete(servicio, req, res, next))
   router.use('/' + servicio.endpoint, apiRouter)

[Survived] ConditionalExpression
src/apirest.js:207:7
   }
   if (servicio.operations.includes('PATCH'))
     conID.patch((req, res, next) => apis.patch(servicio, req, res, next))
-  if (servicio.operations.includes('DELETE'))
+  if (true)
     conID.delete((req, res, next) => apis.delete(servicio, req, res, next))
   router.use('/' + servicio.endpoint, apiRouter)

[Timeout] ArrowFunction
src/apirest.js:208:18
   if (servicio.operations.includes('PATCH'))
     conID.patch((req, res, next) => apis.patch(servicio, req, res, next))
   if (servicio.operations.includes('DELETE'))
-    conID.delete((req, res, next) => apis.delete(servicio, req, res, next))
+    conID.delete(() => undefined)
   router.use('/' + servicio.endpoint, apiRouter)
 })
