[Timeout] BlockStatement
src/dbJSON.js:4:32
 const fs = require('fs/promises');
 
 class DbJSONError extends Error {
-    constructor(message, code) {
-        super(message);
-        this.name = 'dbJSONError';
-        this.code = code;
-    }
+    constructor(message, code) {}
 }
 

[Timeout] StringLiteral
src/dbJSON.js:6:21
 class DbJSONError extends Error {
     constructor(message, code) {
         super(message);
-        this.name = 'dbJSONError';
+        this.name = "";
         this.code = code;
     }

[Killed] BlockStatement
src/dbJSON.js:12:49
 }
 
 class DbJSON {
-    constructor(filename, pk, autoSave = false) {
-        this.__filename = filename
-        this.__pk = pk
-        this.__autoSave = autoSave
-        this.__data = null
-    }
+    constructor(filename, pk, autoSave = false) {}
     async load(force = false) {
         if (this.__data && !force && process.env.NODE_ENV !== 'test')
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] BooleanLiteral
src/dbJSON.js:12:42
 }
 
 class DbJSON {
-    constructor(filename, pk, autoSave = false) {
+    constructor(filename, pk, autoSave = true) {
         this.__filename = filename
         this.__pk = pk

[Timeout] BooleanLiteral
src/dbJSON.js:18:24
         this.__autoSave = autoSave
         this.__data = null
     }
-    async load(force = false) {
+    async load(force = true) {
         if (this.__data && !force && process.env.NODE_ENV !== 'test')
             return

[Timeout] BlockStatement
src/dbJSON.js:18:31
         this.__autoSave = autoSave
         this.__data = null
     }
-    async load(force = false) {
-        if (this.__data && !force && process.env.NODE_ENV !== 'test')
-            return
-
-        let result = await fs.readFile(this.__filename, 'utf8')
-        this.__data = JSON.parse(result)
-    }
+    async load(force = false) {}
     async save() {
         await fs.writeFile(this.__filename, JSON.stringify(this.__data), 'utf8');

[Timeout] LogicalOperator
src/dbJSON.js:19:13
         this.__data = null
     }
     async load(force = false) {
-        if (this.__data && !force && process.env.NODE_ENV !== 'test')
+        if (this.__data && !force || process.env.NODE_ENV !== 'test')
             return
 

[Timeout] LogicalOperator
src/dbJSON.js:19:13
         this.__data = null
     }
     async load(force = false) {
-        if (this.__data && !force && process.env.NODE_ENV !== 'test')
+        if (this.__data || !force && process.env.NODE_ENV !== 'test')
             return
 

[Timeout] BlockStatement
src/dbJSON.js:25:18
         let result = await fs.readFile(this.__filename, 'utf8')
         this.__data = JSON.parse(result)
     }
-    async save() {
-        await fs.writeFile(this.__filename, JSON.stringify(this.__data), 'utf8');
-    }
+    async save() {}
     get isLoad() { return this.__data !== null }
     get list() {

[Timeout] EqualityOperator
src/dbJSON.js:28:27
     async save() {
         await fs.writeFile(this.__filename, JSON.stringify(this.__data), 'utf8');
     }
-    get isLoad() { return this.__data !== null }
+    get isLoad() { return this.__data === null }
     get list() {
         if (!this.isLoad)

[Timeout] ConditionalExpression
src/dbJSON.js:28:27
     async save() {
         await fs.writeFile(this.__filename, JSON.stringify(this.__data), 'utf8');
     }
-    get isLoad() { return this.__data !== null }
+    get isLoad() { return false }
     get list() {
         if (!this.isLoad)

[Timeout] BlockStatement
src/dbJSON.js:29:16
         await fs.writeFile(this.__filename, JSON.stringify(this.__data), 'utf8');
     }
     get isLoad() { return this.__data !== null }
-    get list() {
-        if (!this.isLoad)
-            throw new DbJSONError('Data not loading', 500)
-        return this.__data;
-    }
+    get list() {}
     get loadList() {
         if (!this.isLoad)

[Timeout] ConditionalExpression
src/dbJSON.js:30:13
     }
     get isLoad() { return this.__data !== null }
     get list() {
-        if (!this.isLoad)
+        if (true)
             throw new DbJSONError('Data not loading', 500)
         return this.__data;

[Timeout] BooleanLiteral
src/dbJSON.js:30:13
     }
     get isLoad() { return this.__data !== null }
     get list() {
-        if (!this.isLoad)
+        if (this.isLoad)
             throw new DbJSONError('Data not loading', 500)
         return this.__data;

[Timeout] BlockStatement
src/dbJSON.js:34:20
             throw new DbJSONError('Data not loading', 500)
         return this.__data;
     }
-    get loadList() {
-        if (!this.isLoad)
-            return new Promise((resolve, rejects) => {
-                this.load().then(() => resolve(this.__data), err => rejects(err))
-            })
-        return Promise.resolve(this.__data);
-    }
+    get loadList() {}
 
     __comparaValores(a, b) {

[Timeout] BooleanLiteral
src/dbJSON.js:35:13
         return this.__data;
     }
     get loadList() {
-        if (!this.isLoad)
+        if (this.isLoad)
             return new Promise((resolve, rejects) => {
                 this.load().then(() => resolve(this.__data), err => rejects(err))

[Timeout] ConditionalExpression
src/dbJSON.js:35:13
         return this.__data;
     }
     get loadList() {
-        if (!this.isLoad)
+        if (false)
             return new Promise((resolve, rejects) => {
                 this.load().then(() => resolve(this.__data), err => rejects(err))

[Timeout] BlockStatement
src/dbJSON.js:36:54
     }
     get loadList() {
         if (!this.isLoad)
-            return new Promise((resolve, rejects) => {
-                this.load().then(() => resolve(this.__data), err => rejects(err))
-            })
+            return new Promise((resolve, rejects) => {})
         return Promise.resolve(this.__data);
     }

[Timeout] ArrowFunction
src/dbJSON.js:37:62
     get loadList() {
         if (!this.isLoad)
             return new Promise((resolve, rejects) => {
-                this.load().then(() => resolve(this.__data), err => rejects(err))
+                this.load().then(() => resolve(this.__data), () => undefined)
             })
         return Promise.resolve(this.__data);

[Timeout] ArrowFunction
src/dbJSON.js:37:34
     get loadList() {
         if (!this.isLoad)
             return new Promise((resolve, rejects) => {
-                this.load().then(() => resolve(this.__data), err => rejects(err))
+                this.load().then(() => undefined, err => rejects(err))
             })
         return Promise.resolve(this.__data);

[Timeout] BlockStatement
src/dbJSON.js:42:28
         return Promise.resolve(this.__data);
     }
 
-    __comparaValores(a, b) {
-        return a == b ? 0 : (a < b ? -1 : 1)
-    }
+    __comparaValores(a, b) {}
     __comparaMultiplesPropiedades(a, b, properties, index) {
         let result = properties[index].dir * this.__comparaValores(a[properties[index].cmp], b[properties[index].cmp])

[Timeout] EqualityOperator
src/dbJSON.js:43:16
     }
 
     __comparaValores(a, b) {
-        return a == b ? 0 : (a < b ? -1 : 1)
+        return a != b ? 0 : (a < b ? -1 : 1)
     }
     __comparaMultiplesPropiedades(a, b, properties, index) {

[Timeout] ConditionalExpression
src/dbJSON.js:43:16
     }
 
     __comparaValores(a, b) {
-        return a == b ? 0 : (a < b ? -1 : 1)
+        return false ? 0 : (a < b ? -1 : 1)
     }
     __comparaMultiplesPropiedades(a, b, properties, index) {

[Timeout] BlockStatement
src/dbJSON.js:45:60
     __comparaValores(a, b) {
         return a == b ? 0 : (a < b ? -1 : 1)
     }
-    __comparaMultiplesPropiedades(a, b, properties, index) {
-        let result = properties[index].dir * this.__comparaValores(a[properties[index].cmp], b[properties[index].cmp])
-        if (result !== 0 || index + 1 === properties.length) return result;
-        return this.__comparaMultiplesPropiedades(a, b, properties, index + 1);
-    }
+    __comparaMultiplesPropiedades(a, b, properties, index) {}
     __proyectar(projection) {
         const propiedades = projection.replace(/ /g, '').split(',');

[Timeout] ArithmeticOperator
src/dbJSON.js:46:22
         return a == b ? 0 : (a < b ? -1 : 1)
     }
     __comparaMultiplesPropiedades(a, b, properties, index) {
-        let result = properties[index].dir * this.__comparaValores(a[properties[index].cmp], b[properties[index].cmp])
+        let result = properties[index].dir / this.__comparaValores(a[properties[index].cmp], b[properties[index].cmp])
         if (result !== 0 || index + 1 === properties.length) return result;
         return this.__comparaMultiplesPropiedades(a, b, properties, index + 1);

[Timeout] ArithmeticOperator
src/dbJSON.js:47:29
     }
     __comparaMultiplesPropiedades(a, b, properties, index) {
         let result = properties[index].dir * this.__comparaValores(a[properties[index].cmp], b[properties[index].cmp])
-        if (result !== 0 || index + 1 === properties.length) return result;
+        if (result !== 0 || index - 1 === properties.length) return result;
         return this.__comparaMultiplesPropiedades(a, b, properties, index + 1);
     }

[Timeout] ConditionalExpression
src/dbJSON.js:47:13
     }
     __comparaMultiplesPropiedades(a, b, properties, index) {
         let result = properties[index].dir * this.__comparaValores(a[properties[index].cmp], b[properties[index].cmp])
-        if (result !== 0 || index + 1 === properties.length) return result;
+        if (false) return result;
         return this.__comparaMultiplesPropiedades(a, b, properties, index + 1);
     }

[Timeout] ArithmeticOperator
src/dbJSON.js:48:69
     __comparaMultiplesPropiedades(a, b, properties, index) {
         let result = properties[index].dir * this.__comparaValores(a[properties[index].cmp], b[properties[index].cmp])
         if (result !== 0 || index + 1 === properties.length) return result;
-        return this.__comparaMultiplesPropiedades(a, b, properties, index + 1);
+        return this.__comparaMultiplesPropiedades(a, b, properties, index - 1);
     }
     __proyectar(projection) {

[Timeout] BlockStatement
src/dbJSON.js:50:29
         if (result !== 0 || index + 1 === properties.length) return result;
         return this.__comparaMultiplesPropiedades(a, b, properties, index + 1);
     }
-    __proyectar(projection) {
-        const propiedades = projection.replace(/ /g, '').split(',');
-        return item => {
-            let e = {};
-            propiedades.forEach(c => {
-                if (item[c] != undefined) e[c] = item[c]
-            });
-            return Object.keys(e).length > 0 ? e : item;
-        }
-    }
+    __proyectar(projection) {}
     getById(id, projection) {
         const result = this.list.find(item => item[this.__pk] == id)

[Timeout] BlockStatement
src/dbJSON.js:52:24
     }
     __proyectar(projection) {
         const propiedades = projection.replace(/ /g, '').split(',');
-        return item => {
-            let e = {};
-            propiedades.forEach(c => {
-                if (item[c] != undefined) e[c] = item[c]
-            });
-            return Object.keys(e).length > 0 ? e : item;
-        }
+        return item => {}
     }
     getById(id, projection) {

[Timeout] BlockStatement
src/dbJSON.js:54:38
         const propiedades = projection.replace(/ /g, '').split(',');
         return item => {
             let e = {};
-            propiedades.forEach(c => {
-                if (item[c] != undefined) e[c] = item[c]
-            });
+            propiedades.forEach(c => {});
             return Object.keys(e).length > 0 ? e : item;
         }

[Timeout] ConditionalExpression
src/dbJSON.js:55:21
         return item => {
             let e = {};
             propiedades.forEach(c => {
-                if (item[c] != undefined) e[c] = item[c]
+                if (false) e[c] = item[c]
             });
             return Object.keys(e).length > 0 ? e : item;

[Timeout] EqualityOperator
src/dbJSON.js:55:21
         return item => {
             let e = {};
             propiedades.forEach(c => {
-                if (item[c] != undefined) e[c] = item[c]
+                if (item[c] == undefined) e[c] = item[c]
             });
             return Object.keys(e).length > 0 ? e : item;

[Timeout] ConditionalExpression
src/dbJSON.js:57:20
             propiedades.forEach(c => {
                 if (item[c] != undefined) e[c] = item[c]
             });
-            return Object.keys(e).length > 0 ? e : item;
+            return false ? e : item;
         }
     }

[Timeout] EqualityOperator
src/dbJSON.js:57:20
             propiedades.forEach(c => {
                 if (item[c] != undefined) e[c] = item[c]
             });
-            return Object.keys(e).length > 0 ? e : item;
+            return Object.keys(e).length >= 0 ? e : item;
         }
     }

[Timeout] BlockStatement
src/dbJSON.js:60:29
             return Object.keys(e).length > 0 ? e : item;
         }
     }
-    getById(id, projection) {
-        const result = this.list.find(item => item[this.__pk] == id)
-        if (projection && result)
-            return this.__proyectar(projection)(result)
-        return result
-    }
+    getById(id, projection) {}
     indexById(id) {
         return this.list.findIndex(item => item[this.__pk] == id)

[Timeout] EqualityOperator
src/dbJSON.js:61:47
         }
     }
     getById(id, projection) {
-        const result = this.list.find(item => item[this.__pk] == id)
+        const result = this.list.find(item => item[this.__pk] != id)
         if (projection && result)
             return this.__proyectar(projection)(result)

[Timeout] ArrowFunction
src/dbJSON.js:61:39
         }
     }
     getById(id, projection) {
-        const result = this.list.find(item => item[this.__pk] == id)
+        const result = this.list.find(() => undefined)
         if (projection && result)
             return this.__proyectar(projection)(result)

[Timeout] ConditionalExpression
src/dbJSON.js:62:13
     }
     getById(id, projection) {
         const result = this.list.find(item => item[this.__pk] == id)
-        if (projection && result)
+        if (false)
             return this.__proyectar(projection)(result)
         return result

[Timeout] ConditionalExpression
src/dbJSON.js:62:13
     }
     getById(id, projection) {
         const result = this.list.find(item => item[this.__pk] == id)
-        if (projection && result)
+        if (true)
             return this.__proyectar(projection)(result)
         return result

[Timeout] BlockStatement
src/dbJSON.js:66:19
             return this.__proyectar(projection)(result)
         return result
     }
-    indexById(id) {
-        return this.list.findIndex(item => item[this.__pk] == id)
-    }
+    indexById(id) {}
 
     orderByProperty(source, property, des = false) {

[Timeout] ConditionalExpression
src/dbJSON.js:67:44
         return result
     }
     indexById(id) {
-        return this.list.findIndex(item => item[this.__pk] == id)
+        return this.list.findIndex(item => false)
     }
 

[Timeout] EqualityOperator
src/dbJSON.js:67:44
         return result
     }
     indexById(id) {
-        return this.list.findIndex(item => item[this.__pk] == id)
+        return this.list.findIndex(item => item[this.__pk] != id)
     }
 

[NoCoverage] BooleanLiteral
src/dbJSON.js:70:45
         return this.list.findIndex(item => item[this.__pk] == id)
     }
 
-    orderByProperty(source, property, des = false) {
+    orderByProperty(source, property, des = true) {
         const dir = des ? -1 : 1
         return source.sort((a, b) => dir * this.__comparaValores(a[property], b[property]))

[Timeout] BlockStatement
src/dbJSON.js:70:52
         return this.list.findIndex(item => item[this.__pk] == id)
     }
 
-    orderByProperty(source, property, des = false) {
-        const dir = des ? -1 : 1
-        return source.sort((a, b) => dir * this.__comparaValores(a[property], b[property]))
-    }
+    orderByProperty(source, property, des = false) {}
     sortByProperty(property, des = false) {
         return this.orderByProperty(this.list, property, des)

[Timeout] UnaryOperator
src/dbJSON.js:71:27
     }
 
     orderByProperty(source, property, des = false) {
-        const dir = des ? -1 : 1
+        const dir = des ? +1 : 1
         return source.sort((a, b) => dir * this.__comparaValores(a[property], b[property]))
     }

[Timeout] ArithmeticOperator
src/dbJSON.js:72:38
 
     orderByProperty(source, property, des = false) {
         const dir = des ? -1 : 1
-        return source.sort((a, b) => dir * this.__comparaValores(a[property], b[property]))
+        return source.sort((a, b) => dir / this.__comparaValores(a[property], b[property]))
     }
     sortByProperty(property, des = false) {

[Timeout] ArrowFunction
src/dbJSON.js:72:28
 
     orderByProperty(source, property, des = false) {
         const dir = des ? -1 : 1
-        return source.sort((a, b) => dir * this.__comparaValores(a[property], b[property]))
+        return source.sort(() => undefined)
     }
     sortByProperty(property, des = false) {

[Timeout] BlockStatement
src/dbJSON.js:74:43
         const dir = des ? -1 : 1
         return source.sort((a, b) => dir * this.__comparaValores(a[property], b[property]))
     }
-    sortByProperty(property, des = false) {
-        return this.orderByProperty(this.list, property, des)
-    }
+    sortByProperty(property, des = false) {}
 
     orderByProperties(source, properties) {

[Timeout] BooleanLiteral
src/dbJSON.js:74:36
         const dir = des ? -1 : 1
         return source.sort((a, b) => dir * this.__comparaValores(a[property], b[property]))
     }
-    sortByProperty(property, des = false) {
+    sortByProperty(property, des = true) {
         return this.orderByProperty(this.list, property, des)
     }

[Timeout] BlockStatement
src/dbJSON.js:78:43
         return this.orderByProperty(this.list, property, des)
     }
 
-    orderByProperties(source, properties) {
-        let orderBy = properties.replace(/ /g, '').split(',').map(cmp => {
-            if (cmp.startsWith('-')) {
-                cmp = cmp.substring(1);
-                return { cmp, dir: -1 }
-            }
-            return { cmp, dir: 1 }
-        })
-        return source.sort((a, b) => this.__comparaMultiplesPropiedades(a, b, orderBy, 0))
-    }
+    orderByProperties(source, properties) {}
     sortByProperties(properties) {
         return this.orderByProperties(this.list, properties)

[Timeout] BlockStatement
src/dbJSON.js:79:74
     }
 
     orderByProperties(source, properties) {
-        let orderBy = properties.replace(/ /g, '').split(',').map(cmp => {
-            if (cmp.startsWith('-')) {
-                cmp = cmp.substring(1);
-                return { cmp, dir: -1 }
-            }
-            return { cmp, dir: 1 }
-        })
+        let orderBy = properties.replace(/ /g, '').split(',').map(cmp => {})
         return source.sort((a, b) => this.__comparaMultiplesPropiedades(a, b, orderBy, 0))
     }

[Timeout] StringLiteral
src/dbJSON.js:79:48
     }
 
     orderByProperties(source, properties) {
-        let orderBy = properties.replace(/ /g, '').split(',').map(cmp => {
+        let orderBy = properties.replace(/ /g, "Stryker was here!").split(',').map(cmp => {
             if (cmp.startsWith('-')) {
                 cmp = cmp.substring(1);

[Timeout] MethodExpression
src/dbJSON.js:80:17
 
     orderByProperties(source, properties) {
         let orderBy = properties.replace(/ /g, '').split(',').map(cmp => {
-            if (cmp.startsWith('-')) {
+            if (cmp.endsWith('-')) {
                 cmp = cmp.substring(1);
                 return { cmp, dir: -1 }

[Timeout] ConditionalExpression
src/dbJSON.js:80:17
 
     orderByProperties(source, properties) {
         let orderBy = properties.replace(/ /g, '').split(',').map(cmp => {
-            if (cmp.startsWith('-')) {
+            if (false) {
                 cmp = cmp.substring(1);
                 return { cmp, dir: -1 }

[Timeout] MethodExpression
src/dbJSON.js:81:23
     orderByProperties(source, properties) {
         let orderBy = properties.replace(/ /g, '').split(',').map(cmp => {
             if (cmp.startsWith('-')) {
-                cmp = cmp.substring(1);
+                cmp = cmp;
                 return { cmp, dir: -1 }
             }

[Timeout] UnaryOperator
src/dbJSON.js:82:36
         let orderBy = properties.replace(/ /g, '').split(',').map(cmp => {
             if (cmp.startsWith('-')) {
                 cmp = cmp.substring(1);
-                return { cmp, dir: -1 }
+                return { cmp, dir: +1 }
             }
             return { cmp, dir: 1 }

[Timeout] MethodExpression
src/dbJSON.js:86:16
             }
             return { cmp, dir: 1 }
         })
-        return source.sort((a, b) => this.__comparaMultiplesPropiedades(a, b, orderBy, 0))
+        return source
     }
     sortByProperties(properties) {

[Timeout] ArrowFunction
src/dbJSON.js:86:28
             }
             return { cmp, dir: 1 }
         })
-        return source.sort((a, b) => this.__comparaMultiplesPropiedades(a, b, orderBy, 0))
+        return source.sort(() => undefined)
     }
     sortByProperties(properties) {

[Timeout] BlockStatement
src/dbJSON.js:88:34
         })
         return source.sort((a, b) => this.__comparaMultiplesPropiedades(a, b, orderBy, 0))
     }
-    sortByProperties(properties) {
-        return this.orderByProperties(this.list, properties)
-    }
+    sortByProperties(properties) {}
     select(projection, where, orderBy) {
         let result = this.list;

[Timeout] BlockStatement
src/dbJSON.js:91:40
     sortByProperties(properties) {
         return this.orderByProperties(this.list, properties)
     }
-    select(projection, where, orderBy) {
-        let result = this.list;
-        if (where)
-            result = result.filter(where)
-        if (orderBy)
-            result = this.orderByProperties(result, orderBy)
-        if (projection && projection !== '*')
-            result = result.map(this.__proyectar(projection))
-        return result
-    }
+    select(projection, where, orderBy) {}
     add(element, persist = false) {
         if (element[this.__pk] == undefined) {

[Timeout] ConditionalExpression
src/dbJSON.js:93:13
     }
     select(projection, where, orderBy) {
         let result = this.list;
-        if (where)
+        if (true)
             result = result.filter(where)
         if (orderBy)

[Timeout] ConditionalExpression
src/dbJSON.js:93:13
     }
     select(projection, where, orderBy) {
         let result = this.list;
-        if (where)
+        if (false)
             result = result.filter(where)
         if (orderBy)

[Timeout] MethodExpression
src/dbJSON.js:94:22
     select(projection, where, orderBy) {
         let result = this.list;
         if (where)
-            result = result.filter(where)
+            result = result
         if (orderBy)
             result = this.orderByProperties(result, orderBy)

[Timeout] ConditionalExpression
src/dbJSON.js:95:13
         let result = this.list;
         if (where)
             result = result.filter(where)
-        if (orderBy)
+        if (false)
             result = this.orderByProperties(result, orderBy)
         if (projection && projection !== '*')

[Timeout] ConditionalExpression
src/dbJSON.js:95:13
         let result = this.list;
         if (where)
             result = result.filter(where)
-        if (orderBy)
+        if (true)
             result = this.orderByProperties(result, orderBy)
         if (projection && projection !== '*')

[Timeout] LogicalOperator
src/dbJSON.js:97:13
             result = result.filter(where)
         if (orderBy)
             result = this.orderByProperties(result, orderBy)
-        if (projection && projection !== '*')
+        if (projection || projection !== '*')
             result = result.map(this.__proyectar(projection))
         return result

[Timeout] ConditionalExpression
src/dbJSON.js:97:27
             result = result.filter(where)
         if (orderBy)
             result = this.orderByProperties(result, orderBy)
-        if (projection && projection !== '*')
+        if (projection && true)
             result = result.map(this.__proyectar(projection))
         return result

[Timeout] BlockStatement
src/dbJSON.js:101:35
             result = result.map(this.__proyectar(projection))
         return result
     }
-    add(element, persist = false) {
-        if (element[this.__pk] == undefined) {
-            element[this.__pk] = 0
-        }
-        if (this.getById(element[this.__pk]) != undefined)
-            throw new DbJSONError('Duplicate key', 400)
-        if (element[this.__pk] == 0) {
-            if (this.list.length == 0)
-                element[this.__pk] = 1;
-            else {
-                let newId = +this.sortByProperty(this.__pk, true)[0][this.__pk];
-                element[this.__pk] = newId + 1;
-            }
-        }
-        this.__data.push(element)
-        if (persist || this.__autoSave) this.save()
-        return element
-    }
+    add(element, persist = false) {}
     update(element, persist = false) {
         if (element[this.__pk] == undefined)

[Timeout] BooleanLiteral
src/dbJSON.js:101:28
             result = result.map(this.__proyectar(projection))
         return result
     }
-    add(element, persist = false) {
+    add(element, persist = true) {
         if (element[this.__pk] == undefined) {
             element[this.__pk] = 0

[Timeout] EqualityOperator
src/dbJSON.js:102:13
         return result
     }
     add(element, persist = false) {
-        if (element[this.__pk] == undefined) {
+        if (element[this.__pk] != undefined) {
             element[this.__pk] = 0
         }

[Timeout] BlockStatement
src/dbJSON.js:102:46
         return result
     }
     add(element, persist = false) {
-        if (element[this.__pk] == undefined) {
-            element[this.__pk] = 0
-        }
+        if (element[this.__pk] == undefined) {}
         if (this.getById(element[this.__pk]) != undefined)
             throw new DbJSONError('Duplicate key', 400)

[Timeout] ConditionalExpression
src/dbJSON.js:105:13
         if (element[this.__pk] == undefined) {
             element[this.__pk] = 0
         }
-        if (this.getById(element[this.__pk]) != undefined)
+        if (false)
             throw new DbJSONError('Duplicate key', 400)
         if (element[this.__pk] == 0) {

[Timeout] EqualityOperator
src/dbJSON.js:105:13
         if (element[this.__pk] == undefined) {
             element[this.__pk] = 0
         }
-        if (this.getById(element[this.__pk]) != undefined)
+        if (this.getById(element[this.__pk]) == undefined)
             throw new DbJSONError('Duplicate key', 400)
         if (element[this.__pk] == 0) {

[Timeout] ConditionalExpression
src/dbJSON.js:107:13
         }
         if (this.getById(element[this.__pk]) != undefined)
             throw new DbJSONError('Duplicate key', 400)
-        if (element[this.__pk] == 0) {
+        if (false) {
             if (this.list.length == 0)
                 element[this.__pk] = 1;

[Timeout] BlockStatement
src/dbJSON.js:107:38
         }
         if (this.getById(element[this.__pk]) != undefined)
             throw new DbJSONError('Duplicate key', 400)
-        if (element[this.__pk] == 0) {
-            if (this.list.length == 0)
-                element[this.__pk] = 1;
-            else {
-                let newId = +this.sortByProperty(this.__pk, true)[0][this.__pk];
-                element[this.__pk] = newId + 1;
-            }
-        }
+        if (element[this.__pk] == 0) {}
         this.__data.push(element)
         if (persist || this.__autoSave) this.save()

[Timeout] EqualityOperator
src/dbJSON.js:108:17
         if (this.getById(element[this.__pk]) != undefined)
             throw new DbJSONError('Duplicate key', 400)
         if (element[this.__pk] == 0) {
-            if (this.list.length == 0)
+            if (this.list.length != 0)
                 element[this.__pk] = 1;
             else {

[Timeout] ConditionalExpression
src/dbJSON.js:108:17
         if (this.getById(element[this.__pk]) != undefined)
             throw new DbJSONError('Duplicate key', 400)
         if (element[this.__pk] == 0) {
-            if (this.list.length == 0)
+            if (false)
                 element[this.__pk] = 1;
             else {

[Timeout] BlockStatement
src/dbJSON.js:110:18
         if (element[this.__pk] == 0) {
             if (this.list.length == 0)
                 element[this.__pk] = 1;
-            else {
-                let newId = +this.sortByProperty(this.__pk, true)[0][this.__pk];
-                element[this.__pk] = newId + 1;
-            }
+            else {}
         }
         this.__data.push(element)

[Timeout] BooleanLiteral
src/dbJSON.js:111:61
             if (this.list.length == 0)
                 element[this.__pk] = 1;
             else {
-                let newId = +this.sortByProperty(this.__pk, true)[0][this.__pk];
+                let newId = +this.sortByProperty(this.__pk, false)[0][this.__pk];
                 element[this.__pk] = newId + 1;
             }

[Timeout] UnaryOperator
src/dbJSON.js:111:29
             if (this.list.length == 0)
                 element[this.__pk] = 1;
             else {
-                let newId = +this.sortByProperty(this.__pk, true)[0][this.__pk];
+                let newId = -this.sortByProperty(this.__pk, true)[0][this.__pk];
                 element[this.__pk] = newId + 1;
             }
