[Killed] ArrowFunction
src/openapi-generator.js:10:47
 
 const ajv = new Ajv()
 addFormats(ajv)
-ajv.addFormat("nif", { type: 'nif', validate: (v) => validator.isIdentityCard(v, 'ES') })
+ajv.addFormat("nif", { type: 'nif', validate: () => undefined })
 
 const serviciosConfigSchema = {
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] StringLiteral
src/openapi-generator.js:10:30
 
 const ajv = new Ajv()
 addFormats(ajv)
-ajv.addFormat("nif", { type: 'nif', validate: (v) => validator.isIdentityCard(v, 'ES') })
+ajv.addFormat("nif", { type: "", validate: (v) => validator.isIdentityCard(v, 'ES') })
 
 const serviciosConfigSchema = {

[Survived] BooleanLiteral
src/openapi-generator.js:14:20
 
 const serviciosConfigSchema = {
     "type": "array",
-    "uniqueItems": true,
+    "uniqueItems": false,
     "items": {
         "type": "object",

[Survived] StringLiteral
src/openapi-generator.js:17:49
     "uniqueItems": true,
     "items": {
         "type": "object",
-        "required": ["endpoint", "model", "pk", "file"],
+        "required": ["endpoint", "model", "pk", ""],
         "additionalProperties": false,
         "properties": {

[Timeout] BooleanLiteral
src/openapi-generator.js:18:33
     "items": {
         "type": "object",
         "required": ["endpoint", "model", "pk", "file"],
-        "additionalProperties": false,
+        "additionalProperties": true,
         "properties": {
             "endpoint": {

[Survived] ObjectLiteral
src/openapi-generator.js:20:25
         "required": ["endpoint", "model", "pk", "file"],
         "additionalProperties": false,
         "properties": {
-            "endpoint": {
-                "type": "string",
-                "pattern": "^[a-z]([a-z0-9]|\\/)*"
-            },
+            "endpoint": {},
             "summary": {
                 "type": "string",

[Survived] StringLiteral
src/openapi-generator.js:22:28
         "properties": {
             "endpoint": {
                 "type": "string",
-                "pattern": "^[a-z]([a-z0-9]|\\/)*"
+                "pattern": ""
             },
             "summary": {

[Killed] ObjectLiteral
src/openapi-generator.js:24:24
                 "type": "string",
                 "pattern": "^[a-z]([a-z0-9]|\\/)*"
             },
-            "summary": {
-                "type": "string",
-            },
+            "summary": {},
             "description": {
                 "type": "string",
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] ObjectLiteral
src/openapi-generator.js:42:21
                 "type": "string",
                 "pattern": "^.*$"
             },
-            "file": {
-                "type": "string",
-                "pattern": "^.*$"
-            },
+            "file": {},
             "operations": {
                 "type": "array",

[Survived] ObjectLiteral
src/openapi-generator.js:54:25
                     "enum": ["GET", "POST", "PUT", "PATCH", "DELETE", "OPTIONS"],
                 }
             },
-            "security": {
-                "anyOf": [
-                    { "type": "string" },
-                    { "type": "boolean" }
-                  ]
-            },
+            "security": {},
             "readonly": {
                 "type": "boolean",

[Killed] ObjectLiteral
src/openapi-generator.js:56:21
             },
             "security": {
                 "anyOf": [
-                    { "type": "string" },
+                    {},
                     { "type": "boolean" }
                   ]
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] ObjectLiteral
src/openapi-generator.js:66:23
             "tag": {
                 "type": "string",
             },
-            "schema": {
-                "type": "object",
-            },
+            "schema": {},
             "db": { // uso interno
                 "type": "object",

[Survived] ObjectLiteral
src/openapi-generator.js:69:19
             "schema": {
                 "type": "object",
             },
-            "db": { // uso interno
-                "type": "object",
-            }
+            "db": {}
         }
     }

[Killed] MethodExpression
src/openapi-generator.js:78:27
 
 const validate = ajv.compile(serviciosConfigSchema)
 
-const Capitalize = cad => cad.charAt(0).toUpperCase() + cad.substring(1).toLowerCase()
+const Capitalize = cad => cad.charAt(0).toLowerCase() + cad.substring(1).toLowerCase()
 
 const swaggerDocument = {
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 280
+ Received  + 280

@@ -120,23 +120,149 @@

[Killed] MethodExpression
src/openapi-generator.js:78:57
 
 const validate = ajv.compile(serviciosConfigSchema)
 
-const Capitalize = cad => cad.charAt(0).toUpperCase() + cad.substring(1).toLowerCase()
+const Capitalize = cad => cad.charAt(0).toUpperCase() + cad.substring(1).toUpperCase()
 
 const swaggerDocument = {
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ObjectLiteral
src/openapi-generator.js:86:20
         "title": config.openapi.TITLE,
         "version": "2.0.0",
         "description": config.openapi.DESCRIPTION,
-        "contact": {
-            "name": "Javier Martín",
-            "url": "https://github.com/jmagit",
-            "email": "support@example.com"
-        },
+        "contact": {},
         "license": {
             "name": "Apache 2.0",
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 5
+ Received  + 1

@@ -1308,15 +1308,11 @@

[Killed] StringLiteral
src/openapi-generator.js:87:21
         "version": "2.0.0",
         "description": config.openapi.DESCRIPTION,
         "contact": {
-            "name": "Javier Martín",
+            "name": "",
             "url": "https://github.com/jmagit",
             "email": "support@example.com"
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 1
+ Received  + 1

@@ -1310,11 +1310,11 @@

[Killed] StringLiteral
src/openapi-generator.js:98:20
     },
     "servers": [
         {
-            "url": "{protocol}://localhost:{port}/",
+            "url": "",
             "description": "Servidor local para las pruebas",
             "variables": {
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 1
+ Received  + 1

@@ -4091,11 +4091,11 @@

[Killed] StringLiteral
src/openapi-generator.js:103:25
             "variables": {
                 "protocol": {
                     "enum": [
-                        "http",
+                        "",
                         "https"
                     ],
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 1
+ Received  + 1

@@ -4103,11 +4103,11 @@

[Killed] StringLiteral
src/openapi-generator.js:106:32
                         "http",
                         "https"
                     ],
-                    "default": "http"
+                    "default": ""
                 },
                 "port": {
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 1
+ Received  + 1

@@ -4101,11 +4101,11 @@

[Killed] StringLiteral
src/openapi-generator.js:119:24
         }
     ],
     "externalDocs": {
-        "description": "Repositorio del proyecto",
+        "description": "",
         "url": config.openapi.REPOSITORIO
     },
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 1
+ Received  + 1

@@ -1304,11 +1304,11 @@

[Timeout] ArrayDeclaration
src/openapi-generator.js:130:29
                 "type": "object",
                 "title": "Problem Details",
                 "description": "Problem Details for HTTP APIs ([RFC 7807](https://datatracker.ietf.org/doc/html/rfc7807))",
-                "required": [
-                    "type",
-                    "status",
-                    "title"
-                ],
+                "required": [],
                 "properties": {
                     "type": {

[Timeout] StringLiteral
src/openapi-generator.js:133:21
                 "required": [
                     "type",
                     "status",
-                    "title"
+                    ""
                 ],
                 "properties": {

[Killed] ObjectLiteral
src/openapi-generator.js:136:29
                     "title"
                 ],
                 "properties": {
-                    "type": {
-                        "type": "string",
-                        "description": "URI que identifica el tipo de problema y proporciona documentación legible por humanos para el tipo de problema.",
-                    },
+                    "type": {},
                     "title": {
                         "type": "string",
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 4
+ Received  + 1

@@ -503,14 +503,11 @@

[Killed] ObjectLiteral
src/openapi-generator.js:140:30
                         "type": "string",
                         "description": "URI que identifica el tipo de problema y proporciona documentación legible por humanos para el tipo de problema.",
                     },
-                    "title": {
-                        "type": "string",
-                        "description": "Breve resumen legible por humanos del problema escribe.",
-                    },
+                    "title": {},
                     "status": {
                         "type": "integer",
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 4
+ Received  + 1

@@ -499,14 +499,11 @@

[Killed] StringLiteral
src/openapi-generator.js:142:40
                     },
                     "title": {
                         "type": "string",
-                        "description": "Breve resumen legible por humanos del problema escribe.",
+                        "description": "",
                     },
                     "status": {
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 1
+ Received  + 1

@@ -500,11 +500,11 @@

[Timeout] StringLiteral
src/openapi-generator.js:145:33
                         "description": "Breve resumen legible por humanos del problema escribe.",
                     },
                     "status": {
-                        "type": "integer",
+                        "type": "",
                         "description": "Código de estado HTTP.",
                     },

[Killed] ObjectLiteral
src/openapi-generator.js:148:31
                         "type": "integer",
                         "description": "Código de estado HTTP.",
                     },
-                    "detail": {
-                        "type": "string",
-                        "description": "Explicación legible por humanos específica de la ocurrencia concreta del problema.",
-                    },
+                    "detail": {},
                     "instance": {
                         "type": "string",
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] StringLiteral
src/openapi-generator.js:149:33
                         "description": "Código de estado HTTP.",
                     },
                     "detail": {
-                        "type": "string",
+                        "type": "",
                         "description": "Explicación legible por humanos específica de la ocurrencia concreta del problema.",
                     },

[Timeout] ObjectLiteral
src/openapi-generator.js:152:33
                         "type": "string",
                         "description": "Explicación legible por humanos específica de la ocurrencia concreta del problema.",
                     },
-                    "instance": {
-                        "type": "string",
-                        "description": "URI de referencia que identifica el origen de la ocurrencia del problema.",
-                    },
+                    "instance": {},
                     "errors": {
                         "type": "array",

[Killed] ObjectLiteral
src/openapi-generator.js:159:34
                     "errors": {
                         "type": "array",
                         "description": "Lista de errores de validación",
-                        "items": {
-                            "type": "object",
-                            "minProperties": 1,
-                            "additionalProperties": true
-                        }
+                        "items": {}
                     },
                     "source": {
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 5
+ Received  + 1

@@ -480,15 +480,11 @@

[Timeout] StringLiteral
src/openapi-generator.js:160:37
                         "type": "array",
                         "description": "Lista de errores de validación",
                         "items": {
-                            "type": "object",
+                            "type": "",
                             "minProperties": 1,
                             "additionalProperties": true

[Killed] BooleanLiteral
src/openapi-generator.js:162:53
                         "items": {
                             "type": "object",
                             "minProperties": 1,
-                            "additionalProperties": true
+                            "additionalProperties": false
                         }
                     },
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] StringLiteral
src/openapi-generator.js:167:40
                     },
                     "source": {
                         "type": "string",
-                        "description": "En modo depuración, información complementaria sobre el origen del error.",
+                        "description": "",
                     }
                 }
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] StringLiteral
src/openapi-generator.js:175:32
         "requestBodies": {},
         "responses": {
             "Created": {
-                "description": "Created",
+                "description": "",
                 "headers": {
                     "location": {

[Killed] ObjectLiteral
src/openapi-generator.js:176:28
         "responses": {
             "Created": {
                 "description": "Created",
-                "headers": {
-                    "location": {
-                        "description": "URL al elemento recién creado",
-                        "schema": { "type": "string", "format": "uri" }
-                    }
-                }
+                "headers": {}
             },
             "NoContent": {
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] StringLiteral
src/openapi-generator.js:179:65
                 "headers": {
                     "location": {
                         "description": "URL al elemento recién creado",
-                        "schema": { "type": "string", "format": "uri" }
+                        "schema": { "type": "string", "format": "" }
                     }
                 }

[Timeout] StringLiteral
src/openapi-generator.js:179:45
                 "headers": {
                     "location": {
                         "description": "URL al elemento recién creado",
-                        "schema": { "type": "string", "format": "uri" }
+                        "schema": { "type": "", "format": "uri" }
                     }
                 }

[Timeout] ObjectLiteral
src/openapi-generator.js:183:26
                     }
                 }
             },
-            "NoContent": {
-                "description": "No content",
-            },
+            "NoContent": {},
             "BadRequest": {
                 "description": "Invalid data",

[Timeout] StringLiteral
src/openapi-generator.js:184:32
                 }
             },
             "NoContent": {
-                "description": "No content",
+                "description": "",
             },
             "BadRequest": {

[Timeout] ObjectLiteral
src/openapi-generator.js:186:27
             "NoContent": {
                 "description": "No content",
             },
-            "BadRequest": {
-                "description": "Invalid data",
-                "content": {
-                    "application/json": {
-                        "schema": {
-                            "$ref": "#/components/schemas/ErrorMessage"
-                        }
-                    }
-                }
-            },
+            "BadRequest": {},
             "Unauthorized": {
                 "description": "Unauthorized",

[Timeout] StringLiteral
src/openapi-generator.js:191:37
                 "content": {
                     "application/json": {
                         "schema": {
-                            "$ref": "#/components/schemas/ErrorMessage"
+                            "$ref": ""
                         }
                     }

[Timeout] ObjectLiteral
src/openapi-generator.js:208:28
             },
             "Forbidden": {
                 "description": "Forbidden",
-                "content": {
-                    "application/json": {
-                        "schema": {
-                            "$ref": "#/components/schemas/ErrorMessage"
-                        }
-                    }
-                }
+                "content": {}
             },
             "NotFound": {

[Killed] StringLiteral
src/openapi-generator.js:217:32
                 }
             },
             "NotFound": {
-                "description": "Not found",
+                "description": "",
                 "content": {
                     "application/json": {
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 1
+ Received  + 1

@@ -106,11 +106,11 @@

[Killed] ObjectLiteral
src/openapi-generator.js:218:28
             },
             "NotFound": {
                 "description": "Not found",
-                "content": {
-                    "application/json": {
-                        "schema": {
-                            "$ref": "#/components/schemas/ErrorMessage"
-                        }
-                    }
-                }
+                "content": {}
             },
         },
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] ObjectLiteral
src/openapi-generator.js:219:41
             "NotFound": {
                 "description": "Not found",
                 "content": {
-                    "application/json": {
-                        "schema": {
-                            "$ref": "#/components/schemas/ErrorMessage"
-                        }
-                    }
+                    "application/json": {}
                 }
             },

[Killed] StringLiteral
src/openapi-generator.js:230:25
         "parameters": {
             "pagina": {
                 "in": "query",
-                "name": "_page",
+                "name": "",
                 "description": "Número de página empezando en 0 (primera página).",
                 "required": false,
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 1
+ Received  + 1

@@ -32,11 +32,11 @@

[Killed] BooleanLiteral
src/openapi-generator.js:232:29
                 "in": "query",
                 "name": "_page",
                 "description": "Número de página empezando en 0 (primera página).",
-                "required": false,
+                "required": true,
                 "schema": {
                     "oneOf": [
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] ArrayDeclaration
src/openapi-generator.js:234:30
                 "description": "Número de página empezando en 0 (primera página).",
                 "required": false,
                 "schema": {
-                    "oneOf": [
-                        { "type": "integer", "minimum": 0 },
-                        { "type": "string", "enum": ["count", "COUNT"] },
-                    ]
+                    "oneOf": []
                 }
             },

[Timeout] ObjectLiteral
src/openapi-generator.js:235:25
                 "required": false,
                 "schema": {
                     "oneOf": [
-                        { "type": "integer", "minimum": 0 },
+                        {},
                         { "type": "string", "enum": ["count", "COUNT"] },
                     ]

[Killed] ObjectLiteral
src/openapi-generator.js:236:25
                 "schema": {
                     "oneOf": [
                         { "type": "integer", "minimum": 0 },
-                        { "type": "string", "enum": ["count", "COUNT"] },
+                        {},
                     ]
                 }
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 7
+ Received  + 1

@@ -40,17 +40,11 @@

[Timeout] StringLiteral
src/openapi-generator.js:236:63
                 "schema": {
                     "oneOf": [
                         { "type": "integer", "minimum": 0 },
-                        { "type": "string", "enum": ["count", "COUNT"] },
+                        { "type": "string", "enum": ["count", ""] },
                     ]
                 }

[Timeout] StringLiteral
src/openapi-generator.js:242:25
             },
             "filas": {
                 "in": "query",
-                "name": "_rows",
+                "name": "",
                 "description": "Número de filas por página, por defecto 20 si se omite pero aparece el parámetro *_page*.",
                 "required": false,

[Timeout] BooleanLiteral
src/openapi-generator.js:244:29
                 "in": "query",
                 "name": "_rows",
                 "description": "Número de filas por página, por defecto 20 si se omite pero aparece el parámetro *_page*.",
-                "required": false,
+                "required": true,
                 "schema": {
                     "type": "integer",

[Killed] BooleanLiteral
src/openapi-generator.js:254:29
                 "in": "query",
                 "name": "_sort",
-                "required": false,
+                "required": true,
                 "allowReserved": true,
                 "schema": {
killedBy: API Rest: Ficheros reales Autenticación bearer CONTACTOS
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Timeout] BooleanLiteral
src/openapi-generator.js:255:34
                 "name": "_sort",
                 "required": false,
-                "allowReserved": true,
+                "allowReserved": false,
                 "schema": {
                     "type": "string"

[Killed] ObjectLiteral
src/openapi-generator.js:256:27
                 "required": false,
                 "allowReserved": true,
-                "schema": {
-                    "type": "string"
-                }
+                "schema": {}
             },
             "buscar": {
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 3
+ Received  + 1

@@ -25,13 +25,11 @@

[Timeout] StringLiteral
src/openapi-generator.js:257:29
                 "required": false,
                 "allowReserved": true,
                 "schema": {
-                    "type": "string"
+                    "type": ""
                 }
             },

[Timeout] ObjectLiteral
src/openapi-generator.js:260:23
                     "type": "string"
                 }
             },
-            "buscar": {
-                "in": "query",
-                "name": "_search",
-                "description": "Selecciona todos aquellos que en alguna de sus propiedades contenga el valor proporcionado.",
-                "required": false,
-                "allowReserved": true,
-                "schema": {
-                    "type": "string"
-                }
-            },
+            "buscar": {},
             "proyeccion": {
                 "in": "query",

[Timeout] BooleanLiteral
src/openapi-generator.js:264:29
                 "in": "query",
                 "name": "_search",
                 "description": "Selecciona todos aquellos que en alguna de sus propiedades contenga el valor proporcionado.",
-                "required": false,
+                "required": true,
                 "allowReserved": true,
                 "schema": {

[Timeout] BooleanLiteral
src/openapi-generator.js:274:29
                 "in": "query",
                 "name": "_projection",
                 "description": "Devuelve solo aquellas propiedades de la lista suministrada, los nombres de las propiedades deben ir separadas por comas.",
-                "required": false,
+                "required": true,
                 "allowReserved": true,
                 "schema": {

[Timeout] StringLiteral
src/openapi-generator.js:283:25
         },
         "securitySchemes": {
             "bearerAuth": {
-                "type": "http",
+                "type": "",
                 "scheme": "bearer",
                 "bearerFormat": "JWT"

[Timeout] ObjectLiteral
src/openapi-generator.js:287:27
                 "scheme": "bearer",
                 "bearerFormat": "JWT"
             },
-            "cookieAuth": {
-                "type": "apiKey",
-                "in": "cookie",
-                "name": "Authorization"
-            }
+            "cookieAuth": {}
         },
     },

[Timeout] StringLiteral
src/openapi-generator.js:290:25
             "cookieAuth": {
                 "type": "apiKey",
                 "in": "cookie",
-                "name": "Authorization"
+                "name": ""
             }
         },

[Killed] ArrayDeclaration
src/openapi-generator.js:300:21
 const generaGetAll = (servicio) => {
     let result = {
         "get": {
-            "tags": [servicio.tag],
+            "tags": [],
             "summary": `Listar ${servicio.models.toLowerCase()}`,
             "parameters": [
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 27
+ Received  +  9

@@ -1413,13 +1413,11 @@

[Killed] MethodExpression
src/openapi-generator.js:301:34
     let result = {
         "get": {
             "tags": [servicio.tag],
-            "summary": `Listar ${servicio.models.toLowerCase()}`,
+            "summary": `Listar ${servicio.models.toUpperCase()}`,
             "parameters": [
                 {
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 9
+ Received  + 9

@@ -1412,11 +1412,11 @@

[Timeout] ObjectLiteral
src/openapi-generator.js:303:17
             "tags": [servicio.tag],
             "summary": `Listar ${servicio.models.toLowerCase()}`,
             "parameters": [
-                {
-                    "$ref": `#/components/parameters/pagina`
-                },
+                {},
                 {
                     "$ref": `#/components/parameters/filas`

[Timeout] StringLiteral
src/openapi-generator.js:304:29
             "summary": `Listar ${servicio.models.toLowerCase()}`,
             "parameters": [
                 {
-                    "$ref": `#/components/parameters/pagina`
+                    "$ref": ``
                 },
                 {

[Timeout] ObjectLiteral
src/openapi-generator.js:309:17
                 {
                     "$ref": `#/components/parameters/filas`
                 },
-                {
-                    "$ref": `#/components/parameters/ordenar`
-                },
+                {},
                 {
                     "$ref": `#/components/parameters/buscar`
