[Timeout] ArithmeticOperator
src/dbJSON.js:112:38
                 element[this.__pk] = 1;
             else {
                 let newId = +this.sortByProperty(this.__pk, true)[0][this.__pk];
-                element[this.__pk] = newId + 1;
+                element[this.__pk] = newId - 1;
             }
         }

[Timeout] ConditionalExpression
src/dbJSON.js:116:13
             }
         }
         this.__data.push(element)
-        if (persist || this.__autoSave) this.save()
+        if (true) this.save()
         return element
     }

[Timeout] LogicalOperator
src/dbJSON.js:116:13
             }
         }
         this.__data.push(element)
-        if (persist || this.__autoSave) this.save()
+        if (persist && this.__autoSave) this.save()
         return element
     }

[Timeout] BlockStatement
src/dbJSON.js:119:38
         if (persist || this.__autoSave) this.save()
         return element
     }
-    update(element, persist = false) {
-        if (element[this.__pk] == undefined)
-            throw new DbJSONError('Missing key', 400)
-        let index = this.indexById(element[this.__pk])
-        if (index < 0)
-            throw new DbJSONError('Not Found', 404)
-        this.__data[index] = element
-        if (persist || this.__autoSave) this.save()
-        return element
-    }
+    update(element, persist = false) {}
     change(key, element, persist = false) {
         let index = this.indexById(key)

[Timeout] BooleanLiteral
src/dbJSON.js:119:31
         if (persist || this.__autoSave) this.save()
         return element
     }
-    update(element, persist = false) {
+    update(element, persist = true) {
         if (element[this.__pk] == undefined)
             throw new DbJSONError('Missing key', 400)

[Timeout] EqualityOperator
src/dbJSON.js:120:13
         return element
     }
     update(element, persist = false) {
-        if (element[this.__pk] == undefined)
+        if (element[this.__pk] != undefined)
             throw new DbJSONError('Missing key', 400)
         let index = this.indexById(element[this.__pk])

[Timeout] ConditionalExpression
src/dbJSON.js:120:13
         return element
     }
     update(element, persist = false) {
-        if (element[this.__pk] == undefined)
+        if (false)
             throw new DbJSONError('Missing key', 400)
         let index = this.indexById(element[this.__pk])

[Timeout] EqualityOperator
src/dbJSON.js:123:13
         if (element[this.__pk] == undefined)
             throw new DbJSONError('Missing key', 400)
         let index = this.indexById(element[this.__pk])
-        if (index < 0)
+        if (index <= 0)
             throw new DbJSONError('Not Found', 404)
         this.__data[index] = element

[Timeout] ConditionalExpression
src/dbJSON.js:123:13
         if (element[this.__pk] == undefined)
             throw new DbJSONError('Missing key', 400)
         let index = this.indexById(element[this.__pk])
-        if (index < 0)
+        if (true)
             throw new DbJSONError('Not Found', 404)
         this.__data[index] = element

[Timeout] ConditionalExpression
src/dbJSON.js:126:13
         if (index < 0)
             throw new DbJSONError('Not Found', 404)
         this.__data[index] = element
-        if (persist || this.__autoSave) this.save()
+        if (false) this.save()
         return element
     }

[Timeout] LogicalOperator
src/dbJSON.js:126:13
         if (index < 0)
             throw new DbJSONError('Not Found', 404)
         this.__data[index] = element
-        if (persist || this.__autoSave) this.save()
+        if (persist && this.__autoSave) this.save()
         return element
     }

[Timeout] BooleanLiteral
src/dbJSON.js:129:36
         if (persist || this.__autoSave) this.save()
         return element
     }
-    change(key, element, persist = false) {
+    change(key, element, persist = true) {
         let index = this.indexById(key)
         if (index < 0)

[Timeout] BlockStatement
src/dbJSON.js:129:43
         if (persist || this.__autoSave) this.save()
         return element
     }
-    change(key, element, persist = false) {
-        let index = this.indexById(key)
-        if (index < 0)
-            throw new DbJSONError('Not Found', 404)
-        this.__data[index] = Object.assign({}, this.__data[index], element)
-        if (persist || this.__autoSave) this.save()
-        return this.__data[index]
-    }
+    change(key, element, persist = false) {}
     delete(key, persist = false) {
         let index = this.indexById(key)

[Timeout] ConditionalExpression
src/dbJSON.js:131:13
     }
     change(key, element, persist = false) {
         let index = this.indexById(key)
-        if (index < 0)
+        if (false)
             throw new DbJSONError('Not Found', 404)
         this.__data[index] = Object.assign({}, this.__data[index], element)

[Timeout] EqualityOperator
src/dbJSON.js:131:13
     }
     change(key, element, persist = false) {
         let index = this.indexById(key)
-        if (index < 0)
+        if (index <= 0)
             throw new DbJSONError('Not Found', 404)
         this.__data[index] = Object.assign({}, this.__data[index], element)

[Timeout] LogicalOperator
src/dbJSON.js:134:13
         if (index < 0)
             throw new DbJSONError('Not Found', 404)
         this.__data[index] = Object.assign({}, this.__data[index], element)
-        if (persist || this.__autoSave) this.save()
+        if (persist && this.__autoSave) this.save()
         return this.__data[index]
     }

[Timeout] ConditionalExpression
src/dbJSON.js:134:13
         if (index < 0)
             throw new DbJSONError('Not Found', 404)
         this.__data[index] = Object.assign({}, this.__data[index], element)
-        if (persist || this.__autoSave) this.save()
+        if (false) this.save()
         return this.__data[index]
     }

[Timeout] BooleanLiteral
src/dbJSON.js:137:27
         if (persist || this.__autoSave) this.save()
         return this.__data[index]
     }
-    delete(key, persist = false) {
+    delete(key, persist = true) {
         let index = this.indexById(key)
         if (index < 0)

[Timeout] BlockStatement
src/dbJSON.js:137:34
         if (persist || this.__autoSave) this.save()
         return this.__data[index]
     }
-    delete(key, persist = false) {
-        let index = this.indexById(key)
-        if (index < 0)
-            throw new DbJSONError('Not Found', 404)
-        this.__data.splice(index, 1)
-        if (persist || this.__autoSave) this.save()
-    }
+    delete(key, persist = false) {}
 }
 

[Timeout] EqualityOperator
src/dbJSON.js:139:13
     }
     delete(key, persist = false) {
         let index = this.indexById(key)
-        if (index < 0)
+        if (index >= 0)
             throw new DbJSONError('Not Found', 404)
         this.__data.splice(index, 1)

[Timeout] ConditionalExpression
src/dbJSON.js:139:13
     }
     delete(key, persist = false) {
         let index = this.indexById(key)
-        if (index < 0)
+        if (true)
             throw new DbJSONError('Not Found', 404)
         this.__data.splice(index, 1)

[Timeout] ConditionalExpression
src/dbJSON.js:142:13
         if (index < 0)
             throw new DbJSONError('Not Found', 404)
         this.__data.splice(index, 1)
-        if (persist || this.__autoSave) this.save()
+        if (false) this.save()
     }
 }

[Timeout] ConditionalExpression
src/dbJSON.js:142:13
         if (index < 0)
             throw new DbJSONError('Not Found', 404)
         this.__data.splice(index, 1)
-        if (persist || this.__autoSave) this.save()
+        if (true) this.save()
     }
 }
