[Timeout] ObjectLiteral
src/openapi-generator.js:319:26
                     "$ref": `#/components/parameters/proyeccion`
                 },
             ],
-            "responses": {
-                "200": {
-                    "description": "OK",
-                    "content": {
-                        "application/json": {
-                            "schema": {
-                                "oneOf": [
-                                    { "$ref": `#/components/schemas/${servicio.models}` },
-                                    { "$ref": `#/components/schemas/${servicio.models}Page` },
-                                ]
-                            }
-                        }
-                    }
-                },
-                "401": { "$ref": "#/components/responses/Unauthorized" },
-                "403": { "$ref": "#/components/responses/Forbidden" },
-            }
+            "responses": {}
         }
     }

[Killed] StringLiteral
src/openapi-generator.js:327:47
                             "schema": {
                                 "oneOf": [
                                     { "$ref": `#/components/schemas/${servicio.models}` },
-                                    { "$ref": `#/components/schemas/${servicio.models}Page` },
+                                    { "$ref": `` },
                                 ]
                             }
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] ObjectLiteral
src/openapi-generator.js:327:37
                             "schema": {
                                 "oneOf": [
                                     { "$ref": `#/components/schemas/${servicio.models}` },
-                                    { "$ref": `#/components/schemas/${servicio.models}Page` },
+                                    {},
                                 ]
                             }

[Timeout] ObjectLiteral
src/openapi-generator.js:333:24
                         }
                     }
                 },
-                "401": { "$ref": "#/components/responses/Unauthorized" },
+                "401": {},
                 "403": { "$ref": "#/components/responses/Forbidden" },
             }

[Timeout] ObjectLiteral
src/openapi-generator.js:334:24
                     }
                 },
                 "401": { "$ref": "#/components/responses/Unauthorized" },
-                "403": { "$ref": "#/components/responses/Forbidden" },
+                "403": {},
             }
         }

[Killed] ConditionalExpression
src/openapi-generator.js:338:9
             }
         }
     }
-    if (servicio.security)
+    if (false)
         result.get.security = [{ bearerAuth: [] }, { cookieAuth: [] }]
     return result
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] ConditionalExpression
src/openapi-generator.js:338:9
             }
         }
     }
-    if (servicio.security)
+    if (true)
         result.get.security = [{ bearerAuth: [] }, { cookieAuth: [] }]
     return result

[Killed] ObjectLiteral
src/openapi-generator.js:339:52
         }
     }
     if (servicio.security)
-        result.get.security = [{ bearerAuth: [] }, { cookieAuth: [] }]
+        result.get.security = [{ bearerAuth: [] }, {}]
     return result
 }
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 12
+ Received  +  4

@@ -1706,13 +1706,11 @@

[Timeout] ObjectLiteral
src/openapi-generator.js:344:17
 }
 const generaPost = (servicio) => {
     let result = {
-        "post": {
-            "tags": [servicio.tag],
-            "summary": `Crear ${servicio.model.toLowerCase()}`,
-            "requestBody": {
-                "content": {
-                    "application/json": {
-                        "schema": {
-                            "$ref": `#/components/schemas/${servicio.model}Model`
-                        }
-                    }
-                },
-                "required": true,
-            },
-            "responses": {
-                "201": { "$ref": "#/components/responses/Created" },
-                "400": { "$ref": "#/components/responses/BadRequest" },
-                "401": { "$ref": "#/components/responses/Unauthorized" },
-                "403": { "$ref": "#/components/responses/Forbidden" },
-            }
-        }
+        "post": {}
     }
     if (servicio.security || servicio.readonly)

[Killed] MethodExpression
src/openapi-generator.js:346:33
     let result = {
         "post": {
             "tags": [servicio.tag],
-            "summary": `Crear ${servicio.model.toLowerCase()}`,
+            "summary": `Crear ${servicio.model.toUpperCase()}`,
             "requestBody": {
                 "content": {
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 8
+ Received  + 8

@@ -1467,11 +1467,11 @@

[Killed] ObjectLiteral
src/openapi-generator.js:349:41
             "summary": `Crear ${servicio.model.toLowerCase()}`,
             "requestBody": {
                 "content": {
-                    "application/json": {
-                        "schema": {
-                            "$ref": `#/components/schemas/${servicio.model}Model`
-                        }
-                    }
+                    "application/json": {}
                 },
                 "required": true,
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ObjectLiteral
src/openapi-generator.js:350:35
             "requestBody": {
                 "content": {
                     "application/json": {
-                        "schema": {
-                            "$ref": `#/components/schemas/${servicio.model}Model`
-                        }
+                        "schema": {}
                     }
                 },
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 24
+ Received  +  8

@@ -1438,13 +1438,11 @@

[Timeout] StringLiteral
src/openapi-generator.js:351:37
                 "content": {
                     "application/json": {
                         "schema": {
-                            "$ref": `#/components/schemas/${servicio.model}Model`
+                            "$ref": ``
                         }
                     }

[Killed] BooleanLiteral
src/openapi-generator.js:355:29
                         }
                     }
                 },
-                "required": true,
+                "required": false,
             },
             "responses": {
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 8
+ Received  + 8

@@ -1443,11 +1443,11 @@

[Killed] StringLiteral
src/openapi-generator.js:359:34
             },
             "responses": {
                 "201": { "$ref": "#/components/responses/Created" },
-                "400": { "$ref": "#/components/responses/BadRequest" },
+                "400": { "$ref": "" },
                 "401": { "$ref": "#/components/responses/Unauthorized" },
                 "403": { "$ref": "#/components/responses/Forbidden" },
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 8
+ Received  + 8

@@ -1450,11 +1450,11 @@

[Killed] StringLiteral
src/openapi-generator.js:360:34
             "responses": {
                 "201": { "$ref": "#/components/responses/Created" },
                 "400": { "$ref": "#/components/responses/BadRequest" },
-                "401": { "$ref": "#/components/responses/Unauthorized" },
+                "401": { "$ref": "" },
                 "403": { "$ref": "#/components/responses/Forbidden" },
             }
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 8
+ Received  + 8

@@ -1453,11 +1453,11 @@

[Timeout] ObjectLiteral
src/openapi-generator.js:360:24
             "responses": {
                 "201": { "$ref": "#/components/responses/Created" },
                 "400": { "$ref": "#/components/responses/BadRequest" },
-                "401": { "$ref": "#/components/responses/Unauthorized" },
+                "401": {},
                 "403": { "$ref": "#/components/responses/Forbidden" },
             }

[Killed] ConditionalExpression
src/openapi-generator.js:365:9
             }
         }
     }
-    if (servicio.security || servicio.readonly)
+    if (false)
         result.post.security = [{ bearerAuth: [] }, { cookieAuth: [] }]
     return result
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ConditionalExpression
src/openapi-generator.js:365:9
             }
         }
     }
-    if (servicio.security || servicio.readonly)
+    if (true)
         result.post.security = [{ bearerAuth: [] }, { cookieAuth: [] }]
     return result
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ObjectLiteral
src/openapi-generator.js:366:53
         }
     }
     if (servicio.security || servicio.readonly)
-        result.post.security = [{ bearerAuth: [] }, { cookieAuth: [] }]
+        result.post.security = [{ bearerAuth: [] }, {}]
     return result
 }
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] MethodExpression
src/openapi-generator.js:373:37
     let result = {
         "get": {
             "tags": [servicio.tag],
-            "summary": `Recuperar ${servicio.model.toLowerCase()}`,
+            "summary": `Recuperar ${servicio.model.toUpperCase()}`,
             "parameters": [
                 {
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 9
+ Received  + 9

@@ -1535,11 +1535,11 @@

[Timeout] ObjectLiteral
src/openapi-generator.js:375:17
             "tags": [servicio.tag],
             "summary": `Recuperar ${servicio.model.toLowerCase()}`,
             "parameters": [
-                {
-                    "in": "query",
-                    "name": "_projection",
-                    "description": "Devuelve solo aquellas propiedades de la lista suministrada, los nombres de las propiedades deben ir separadas por comas.",
-                    "required": false,
-                    "schema": {
-                        "type": "string"
-                    }
-                }
+                {}
             ],
             "responses": {

[Timeout] StringLiteral
src/openapi-generator.js:377:29
             "parameters": [
                 {
                     "in": "query",
-                    "name": "_projection",
+                    "name": "",
                     "description": "Devuelve solo aquellas propiedades de la lista suministrada, los nombres de las propiedades deben ir separadas por comas.",
                     "required": false,

[Killed] ObjectLiteral
src/openapi-generator.js:388:32
             "responses": {
                 "200": {
                     "description": "OK",
-                    "content": {
-                        "application/json": {
-                            "schema": { "$ref": `#/components/schemas/${servicio.model}Projection` }
-                        }
-                    }
+                    "content": {}
                 },
                 "401": { "$ref": "#/components/responses/Unauthorized" },
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 63
+ Received  +  9

@@ -1516,17 +1516,11 @@

[Killed] ObjectLiteral
src/openapi-generator.js:389:45
                 "200": {
                     "description": "OK",
                     "content": {
-                        "application/json": {
-                            "schema": { "$ref": `#/components/schemas/${servicio.model}Projection` }
-                        }
+                        "application/json": {}
                     }
                 },
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] StringLiteral
src/openapi-generator.js:394:34
                         }
                     }
                 },
-                "401": { "$ref": "#/components/responses/Unauthorized" },
+                "401": { "$ref": "" },
                 "403": { "$ref": "#/components/responses/Forbidden" },
                 "404": { "$ref": "#/components/responses/NotFound" },

[Timeout] StringLiteral
src/openapi-generator.js:395:34
                     }
                 },
                 "401": { "$ref": "#/components/responses/Unauthorized" },
-                "403": { "$ref": "#/components/responses/Forbidden" },
+                "403": { "$ref": "" },
                 "404": { "$ref": "#/components/responses/NotFound" },
             }

[Killed] ArrayDeclaration
src/openapi-generator.js:401:66
         }
     }
     if (servicio.security)
-        result.get.security = [{ bearerAuth: [] }, { cookieAuth: [] }]
+        result.get.security = [{ bearerAuth: [] }, { cookieAuth: ["Stryker was here"] }]
     return result
 }
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] MethodExpression
src/openapi-generator.js:408:38
     let result = {
         "put": {
             "tags": [servicio.tag],
-            "summary": `Reemplazar ${servicio.model.toLowerCase()}`,
+            "summary": `Reemplazar ${servicio.model.toUpperCase()}`,
             "requestBody": {
                 "content": {
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] StringLiteral
src/openapi-generator.js:408:24
     let result = {
         "put": {
             "tags": [servicio.tag],
-            "summary": `Reemplazar ${servicio.model.toLowerCase()}`,
+            "summary": ``,
             "requestBody": {
                 "content": {
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] StringLiteral
src/openapi-generator.js:420:34
                 "required": true,
             },
             "responses": {
-                "204": { "$ref": "#/components/responses/NoContent" },
+                "204": { "$ref": "" },
                 "400": { "$ref": "#/components/responses/BadRequest" },
                 "401": { "$ref": "#/components/responses/Unauthorized" },
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 8
+ Received  + 8

@@ -1629,11 +1629,11 @@

[Timeout] ObjectLiteral
src/openapi-generator.js:421:24
             },
             "responses": {
                 "204": { "$ref": "#/components/responses/NoContent" },
-                "400": { "$ref": "#/components/responses/BadRequest" },
+                "400": {},
                 "401": { "$ref": "#/components/responses/Unauthorized" },
                 "403": { "$ref": "#/components/responses/Forbidden" },

[Timeout] ObjectLiteral
src/openapi-generator.js:424:24
                 "400": { "$ref": "#/components/responses/BadRequest" },
                 "401": { "$ref": "#/components/responses/Unauthorized" },
                 "403": { "$ref": "#/components/responses/Forbidden" },
-                "404": { "$ref": "#/components/responses/NotFound" },
+                "404": {},
             }
         }

[Timeout] ObjectLiteral
src/openapi-generator.js:429:52
         }
     }
     if (servicio.security || servicio.readonly)
-        result.put.security = [{ bearerAuth: [] }, { cookieAuth: [] }]
+        result.put.security = [{ bearerAuth: [] }, {}]
     return result
 }

[Timeout] MethodExpression
src/openapi-generator.js:436:51
     let result = {
         "patch": {
             "tags": [servicio.tag],
-            "summary": `Actualizar parcialmente ${servicio.model.toLowerCase()}`,
+            "summary": `Actualizar parcialmente ${servicio.model.toUpperCase()}`,
             "requestBody": {
                 "content": {

[Killed] StringLiteral
src/openapi-generator.js:440:45
             "requestBody": {
                 "content": {
                     "application/json": {
-                        "schema": { "$ref": `#/components/schemas/${servicio.model}Projection` }
+                        "schema": { "$ref": `` }
                     }
                 },
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 6
+ Received  + 6

@@ -1573,11 +1573,11 @@

[Timeout] ObjectLiteral
src/openapi-generator.js:446:24
                 "required": true,
             },
             "responses": {
-                "200": {
-                    "description": "OK",
-                    "content": {
-                        "application/json": {
-                            "schema": { "$ref": `#/components/schemas/${servicio.model}Projection` }
-                        }
-                    }
-                },
+                "200": {},
                 "400": { "$ref": "#/components/responses/BadRequest" },
                 "401": { "$ref": "#/components/responses/Unauthorized" },

[Timeout] StringLiteral
src/openapi-generator.js:447:36
             },
             "responses": {
                 "200": {
-                    "description": "OK",
+                    "description": "",
                     "content": {
                         "application/json": {

[Timeout] ObjectLiteral
src/openapi-generator.js:454:24
                         }
                     }
                 },
-                "400": { "$ref": "#/components/responses/BadRequest" },
+                "400": {},
                 "401": { "$ref": "#/components/responses/Unauthorized" },
                 "403": { "$ref": "#/components/responses/Forbidden" },

[Killed] LogicalOperator
src/openapi-generator.js:461:9
             }
         }
     }
-    if (servicio.security || servicio.readonly)
+    if (servicio.security && servicio.readonly)
         result.patch.security = [{ bearerAuth: [] }, { cookieAuth: [] }]
     return result
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ArrayDeclaration
src/openapi-generator.js:462:68
         }
     }
     if (servicio.security || servicio.readonly)
-        result.patch.security = [{ bearerAuth: [] }, { cookieAuth: [] }]
+        result.patch.security = [{ bearerAuth: [] }, { cookieAuth: ["Stryker was here"] }]
     return result
 }
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  -  4
+ Received  + 12

@@ -1608,11 +1608,13 @@

[Timeout] ObjectLiteral
src/openapi-generator.js:462:34
         }
     }
     if (servicio.security || servicio.readonly)
-        result.patch.security = [{ bearerAuth: [] }, { cookieAuth: [] }]
+        result.patch.security = [{}, { cookieAuth: [] }]
     return result
 }

[Killed] BlockStatement
src/openapi-generator.js:465:36
         result.patch.security = [{ bearerAuth: [] }, { cookieAuth: [] }]
     return result
 }
-const generaDelete = (servicio) => {
-    let result = {
-        "delete": {
-            "tags": [servicio.tag],
-            "summary": `Borrar ${servicio.model.toLowerCase()}`,
-            "responses": {
-                "204": { "$ref": "#/components/responses/NoContent" },
-                "401": { "$ref": "#/components/responses/Unauthorized" },
-                "403": { "$ref": "#/components/responses/Forbidden" },
-                "404": { "$ref": "#/components/responses/NotFound" },
-            }
-        }
-    }
-    if (servicio.security || servicio.readonly)
-        result.delete.security = [{ bearerAuth: [] }, { cookieAuth: [] }]
-    return result
-}
+const generaDelete = (servicio) => {}
 const generaOptions = (servicio) => {
     let result = {
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] MethodExpression
src/openapi-generator.js:469:34
     let result = {
         "delete": {
             "tags": [servicio.tag],
-            "summary": `Borrar ${servicio.model.toLowerCase()}`,
+            "summary": `Borrar ${servicio.model.toUpperCase()}`,
             "responses": {
                 "204": { "$ref": "#/components/responses/NoContent" },

[Timeout] StringLiteral
src/openapi-generator.js:472:34
             "summary": `Borrar ${servicio.model.toLowerCase()}`,
             "responses": {
                 "204": { "$ref": "#/components/responses/NoContent" },
-                "401": { "$ref": "#/components/responses/Unauthorized" },
+                "401": { "$ref": "" },
                 "403": { "$ref": "#/components/responses/Forbidden" },
                 "404": { "$ref": "#/components/responses/NotFound" },

[Killed] ArrayDeclaration
src/openapi-generator.js:479:69
         }
     }
     if (servicio.security || servicio.readonly)
-        result.delete.security = [{ bearerAuth: [] }, { cookieAuth: [] }]
+        result.delete.security = [{ bearerAuth: [] }, { cookieAuth: ["Stryker was here"] }]
     return result
 }
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ObjectLiteral
src/openapi-generator.js:479:55
         }
     }
     if (servicio.security || servicio.readonly)
-        result.delete.security = [{ bearerAuth: [] }, { cookieAuth: [] }]
+        result.delete.security = [{ bearerAuth: [] }, {}]
     return result
 }
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] BlockStatement
src/openapi-generator.js:482:37
         result.delete.security = [{ bearerAuth: [] }, { cookieAuth: [] }]
     return result
 }
-const generaOptions = (servicio) => {
-    let result = {
-        "options": {
-            "tags": [servicio.tag],
-            "summary": "Sondeo CORS",
-            "responses": {
-                "200": { description: "OK" },
-                "401": { "$ref": "#/components/responses/Unauthorized" },
-                "403": { "$ref": "#/components/responses/Forbidden" },
-            }
-        }
-    }
-    if (servicio.security)
-        result.options.security = [{ bearerAuth: [] }, { cookieAuth: [] }]
-    return result
-}
+const generaOptions = (servicio) => {}
 const preparaService = (servicio) => {
     servicio.endpoint = servicio.endpoint.toLowerCase()
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ArrayDeclaration
src/openapi-generator.js:485:21
 const generaOptions = (servicio) => {
     let result = {
         "options": {
-            "tags": [servicio.tag],
+            "tags": [],
             "summary": "Sondeo CORS",
             "responses": {
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 36
+ Received  + 12

@@ -1430,13 +1430,11 @@

[Timeout] StringLiteral
src/openapi-generator.js:488:39
             "tags": [servicio.tag],
             "summary": "Sondeo CORS",
             "responses": {
-                "200": { description: "OK" },
+                "200": { description: "" },
                 "401": { "$ref": "#/components/responses/Unauthorized" },
                 "403": { "$ref": "#/components/responses/Forbidden" },

[Killed] StringLiteral
src/openapi-generator.js:489:34
             "summary": "Sondeo CORS",
             "responses": {
                 "200": { description: "OK" },
-                "401": { "$ref": "#/components/responses/Unauthorized" },
+                "401": { "$ref": "" },
                 "403": { "$ref": "#/components/responses/Forbidden" },
             }
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 12
+ Received  + 12

@@ -1423,11 +1423,11 @@

[Timeout] ObjectLiteral
src/openapi-generator.js:489:24
             "summary": "Sondeo CORS",
             "responses": {
                 "200": { description: "OK" },
-                "401": { "$ref": "#/components/responses/Unauthorized" },
+                "401": {},
                 "403": { "$ref": "#/components/responses/Forbidden" },
             }

[Killed] ArrayDeclaration
src/openapi-generator.js:495:50
         }
     }
     if (servicio.security)
-        result.options.security = [{ bearerAuth: [] }, { cookieAuth: [] }]
+        result.options.security = [{ bearerAuth: ["Stryker was here"] }, { cookieAuth: [] }]
     return result
 }
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  -  6
+ Received  + 18

@@ -1729,11 +1729,13 @@

[Killed] MethodExpression
src/openapi-generator.js:499:25
     return result
 }
 const preparaService = (servicio) => {
-    servicio.endpoint = servicio.endpoint.toLowerCase()
+    servicio.endpoint = servicio.endpoint.toUpperCase()
     if (!servicio.tag)
         servicio.tag = servicio.endpoint.toLowerCase();
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 529
+ Received  + 529

@@ -1323,56 +1323,11 @@

[Timeout] ConditionalExpression
src/openapi-generator.js:500:9
 }
 const preparaService = (servicio) => {
     servicio.endpoint = servicio.endpoint.toLowerCase()
-    if (!servicio.tag)
+    if (false)
         servicio.tag = servicio.endpoint.toLowerCase();
     if (!servicio.models)

[Timeout] BooleanLiteral
src/openapi-generator.js:500:9
 }
 const preparaService = (servicio) => {
     servicio.endpoint = servicio.endpoint.toLowerCase()
-    if (!servicio.tag)
+    if (servicio.tag)
         servicio.tag = servicio.endpoint.toLowerCase();
     if (!servicio.models)

[Timeout] MethodExpression
src/openapi-generator.js:501:24
 const preparaService = (servicio) => {
     servicio.endpoint = servicio.endpoint.toLowerCase()
     if (!servicio.tag)
-        servicio.tag = servicio.endpoint.toLowerCase();
+        servicio.tag = servicio.endpoint.toUpperCase();
     if (!servicio.models)
         servicio.models = servicio.endpoint;

[Killed] ConditionalExpression
src/openapi-generator.js:502:9
     servicio.endpoint = servicio.endpoint.toLowerCase()
     if (!servicio.tag)
         servicio.tag = servicio.endpoint.toLowerCase();
-    if (!servicio.models)
+    if (true)
         servicio.models = servicio.endpoint;
     servicio.models = Capitalize(servicio.models)
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ConditionalExpression
src/openapi-generator.js:506:9
         servicio.models = servicio.endpoint;
     servicio.models = Capitalize(servicio.models)
     servicio.model = Capitalize(servicio.model)
-    if (!servicio.summary)
+    if (false)
         servicio.summary = `Mantenimiento de ${servicio.models.toLowerCase()}`;
     if (!servicio.operations || servicio.operations.length === 0)
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 7
+ Received  + 7

@@ -4116,35 +4116,35 @@

[Killed] BooleanLiteral
src/openapi-generator.js:506:9
         servicio.models = servicio.endpoint;
     servicio.models = Capitalize(servicio.models)
     servicio.model = Capitalize(servicio.model)
-    if (!servicio.summary)
+    if (servicio.summary)
         servicio.summary = `Mantenimiento de ${servicio.models.toLowerCase()}`;
     if (!servicio.operations || servicio.operations.length === 0)
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 8
+ Received  + 8

@@ -4112,39 +4112,39 @@

[Killed] MethodExpression
src/openapi-generator.js:507:48
     servicio.models = Capitalize(servicio.models)
     servicio.model = Capitalize(servicio.model)
     if (!servicio.summary)
-        servicio.summary = `Mantenimiento de ${servicio.models.toLowerCase()}`;
+        servicio.summary = `Mantenimiento de ${servicio.models.toUpperCase()}`;
     if (!servicio.operations || servicio.operations.length === 0)
         servicio.operations = ["GET", "POST", "PUT", "PATCH", "DELETE", "OPTIONS"];
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444
