[Killed] ConditionalExpression
src/openapi-generator.js:508:9
     servicio.model = Capitalize(servicio.model)
     if (!servicio.summary)
         servicio.summary = `Mantenimiento de ${servicio.models.toLowerCase()}`;
-    if (!servicio.operations || servicio.operations.length === 0)
+    if (true)
         servicio.operations = ["GET", "POST", "PUT", "PATCH", "DELETE", "OPTIONS"];
 }
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ConditionalExpression
src/openapi-generator.js:508:33
     servicio.model = Capitalize(servicio.model)
     if (!servicio.summary)
         servicio.summary = `Mantenimiento de ${servicio.models.toLowerCase()}`;
-    if (!servicio.operations || servicio.operations.length === 0)
+    if (!servicio.operations || false)
         servicio.operations = ["GET", "POST", "PUT", "PATCH", "DELETE", "OPTIONS"];
 }
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 258
+ Received  +   0

@@ -1980,268 +1980,10 @@

[Killed] StringLiteral
src/openapi-generator.js:509:39
     if (!servicio.summary)
         servicio.summary = `Mantenimiento de ${servicio.models.toLowerCase()}`;
     if (!servicio.operations || servicio.operations.length === 0)
-        servicio.operations = ["GET", "POST", "PUT", "PATCH", "DELETE", "OPTIONS"];
+        servicio.operations = ["GET", "", "PUT", "PATCH", "DELETE", "OPTIONS"];
 }
 const addComponents = (servicio) => {
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] ArrayDeclaration
src/openapi-generator.js:509:31
     if (!servicio.summary)
         servicio.summary = `Mantenimiento de ${servicio.models.toLowerCase()}`;
     if (!servicio.operations || servicio.operations.length === 0)
-        servicio.operations = ["GET", "POST", "PUT", "PATCH", "DELETE", "OPTIONS"];
+        servicio.operations = [];
 }
 const addComponents = (servicio) => {

[Killed] ConditionalExpression
src/openapi-generator.js:513:9
 }
 const addComponents = (servicio) => {
     let schema;
-    if (!servicio.schema) {
+    if (true) {
         schema = {
             type: "object", "properties": {
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 443
+ Received  +  21

@@ -126,59 +126,20 @@

[Killed] ObjectLiteral
src/openapi-generator.js:515:43
     let schema;
     if (!servicio.schema) {
         schema = {
-            type: "object", "properties": {
-                [servicio.pk]: {
-                    "type": "integer",
-                    "format": "int32",
-                    "minimum": 0,
-                    "description": "El 0 actúa como autonumérico en la creación"
-                },
-            }
+            type: "object", "properties": {}
         }
         servicio.schema = schema
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 8
+ Received  + 1

@@ -736,18 +736,11 @@

[Timeout] StringLiteral
src/openapi-generator.js:515:19
     let schema;
     if (!servicio.schema) {
         schema = {
-            type: "object", "properties": {
+            type: "", "properties": {
                 [servicio.pk]: {
                     "type": "integer",

[Timeout] ObjectLiteral
src/openapi-generator.js:516:32
     if (!servicio.schema) {
         schema = {
             type: "object", "properties": {
-                [servicio.pk]: {
-                    "type": "integer",
-                    "format": "int32",
-                    "minimum": 0,
-                    "description": "El 0 actúa como autonumérico en la creación"
-                },
+                [servicio.pk]: {},
             }
         }

[Timeout] StringLiteral
src/openapi-generator.js:517:29
         schema = {
             type: "object", "properties": {
                 [servicio.pk]: {
-                    "type": "integer",
+                    "type": "",
                     "format": "int32",
                     "minimum": 0,

[Timeout] StringLiteral
src/openapi-generator.js:520:36
                     "type": "integer",
                     "format": "int32",
                     "minimum": 0,
-                    "description": "El 0 actúa como autonumérico en la creación"
+                    "description": ""
                 },
             }

[Killed] EqualityOperator
src/openapi-generator.js:527:13
         servicio.schema = schema
     } else {
         schema = { ...servicio.schema }
-        if (schema.additionalProperties == undefined) schema.additionalProperties = false
+        if (schema.additionalProperties != undefined) schema.additionalProperties = false
         if (schema.properties[servicio.pk].type === "integer")
             schema.properties[servicio.pk].description = 'El 0 actúa como autonumérico en la creación'
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 7
+ Received  + 0

@@ -133,11 +133,10 @@

[Killed] BooleanLiteral
src/openapi-generator.js:527:85
         servicio.schema = schema
     } else {
         schema = { ...servicio.schema }
-        if (schema.additionalProperties == undefined) schema.additionalProperties = false
+        if (schema.additionalProperties == undefined) schema.additionalProperties = true
         if (schema.properties[servicio.pk].type === "integer")
             schema.properties[servicio.pk].description = 'El 0 actúa como autonumérico en la creación'
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 7
+ Received  + 7

@@ -133,11 +133,11 @@

[Killed] EqualityOperator
src/openapi-generator.js:528:13
     } else {
         schema = { ...servicio.schema }
         if (schema.additionalProperties == undefined) schema.additionalProperties = false
-        if (schema.properties[servicio.pk].type === "integer")
+        if (schema.properties[servicio.pk].type !== "integer")
             schema.properties[servicio.pk].description = 'El 0 actúa como autonumérico en la creación'
         delete schema.required
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ConditionalExpression
src/openapi-generator.js:528:13
     } else {
         schema = { ...servicio.schema }
         if (schema.additionalProperties == undefined) schema.additionalProperties = false
-        if (schema.properties[servicio.pk].type === "integer")
+        if (false)
             schema.properties[servicio.pk].description = 'El 0 actúa como autonumérico en la creación'
         delete schema.required
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] StringLiteral
src/openapi-generator.js:535:18
     schema.minProperties = 1
 
     swaggerDocument.components.schemas[servicio.model + 'Model'] = {
-        "title": `${servicio.model} (Modelo)`,
+        "title": ``,
         allOf: [{ "$ref": `#/components/schemas/${servicio.model}Projection` }],
     }

[Timeout] StringLiteral
src/openapi-generator.js:536:27
 
     swaggerDocument.components.schemas[servicio.model + 'Model'] = {
         "title": `${servicio.model} (Modelo)`,
-        allOf: [{ "$ref": `#/components/schemas/${servicio.model}Projection` }],
+        allOf: [{ "$ref": `` }],
     }
     if (servicio.schema.required)

[Killed] ConditionalExpression
src/openapi-generator.js:538:9
         "title": `${servicio.model} (Modelo)`,
         allOf: [{ "$ref": `#/components/schemas/${servicio.model}Projection` }],
     }
-    if (servicio.schema.required)
+    if (true)
         swaggerDocument.components.schemas[servicio.model + 'Model'].required = servicio.schema.required
     swaggerDocument.components.schemas[servicio.model + 'Projection'] = schema
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] ConditionalExpression
src/openapi-generator.js:538:9
         "title": `${servicio.model} (Modelo)`,
         allOf: [{ "$ref": `#/components/schemas/${servicio.model}Projection` }],
     }
-    if (servicio.schema.required)
+    if (false)
         swaggerDocument.components.schemas[servicio.model + 'Model'].required = servicio.schema.required
     swaggerDocument.components.schemas[servicio.model + 'Projection'] = schema

[Timeout] StringLiteral
src/openapi-generator.js:543:17
     swaggerDocument.components.schemas[servicio.model + 'Projection'] = schema
     swaggerDocument.components.schemas[servicio.model + 'Projection'].title = `${servicio.model} (Proyección)`
     swaggerDocument.components.schemas[servicio.models] = {
-        "type": "array",
+        "type": "",
         "title": `${servicio.models} (Listado)`,
         "items": { "$ref": `#/components/schemas/${servicio.model}Projection` }

[Killed] ObjectLiteral
src/openapi-generator.js:545:18
     swaggerDocument.components.schemas[servicio.models] = {
         "type": "array",
         "title": `${servicio.models} (Listado)`,
-        "items": { "$ref": `#/components/schemas/${servicio.model}Projection` }
+        "items": {}
     }
     swaggerDocument.components.schemas[`${servicio.models}Page`] = {
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 27
+ Received  +  9

@@ -181,13 +181,11 @@

[Timeout] StringLiteral
src/openapi-generator.js:545:28
     swaggerDocument.components.schemas[servicio.models] = {
         "type": "array",
         "title": `${servicio.models} (Listado)`,
-        "items": { "$ref": `#/components/schemas/${servicio.model}Projection` }
+        "items": { "$ref": `` }
     }
     swaggerDocument.components.schemas[`${servicio.models}Page`] = {

[Timeout] ObjectLiteral
src/openapi-generator.js:551:24
         "type": "object",
         "title": `${servicio.models} (Página)`,
         "properties": {
-            "content": { "$ref": `#/components/schemas/${servicio.models}` },
+            "content": {},
             "totalElements": {
                 "type": "integer", "description": "Número total de elementos"

[Timeout] StringLiteral
src/openapi-generator.js:553:51
         "properties": {
             "content": { "$ref": `#/components/schemas/${servicio.models}` },
             "totalElements": {
-                "type": "integer", "description": "Número total de elementos"
+                "type": "integer", "description": ""
             },
             "totalPages": {

[Killed] StringLiteral
src/openapi-generator.js:559:51
                 "type": "integer", "description": "Número total de páginas"
             },
             "size": {
-                "type": "integer", "description": "Tamaño de página en elementos"
+                "type": "integer", "description": ""
             },
             "number": {
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 9
+ Received  + 9

@@ -213,11 +213,11 @@

[Timeout] StringLiteral
src/openapi-generator.js:559:25
                 "type": "integer", "description": "Número total de páginas"
             },
             "size": {
-                "type": "integer", "description": "Tamaño de página en elementos"
+                "type": "", "description": "Tamaño de página en elementos"
             },
             "number": {

[Timeout] ObjectLiteral
src/openapi-generator.js:561:23
             "size": {
                 "type": "integer", "description": "Tamaño de página en elementos"
             },
-            "number": {
-                "type": "integer", "description": "Número de página actual"
-            },
+            "number": {},
             "numberOfElements": {
                 "type": "integer", "description": "Número total de elementos en la página"

[Timeout] StringLiteral
src/openapi-generator.js:562:25
                 "type": "integer", "description": "Tamaño de página en elementos"
             },
             "number": {
-                "type": "integer", "description": "Número de página actual"
+                "type": "", "description": "Número de página actual"
             },
             "numberOfElements": {

[Killed] StringLiteral
src/openapi-generator.js:565:51
                 "type": "integer", "description": "Número de página actual"
             },
             "numberOfElements": {
-                "type": "integer", "description": "Número total de elementos en la página"
+                "type": "integer", "description": ""
             },
             "empty": {
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ObjectLiteral
src/openapi-generator.js:567:22
             "numberOfElements": {
                 "type": "integer", "description": "Número total de elementos en la página"
             },
-            "empty": {
-                "type": "boolean", "description": "Si la página está vacía"
-            },
+            "empty": {},
             "first": {
                 "type": "boolean", "description": "Si la página es la primera"
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] StringLiteral
src/openapi-generator.js:568:51
                 "type": "integer", "description": "Número total de elementos en la página"
             },
             "empty": {
-                "type": "boolean", "description": "Si la página está vacía"
+                "type": "boolean", "description": ""
             },
             "first": {
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ObjectLiteral
src/openapi-generator.js:573:21
             "first": {
                 "type": "boolean", "description": "Si la página es la primera"
             },
-            "last": {
-                "type": "boolean", "description": "Si la página es la última"
-            }
+            "last": {}
         }
     }
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] StringLiteral
src/openapi-generator.js:574:51
                 "type": "boolean", "description": "Si la página es la primera"
             },
             "last": {
-                "type": "boolean", "description": "Si la página es la última"
+                "type": "boolean", "description": ""
             }
         }

[Killed] BlockStatement
src/openapi-generator.js:584:46
     addComponents(servicio);
     let sinID = {}
     let conID = {}
-    if (servicio.operations.includes('GET')) {
-        sinID = Object.assign(sinID, generaGetAll(servicio))
-        conID = Object.assign(conID, generaGetOne(servicio))
-    }
+    if (servicio.operations.includes('GET')) {}
     if (servicio.operations.includes('POST'))
         sinID = Object.assign(sinID, generaPost(servicio))
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 853
+ Received  +   0

@@ -1369,58 +1369,10 @@

[Timeout] ConditionalExpression
src/openapi-generator.js:584:9
     addComponents(servicio);
     let sinID = {}
     let conID = {}
-    if (servicio.operations.includes('GET')) {
+    if (false) {
         sinID = Object.assign(sinID, generaGetAll(servicio))
         conID = Object.assign(conID, generaGetOne(servicio))

[Killed] ConditionalExpression
src/openapi-generator.js:590:9
     }
     if (servicio.operations.includes('POST'))
         sinID = Object.assign(sinID, generaPost(servicio))
-    if (servicio.operations.includes('PUT')) {
+    if (true) {
         // sinID = Object.assign(sinID, generaGetAll(servicio))
         conID = Object.assign(conID, generaPut(servicio))
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  -  0
+ Received  + 33

@@ -2814,10 +2814,43 @@

[Timeout] BlockStatement
src/openapi-generator.js:590:46
     }
     if (servicio.operations.includes('POST'))
         sinID = Object.assign(sinID, generaPost(servicio))
-    if (servicio.operations.includes('PUT')) {
-        // sinID = Object.assign(sinID, generaGetAll(servicio))
-        conID = Object.assign(conID, generaPut(servicio))
-    }
+    if (servicio.operations.includes('PUT')) {}
     if (servicio.operations.includes('OPTIONS')) {
         sinID = Object.assign(sinID, generaOptions(servicio))

[Killed] ConditionalExpression
src/openapi-generator.js:594:9
         // sinID = Object.assign(sinID, generaGetAll(servicio))
         conID = Object.assign(conID, generaPut(servicio))
     }
-    if (servicio.operations.includes('OPTIONS')) {
+    if (false) {
         sinID = Object.assign(sinID, generaOptions(servicio))
         conID = Object.assign(conID, generaOptions(servicio))
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 252
+ Received  +   0

@@ -1417,27 +1417,10 @@

[Killed] ConditionalExpression
src/openapi-generator.js:600:9
     }
     if (servicio.operations.includes('PATCH'))
         conID = Object.assign(conID, generaPatch(servicio))
-    if (servicio.operations.includes('DELETE'))
+    if (true)
         conID = Object.assign(conID, generaDelete(servicio))
 
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  -  0
+ Received  + 48

@@ -2765,10 +2765,30 @@

[Timeout] ConditionalExpression
src/openapi-generator.js:600:9
     }
     if (servicio.operations.includes('PATCH'))
         conID = Object.assign(conID, generaPatch(servicio))
-    if (servicio.operations.includes('DELETE'))
+    if (false)
         conID = Object.assign(conID, generaDelete(servicio))
 

[Killed] BooleanLiteral
src/openapi-generator.js:603:9
     if (servicio.operations.includes('DELETE'))
         conID = Object.assign(conID, generaDelete(servicio))
 
-    if (!swaggerDocument.tags.some(item => item.name === servicio.tag))
+    if (swaggerDocument.tags.some(item => item.name === servicio.tag))
         swaggerDocument.tags.push({ name: servicio.tag, description: servicio.summary })
     if (Object.keys(sinID).length > 0)
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 32
+ Received  +  0

@@ -4112,42 +4112,10 @@

[Killed] MethodExpression
src/openapi-generator.js:603:10
     if (servicio.operations.includes('DELETE'))
         conID = Object.assign(conID, generaDelete(servicio))
 
-    if (!swaggerDocument.tags.some(item => item.name === servicio.tag))
+    if (!swaggerDocument.tags.every(item => item.name === servicio.tag))
         swaggerDocument.tags.push({ name: servicio.tag, description: servicio.summary })
     if (Object.keys(sinID).length > 0)
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] ObjectLiteral
src/openapi-generator.js:604:35
         conID = Object.assign(conID, generaDelete(servicio))
 
     if (!swaggerDocument.tags.some(item => item.name === servicio.tag))
-        swaggerDocument.tags.push({ name: servicio.tag, description: servicio.summary })
+        swaggerDocument.tags.push({})
     if (Object.keys(sinID).length > 0)
         swaggerDocument.paths[`${dirAPIs}/${servicio.endpoint}`] = sinID

[Killed] EqualityOperator
src/openapi-generator.js:605:9
 
     if (!swaggerDocument.tags.some(item => item.name === servicio.tag))
         swaggerDocument.tags.push({ name: servicio.tag, description: servicio.summary })
-    if (Object.keys(sinID).length > 0)
+    if (Object.keys(sinID).length >= 0)
         swaggerDocument.paths[`${dirAPIs}/${servicio.endpoint}`] = sinID
     if (Object.keys(conID).length > 0) {
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ConditionalExpression
src/openapi-generator.js:605:9
 
     if (!swaggerDocument.tags.some(item => item.name === servicio.tag))
         swaggerDocument.tags.push({ name: servicio.tag, description: servicio.summary })
-    if (Object.keys(sinID).length > 0)
+    if (false)
         swaggerDocument.paths[`${dirAPIs}/${servicio.endpoint}`] = sinID
     if (Object.keys(conID).length > 0) {
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] BlockStatement
src/openapi-generator.js:607:40
         swaggerDocument.tags.push({ name: servicio.tag, description: servicio.summary })
     if (Object.keys(sinID).length > 0)
         swaggerDocument.paths[`${dirAPIs}/${servicio.endpoint}`] = sinID
-    if (Object.keys(conID).length > 0) {
-        let pkType = "integer"
-        if (servicio?.schema?.properties?.[servicio.pk]?.type)
-            pkType = servicio.schema.properties[servicio.pk].type
-        swaggerDocument.paths[`${dirAPIs}/${servicio.endpoint}/{id}`] = Object.assign({
-            "parameters": [
-                {
-                    "name": "id",
-                    "in": "path",
-                    "required": true,
-                    "description": "Identificador del recurso",
-                    "schema": {
-                        "type": pkType
-                    }
-                }
-            ]
-        }, conID)
-    }
+    if (Object.keys(conID).length > 0) {}
 }
 
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ConditionalExpression
src/openapi-generator.js:607:9
         swaggerDocument.tags.push({ name: servicio.tag, description: servicio.summary })
     if (Object.keys(sinID).length > 0)
         swaggerDocument.paths[`${dirAPIs}/${servicio.endpoint}`] = sinID
-    if (Object.keys(conID).length > 0) {
+    if (false) {
         let pkType = "integer"
         if (servicio?.schema?.properties?.[servicio.pk]?.type)
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 1365
+ Received  +    0

@@ -1473,195 +1473,10 @@

[Killed] OptionalChaining
src/openapi-generator.js:609:13
         swaggerDocument.paths[`${dirAPIs}/${servicio.endpoint}`] = sinID
     if (Object.keys(conID).length > 0) {
         let pkType = "integer"
-        if (servicio?.schema?.properties?.[servicio.pk]?.type)
+        if (servicio?.schema.properties?.[servicio.pk]?.type)
             pkType = servicio.schema.properties[servicio.pk].type
         swaggerDocument.paths[`${dirAPIs}/${servicio.endpoint}/{id}`] = Object.assign({
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ConditionalExpression
src/openapi-generator.js:609:13
         swaggerDocument.paths[`${dirAPIs}/${servicio.endpoint}`] = sinID
     if (Object.keys(conID).length > 0) {
         let pkType = "integer"
-        if (servicio?.schema?.properties?.[servicio.pk]?.type)
+        if (true)
             pkType = servicio.schema.properties[servicio.pk].type
         swaggerDocument.paths[`${dirAPIs}/${servicio.endpoint}/{id}`] = Object.assign({
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] BooleanLiteral
src/openapi-generator.js:616:33
                 {
                     "name": "id",
                     "in": "path",
-                    "required": true,
+                    "required": false,
                     "description": "Identificador del recurso",
                     "schema": {

[Timeout] ObjectLiteral
src/openapi-generator.js:618:31
                     "in": "path",
                     "required": true,
                     "description": "Identificador del recurso",
-                    "schema": {
-                        "type": pkType
-                    }
+                    "schema": {}
                 }
             ]

[Timeout] BooleanLiteral
src/openapi-generator.js:627:13
     }
 }
 
-let cache = false
+let cache = true
 const generaSwaggerSpecification = (server, dirAPIs, shutdown, dirAPIsSeguridad) => {
     if (cache) {

[Killed] ConditionalExpression
src/openapi-generator.js:629:9
 
 let cache = false
 const generaSwaggerSpecification = (server, dirAPIs, shutdown, dirAPIsSeguridad) => {
-    if (cache) {
+    if (true) {
         if (server.hostname && swaggerDocument.servers[0].url !== `{protocol}://${server.hostname}:{port}/`)
             swaggerDocument.servers[0].url = `{protocol}://${server.hostname}:{port}/`
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 3933
+ Received  +    3

@@ -120,361 +120,10 @@

[Timeout] ConditionalExpression
src/openapi-generator.js:629:9
 
 let cache = false
 const generaSwaggerSpecification = (server, dirAPIs, shutdown, dirAPIsSeguridad) => {
-    if (cache) {
+    if (false) {
         if (server.hostname && swaggerDocument.servers[0].url !== `{protocol}://${server.hostname}:{port}/`)
             swaggerDocument.servers[0].url = `{protocol}://${server.hostname}:{port}/`

[NoCoverage] ConditionalExpression
src/openapi-generator.js:630:32
 let cache = false
 const generaSwaggerSpecification = (server, dirAPIs, shutdown, dirAPIsSeguridad) => {
     if (cache) {
-        if (server.hostname && swaggerDocument.servers[0].url !== `{protocol}://${server.hostname}:{port}/`)
+        if (server.hostname && true)
             swaggerDocument.servers[0].url = `{protocol}://${server.hostname}:{port}/`
         return swaggerDocument

[Timeout] ConditionalExpression
src/openapi-generator.js:630:13
 let cache = false
 const generaSwaggerSpecification = (server, dirAPIs, shutdown, dirAPIsSeguridad) => {
     if (cache) {
-        if (server.hostname && swaggerDocument.servers[0].url !== `{protocol}://${server.hostname}:{port}/`)
+        if (false)
             swaggerDocument.servers[0].url = `{protocol}://${server.hostname}:{port}/`
         return swaggerDocument

[Survived] BooleanLiteral
src/openapi-generator.js:634:13
             swaggerDocument.servers[0].url = `{protocol}://${server.hostname}:{port}/`
         return swaggerDocument
     }
-    cache = true
+    cache = false
     const valid = validate(serviciosConfig)
     if (!valid) {

[Killed] ConditionalExpression
src/openapi-generator.js:636:9
     }
     cache = true
     const valid = validate(serviciosConfig)
-    if (!valid) {
+    if (false) {
         validate.errors.forEach(err => console.log(serviciosConfig[/\/(\d*)/.exec(err.instancePath)[1]], err))
         shutdown()
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[NoCoverage] BlockStatement
src/openapi-generator.js:636:17
     }
     cache = true
     const valid = validate(serviciosConfig)
-    if (!valid) {
-        validate.errors.forEach(err => console.log(serviciosConfig[/\/(\d*)/.exec(err.instancePath)[1]], err))
-        shutdown()
-    }
+    if (!valid) {}
 
     swaggerDocument.servers[0].variables.port.default = server.port ?? server

[NoCoverage] ArrowFunction
src/openapi-generator.js:637:33
     cache = true
     const valid = validate(serviciosConfig)
     if (!valid) {
-        validate.errors.forEach(err => console.log(serviciosConfig[/\/(\d*)/.exec(err.instancePath)[1]], err))
+        validate.errors.forEach(() => undefined)
         shutdown()
     }

[NoCoverage] Regex
src/openapi-generator.js:637:68
     cache = true
     const valid = validate(serviciosConfig)
     if (!valid) {
-        validate.errors.forEach(err => console.log(serviciosConfig[/\/(\d*)/.exec(err.instancePath)[1]], err))
+        validate.errors.forEach(err => console.log(serviciosConfig[/\/(\D*)/.exec(err.instancePath)[1]], err))
         shutdown()
     }

[Timeout] LogicalOperator
src/openapi-generator.js:641:57
         shutdown()
     }
 
-    swaggerDocument.servers[0].variables.port.default = server.port ?? server
+    swaggerDocument.servers[0].variables.port.default = server.port && server
     serviciosConfig.forEach(servicio => addServiceDocumentation(servicio, dirAPIs))
     let apisSeguridad = swaggerJsdoc({

[Killed] ArrowFunction
src/openapi-generator.js:642:29
     }
 
     swaggerDocument.servers[0].variables.port.default = server.port ?? server
-    serviciosConfig.forEach(servicio => addServiceDocumentation(servicio, dirAPIs))
+    serviciosConfig.forEach(() => undefined)
     let apisSeguridad = swaggerJsdoc({
         swaggerDefinition: { openapi: swaggerDocument.openapi, info: swaggerDocument.info },
killedBy: Pruebas unitarias Generar OpenApi
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Pruebas unitarias Generar OpenApi 1`

- Snapshot  - 3328
+ Received  +    0

@@ -120,361 +120,10 @@
