[Killed] ConditionalExpression
src/utils.js:3:20
 const serviciosConfig = require('../data/__servicios.json');
 const http = require('http');
-const production = process.env.NODE_ENV === 'production';
+const production = false;
 
 module.exports.getServiciosConfig = () => serviciosConfig  // Facilitator de mock
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] ConditionalExpression
src/utils.js:3:20
 const serviciosConfig = require('../data/__servicios.json');
 const http = require('http');
-const production = process.env.NODE_ENV === 'production';
+const production = true;
 
 module.exports.getServiciosConfig = () => serviciosConfig  // Facilitator de mock

[Timeout] ArrowFunction
src/utils.js:7:29
 
 module.exports.getServiciosConfig = () => serviciosConfig  // Facilitator de mock
 
-module.exports.extractURL = (req) => `${req.protocol}://${req.hostname}:${req.connection.localPort}${req.originalUrl}`
+module.exports.extractURL = () => undefined
 module.exports.formatLocation = (req, id) => `${req.protocol}://${req.hostname}:${req.connection.localPort}${req.originalUrl}/${id}`
 module.exports.generateProjection = (source, projection) => {

[Timeout] StringLiteral
src/utils.js:7:38
 
 module.exports.getServiciosConfig = () => serviciosConfig  // Facilitator de mock
 
-module.exports.extractURL = (req) => `${req.protocol}://${req.hostname}:${req.connection.localPort}${req.originalUrl}`
+module.exports.extractURL = (req) => ``
 module.exports.formatLocation = (req, id) => `${req.protocol}://${req.hostname}:${req.connection.localPort}${req.originalUrl}/${id}`
 module.exports.generateProjection = (source, projection) => {

[Timeout] ArrowFunction
src/utils.js:8:33
 module.exports.getServiciosConfig = () => serviciosConfig  // Facilitator de mock
 
 module.exports.extractURL = (req) => `${req.protocol}://${req.hostname}:${req.connection.localPort}${req.originalUrl}`
-module.exports.formatLocation = (req, id) => `${req.protocol}://${req.hostname}:${req.connection.localPort}${req.originalUrl}/${id}`
+module.exports.formatLocation = () => undefined
 module.exports.generateProjection = (source, projection) => {
     if(!source || !projection) return source

[Killed] BlockStatement
src/utils.js:9:61
 
 module.exports.extractURL = (req) => `${req.protocol}://${req.hostname}:${req.connection.localPort}${req.originalUrl}`
 module.exports.formatLocation = (req, id) => `${req.protocol}://${req.hostname}:${req.connection.localPort}${req.originalUrl}/${id}`
-module.exports.generateProjection = (source, projection) => {
-    if(!source || !projection) return source
-    const propiedades = projection.replace(/\s/g, '').split(',');
-    let target = {};
-    const fields = Object.keys(source)
-    propiedades.forEach(item => {
-        if (fields.includes(item)) target[item] = source[item]
-    });
-    return Object.keys(target).length > 0 ? target : source;
-}
+module.exports.generateProjection = (source, projection) => {}
 module.exports.emptyPropertiesToNull = source => {
     if(!source) return source
killedBy: utils generateProjection
statusReason: TypeError: Cannot convert undefined or null to object

[Timeout] ConditionalExpression
src/utils.js:10:8
 module.exports.extractURL = (req) => `${req.protocol}://${req.hostname}:${req.connection.localPort}${req.originalUrl}`
 module.exports.formatLocation = (req, id) => `${req.protocol}://${req.hostname}:${req.connection.localPort}${req.originalUrl}/${id}`
 module.exports.generateProjection = (source, projection) => {
-    if(!source || !projection) return source
+    if(false) return source
     const propiedades = projection.replace(/\s/g, '').split(',');
     let target = {};

[Timeout] BooleanLiteral
src/utils.js:10:8
 module.exports.extractURL = (req) => `${req.protocol}://${req.hostname}:${req.connection.localPort}${req.originalUrl}`
 module.exports.formatLocation = (req, id) => `${req.protocol}://${req.hostname}:${req.connection.localPort}${req.originalUrl}/${id}`
 module.exports.generateProjection = (source, projection) => {
-    if(!source || !projection) return source
+    if(source || !projection) return source
     const propiedades = projection.replace(/\s/g, '').split(',');
     let target = {};

[Timeout] BlockStatement
src/utils.js:14:33
     const propiedades = projection.replace(/\s/g, '').split(',');
     let target = {};
     const fields = Object.keys(source)
-    propiedades.forEach(item => {
-        if (fields.includes(item)) target[item] = source[item]
-    });
+    propiedades.forEach(item => {});
     return Object.keys(target).length > 0 ? target : source;
 }

[Timeout] ConditionalExpression
src/utils.js:15:13
     let target = {};
     const fields = Object.keys(source)
     propiedades.forEach(item => {
-        if (fields.includes(item)) target[item] = source[item]
+        if (false) target[item] = source[item]
     });
     return Object.keys(target).length > 0 ? target : source;

[Timeout] ConditionalExpression
src/utils.js:15:13
     let target = {};
     const fields = Object.keys(source)
     propiedades.forEach(item => {
-        if (fields.includes(item)) target[item] = source[item]
+        if (true) target[item] = source[item]
     });
     return Object.keys(target).length > 0 ? target : source;

[Timeout] EqualityOperator
src/utils.js:17:12
     propiedades.forEach(item => {
         if (fields.includes(item)) target[item] = source[item]
     });
-    return Object.keys(target).length > 0 ? target : source;
+    return Object.keys(target).length >= 0 ? target : source;
 }
 module.exports.emptyPropertiesToNull = source => {

[Timeout] ConditionalExpression
src/utils.js:17:12
     propiedades.forEach(item => {
         if (fields.includes(item)) target[item] = source[item]
     });
-    return Object.keys(target).length > 0 ? target : source;
+    return true ? target : source;
 }
 module.exports.emptyPropertiesToNull = source => {

[Timeout] BlockStatement
src/utils.js:19:50
     });
     return Object.keys(target).length > 0 ? target : source;
 }
-module.exports.emptyPropertiesToNull = source => {
-    if(!source) return source
-    const target = { ...source }
-    Object.keys(target).forEach(prop => {
-        if (target[prop] === '') target[prop] = null
-    })
-    return target
-}
+module.exports.emptyPropertiesToNull = source => {}
 
 // Unificación de los errores

[Timeout] ConditionalExpression
src/utils.js:20:8
     return Object.keys(target).length > 0 ? target : source;
 }
 module.exports.emptyPropertiesToNull = source => {
-    if(!source) return source
+    if(false) return source
     const target = { ...source }
     Object.keys(target).forEach(prop => {

[Timeout] ConditionalExpression
src/utils.js:20:8
     return Object.keys(target).length > 0 ? target : source;
 }
 module.exports.emptyPropertiesToNull = source => {
-    if(!source) return source
+    if(true) return source
     const target = { ...source }
     Object.keys(target).forEach(prop => {

[Timeout] BlockStatement
src/utils.js:22:41
 module.exports.emptyPropertiesToNull = source => {
     if(!source) return source
     const target = { ...source }
-    Object.keys(target).forEach(prop => {
-        if (target[prop] === '') target[prop] = null
-    })
+    Object.keys(target).forEach(prop => {})
     return target
 }

[Timeout] EqualityOperator
src/utils.js:23:13
     if(!source) return source
     const target = { ...source }
     Object.keys(target).forEach(prop => {
-        if (target[prop] === '') target[prop] = null
+        if (target[prop] !== '') target[prop] = null
     })
     return target

[Timeout] ConditionalExpression
src/utils.js:23:13
     if(!source) return source
     const target = { ...source }
     Object.keys(target).forEach(prop => {
-        if (target[prop] === '') target[prop] = null
+        if (false) target[prop] = null
     })
     return target

[Timeout] BlockStatement
src/utils.js:49:55
 */
 
 class ApiError extends Error {
-    constructor(status, message, payload = undefined) {
-        super(message);
-        this.status = status;
-        this.name = 'ApiError';
-        if (payload) this.payload = payload
-    }
+    constructor(status, message, payload = undefined) {}
 }
 module.exports.ApiError = ApiError

[Timeout] ConditionalExpression
src/utils.js:53:13
         super(message);
         this.status = status;
         this.name = 'ApiError';
-        if (payload) this.payload = payload
+        if (false) this.payload = payload
     }
 }

[Timeout] ConditionalExpression
src/utils.js:53:13
         super(message);
         this.status = status;
         this.name = 'ApiError';
-        if (payload) this.payload = payload
+        if (true) this.payload = payload
     }
 }

[Timeout] ObjectLiteral
src/utils.js:58:17
 }
 module.exports.ApiError = ApiError
 
-const details = {
-    0: { type: 'about:blank', title: 'Unknown error' },
-    400: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.1', title: 'Bad Request' },
-    401: { type: 'https://datatracker.ietf.org/doc/html/rfc7235#section-3.1 ', title: 'Unauthorized' },
-    402: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.2', title: 'Payment Required' },
-    403: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.3', title: 'Forbidden' },
-    404: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.4', title: 'Not Found' },
-    405: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.5', title: 'Method Not Allowed' },
-    406: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.6', title: 'Not Acceptable' },
-    407: { type: 'https://datatracker.ietf.org/doc/html/rfc7235#section-3.2 ', title: 'Proxy Authentication Required' },
-    408: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.7', title: 'Request Timeout' },
-    409: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.8', title: 'Conflict' },
-    410: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.9', title: 'Gone' },
-    411: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.10', title: 'Length Required' },
-    412: { type: 'https://datatracker.ietf.org/doc/html/rfc7232#section-4.2 ', title: 'Precondition Failed' },
-    413: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.11', title: 'Request Entity Too Large' },
-    414: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.12', title: 'Request-URI Too Long' },
-    415: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.13', title: 'Unsupported Media Type' },
-    416: { type: 'https://datatracker.ietf.org/doc/html/rfc7233#section-4.4 ', title: 'Requested Range Not Suitable' },
-    417: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.14', title: 'Expectation Failed' },
-    426: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.15', title: 'Upgrade Required' },
-    500: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.6.1', title: 'Internal Server Error' },
-}
+const details = {}
 module.exports.problemDetails = (req, status = 400, detail = undefined, errors = undefined, source = undefined) => {
     const problem = Object.assign({}, details[status] ?? details[0], { status, instance: req.originalUrl })

[Killed] StringLiteral
src/utils.js:59:38
 module.exports.ApiError = ApiError
 
 const details = {
-    0: { type: 'about:blank', title: 'Unknown error' },
+    0: { type: 'about:blank', title: "" },
     400: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.1', title: 'Bad Request' },
     401: { type: 'https://datatracker.ietf.org/doc/html/rfc7235#section-3.1 ', title: 'Unauthorized' },
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Survived] ObjectLiteral
src/utils.js:59:8
 module.exports.ApiError = ApiError
 
 const details = {
-    0: { type: 'about:blank', title: 'Unknown error' },
+    0: {},
     400: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.1', title: 'Bad Request' },
     401: { type: 'https://datatracker.ietf.org/doc/html/rfc7235#section-3.1 ', title: 'Unauthorized' },

[Timeout] StringLiteral
src/utils.js:60:18
 
 const details = {
     0: { type: 'about:blank', title: 'Unknown error' },
-    400: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.1', title: 'Bad Request' },
+    400: { type: "", title: 'Bad Request' },
     401: { type: 'https://datatracker.ietf.org/doc/html/rfc7235#section-3.1 ', title: 'Unauthorized' },
     402: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.2', title: 'Payment Required' },

[Killed] StringLiteral
src/utils.js:62:18
     0: { type: 'about:blank', title: 'Unknown error' },
     400: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.1', title: 'Bad Request' },
     401: { type: 'https://datatracker.ietf.org/doc/html/rfc7235#section-3.1 ', title: 'Unauthorized' },
-    402: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.2', title: 'Payment Required' },
+    402: { type: "", title: 'Payment Required' },
     403: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.3', title: 'Forbidden' },
     404: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.4', title: 'Not Found' },
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] ObjectLiteral
src/utils.js:62:10
     0: { type: 'about:blank', title: 'Unknown error' },
     400: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.1', title: 'Bad Request' },
     401: { type: 'https://datatracker.ietf.org/doc/html/rfc7235#section-3.1 ', title: 'Unauthorized' },
-    402: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.2', title: 'Payment Required' },
+    402: {},
     403: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.3', title: 'Forbidden' },
     404: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.4', title: 'Not Found' },

[Timeout] ObjectLiteral
src/utils.js:65:10
     402: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.2', title: 'Payment Required' },
     403: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.3', title: 'Forbidden' },
     404: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.4', title: 'Not Found' },
-    405: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.5', title: 'Method Not Allowed' },
+    405: {},
     406: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.6', title: 'Not Acceptable' },
     407: { type: 'https://datatracker.ietf.org/doc/html/rfc7235#section-3.2 ', title: 'Proxy Authentication Required' },

[Timeout] StringLiteral
src/utils.js:66:18
     403: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.3', title: 'Forbidden' },
     404: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.4', title: 'Not Found' },
     405: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.5', title: 'Method Not Allowed' },
-    406: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.6', title: 'Not Acceptable' },
+    406: { type: "", title: 'Not Acceptable' },
     407: { type: 'https://datatracker.ietf.org/doc/html/rfc7235#section-3.2 ', title: 'Proxy Authentication Required' },
     408: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.7', title: 'Request Timeout' },

[Timeout] ObjectLiteral
src/utils.js:68:10
     405: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.5', title: 'Method Not Allowed' },
     406: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.6', title: 'Not Acceptable' },
     407: { type: 'https://datatracker.ietf.org/doc/html/rfc7235#section-3.2 ', title: 'Proxy Authentication Required' },
-    408: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.7', title: 'Request Timeout' },
+    408: {},
     409: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.8', title: 'Conflict' },
     410: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.9', title: 'Gone' },

[Survived] StringLiteral
src/utils.js:68:88
     405: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.5', title: 'Method Not Allowed' },
     406: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.6', title: 'Not Acceptable' },
     407: { type: 'https://datatracker.ietf.org/doc/html/rfc7235#section-3.2 ', title: 'Proxy Authentication Required' },
-    408: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.7', title: 'Request Timeout' },
+    408: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.7', title: "" },
     409: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.8', title: 'Conflict' },
     410: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.9', title: 'Gone' },

[Killed] StringLiteral
src/utils.js:69:18
     406: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.6', title: 'Not Acceptable' },
     407: { type: 'https://datatracker.ietf.org/doc/html/rfc7235#section-3.2 ', title: 'Proxy Authentication Required' },
     408: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.7', title: 'Request Timeout' },
-    409: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.8', title: 'Conflict' },
+    409: { type: "", title: 'Conflict' },
     410: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.9', title: 'Gone' },
     411: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.10', title: 'Length Required' },
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] StringLiteral
src/utils.js:71:89
     408: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.7', title: 'Request Timeout' },
     409: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.8', title: 'Conflict' },
     410: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.9', title: 'Gone' },
-    411: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.10', title: 'Length Required' },
+    411: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.10', title: "" },
     412: { type: 'https://datatracker.ietf.org/doc/html/rfc7232#section-4.2 ', title: 'Precondition Failed' },
     413: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.11', title: 'Request Entity Too Large' },
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] ObjectLiteral
src/utils.js:71:10
     408: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.7', title: 'Request Timeout' },
     409: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.8', title: 'Conflict' },
     410: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.9', title: 'Gone' },
-    411: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.10', title: 'Length Required' },
+    411: {},
     412: { type: 'https://datatracker.ietf.org/doc/html/rfc7232#section-4.2 ', title: 'Precondition Failed' },
     413: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.11', title: 'Request Entity Too Large' },

[Killed] StringLiteral
src/utils.js:72:18
     409: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.8', title: 'Conflict' },
     410: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.9', title: 'Gone' },
     411: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.10', title: 'Length Required' },
-    412: { type: 'https://datatracker.ietf.org/doc/html/rfc7232#section-4.2 ', title: 'Precondition Failed' },
+    412: { type: "", title: 'Precondition Failed' },
     413: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.11', title: 'Request Entity Too Large' },
     414: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.12', title: 'Request-URI Too Long' },
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Survived] ObjectLiteral
src/utils.js:72:10
     409: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.8', title: 'Conflict' },
     410: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.9', title: 'Gone' },
     411: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.10', title: 'Length Required' },
-    412: { type: 'https://datatracker.ietf.org/doc/html/rfc7232#section-4.2 ', title: 'Precondition Failed' },
+    412: {},
     413: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.11', title: 'Request Entity Too Large' },
     414: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.12', title: 'Request-URI Too Long' },

[Killed] StringLiteral
src/utils.js:73:18
     410: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.9', title: 'Gone' },
     411: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.10', title: 'Length Required' },
     412: { type: 'https://datatracker.ietf.org/doc/html/rfc7232#section-4.2 ', title: 'Precondition Failed' },
-    413: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.11', title: 'Request Entity Too Large' },
+    413: { type: "", title: 'Request Entity Too Large' },
     414: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.12', title: 'Request-URI Too Long' },
     415: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.13', title: 'Unsupported Media Type' },
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Survived] ObjectLiteral
src/utils.js:73:10
     410: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.9', title: 'Gone' },
     411: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.10', title: 'Length Required' },
     412: { type: 'https://datatracker.ietf.org/doc/html/rfc7232#section-4.2 ', title: 'Precondition Failed' },
-    413: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.11', title: 'Request Entity Too Large' },
+    413: {},
     414: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.12', title: 'Request-URI Too Long' },
     415: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.13', title: 'Unsupported Media Type' },

[Survived] ObjectLiteral
src/utils.js:76:10
     413: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.11', title: 'Request Entity Too Large' },
     414: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.12', title: 'Request-URI Too Long' },
     415: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.13', title: 'Unsupported Media Type' },
-    416: { type: 'https://datatracker.ietf.org/doc/html/rfc7233#section-4.4 ', title: 'Requested Range Not Suitable' },
+    416: {},
     417: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.14', title: 'Expectation Failed' },
     426: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.15', title: 'Upgrade Required' },

[Timeout] StringLiteral
src/utils.js:78:18
     415: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.13', title: 'Unsupported Media Type' },
     416: { type: 'https://datatracker.ietf.org/doc/html/rfc7233#section-4.4 ', title: 'Requested Range Not Suitable' },
     417: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.14', title: 'Expectation Failed' },
-    426: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.15', title: 'Upgrade Required' },
+    426: { type: "", title: 'Upgrade Required' },
     500: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.6.1', title: 'Internal Server Error' },
 }

[Killed] StringLiteral
src/utils.js:79:18
     416: { type: 'https://datatracker.ietf.org/doc/html/rfc7233#section-4.4 ', title: 'Requested Range Not Suitable' },
     417: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.14', title: 'Expectation Failed' },
     426: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.15', title: 'Upgrade Required' },
-    500: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.6.1', title: 'Internal Server Error' },
+    500: { type: "", title: 'Internal Server Error' },
 }
 module.exports.problemDetails = (req, status = 400, detail = undefined, errors = undefined, source = undefined) => {
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] BlockStatement
src/utils.js:81:116
     426: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.5.15', title: 'Upgrade Required' },
     500: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.6.1', title: 'Internal Server Error' },
 }
-module.exports.problemDetails = (req, status = 400, detail = undefined, errors = undefined, source = undefined) => {
-    const problem = Object.assign({}, details[status] ?? details[0], { status, instance: req.originalUrl })
-    if (detail && detail !== problem.title) problem.detail = detail
-    if (errors) problem.errors = errors
-    if (!production && source) problem.source = source
-    return problem
-}
+module.exports.problemDetails = (req, status = 400, detail = undefined, errors = undefined, source = undefined) => {}
 module.exports.generateError = (res, detail, status = 500, errors = undefined, source = undefined) =>
     new ApiError(status, http.STATUS_CODES[status], module.exports.problemDetails(res, status, detail, errors, source))

[Timeout] LogicalOperator
src/utils.js:82:39
     500: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.6.1', title: 'Internal Server Error' },
 }
 module.exports.problemDetails = (req, status = 400, detail = undefined, errors = undefined, source = undefined) => {
-    const problem = Object.assign({}, details[status] ?? details[0], { status, instance: req.originalUrl })
+    const problem = Object.assign({}, details[status] && details[0], { status, instance: req.originalUrl })
     if (detail && detail !== problem.title) problem.detail = detail
     if (errors) problem.errors = errors

[Timeout] ObjectLiteral
src/utils.js:82:70
     500: { type: 'https://datatracker.ietf.org/doc/html/rfc7231#section-6.6.1', title: 'Internal Server Error' },
 }
 module.exports.problemDetails = (req, status = 400, detail = undefined, errors = undefined, source = undefined) => {
-    const problem = Object.assign({}, details[status] ?? details[0], { status, instance: req.originalUrl })
+    const problem = Object.assign({}, details[status] ?? details[0], {})
     if (detail && detail !== problem.title) problem.detail = detail
     if (errors) problem.errors = errors

[Timeout] LogicalOperator
src/utils.js:83:9
 }
 module.exports.problemDetails = (req, status = 400, detail = undefined, errors = undefined, source = undefined) => {
     const problem = Object.assign({}, details[status] ?? details[0], { status, instance: req.originalUrl })
-    if (detail && detail !== problem.title) problem.detail = detail
+    if (detail || detail !== problem.title) problem.detail = detail
     if (errors) problem.errors = errors
     if (!production && source) problem.source = source

[Timeout] ConditionalExpression
src/utils.js:83:9
 }
 module.exports.problemDetails = (req, status = 400, detail = undefined, errors = undefined, source = undefined) => {
     const problem = Object.assign({}, details[status] ?? details[0], { status, instance: req.originalUrl })
-    if (detail && detail !== problem.title) problem.detail = detail
+    if (true) problem.detail = detail
     if (errors) problem.errors = errors
     if (!production && source) problem.source = source

[Timeout] ConditionalExpression
src/utils.js:84:9
 module.exports.problemDetails = (req, status = 400, detail = undefined, errors = undefined, source = undefined) => {
     const problem = Object.assign({}, details[status] ?? details[0], { status, instance: req.originalUrl })
     if (detail && detail !== problem.title) problem.detail = detail
-    if (errors) problem.errors = errors
+    if (true) problem.errors = errors
     if (!production && source) problem.source = source
     return problem

[Timeout] ConditionalExpression
src/utils.js:84:9
 module.exports.problemDetails = (req, status = 400, detail = undefined, errors = undefined, source = undefined) => {
     const problem = Object.assign({}, details[status] ?? details[0], { status, instance: req.originalUrl })
     if (detail && detail !== problem.title) problem.detail = detail
-    if (errors) problem.errors = errors
+    if (false) problem.errors = errors
     if (!production && source) problem.source = source
     return problem

[Timeout] BooleanLiteral
src/utils.js:85:9
     const problem = Object.assign({}, details[status] ?? details[0], { status, instance: req.originalUrl })
     if (detail && detail !== problem.title) problem.detail = detail
     if (errors) problem.errors = errors
-    if (!production && source) problem.source = source
+    if (production && source) problem.source = source
     return problem
 }
