[Timeout] ConditionalExpression
src/openapi-generator.js:647:24
         swaggerDefinition: { openapi: swaggerDocument.openapi, info: swaggerDocument.info },
         apis: [`${__dirname}/seguridad.js`]
     });
-    dirAPIsSeguridad = dirAPIsSeguridad || dirAPIs
+    dirAPIsSeguridad = false
     if(dirAPIsSeguridad === '/') dirAPIsSeguridad = '';
     swaggerDocument.tags = [ ...swaggerDocument.tags, ...apisSeguridad.tags ]

[Timeout] LogicalOperator
src/openapi-generator.js:647:24
         swaggerDefinition: { openapi: swaggerDocument.openapi, info: swaggerDocument.info },
         apis: [`${__dirname}/seguridad.js`]
     });
-    dirAPIsSeguridad = dirAPIsSeguridad || dirAPIs
+    dirAPIsSeguridad = dirAPIsSeguridad && dirAPIs
     if(dirAPIsSeguridad === '/') dirAPIsSeguridad = '';
     swaggerDocument.tags = [ ...swaggerDocument.tags, ...apisSeguridad.tags ]

[Killed] ConditionalExpression
src/openapi-generator.js:648:8
         apis: [`${__dirname}/seguridad.js`]
     });
     dirAPIsSeguridad = dirAPIsSeguridad || dirAPIs
-    if(dirAPIsSeguridad === '/') dirAPIsSeguridad = '';
+    if(true) dirAPIsSeguridad = '';
     swaggerDocument.tags = [ ...swaggerDocument.tags, ...apisSeguridad.tags ]
     for(let path in apisSeguridad.paths) {
killedBy: Seguridad Pruebas con ficheros simulados /login KO POST: Sin body
statusReason: Error: expected 400 "Bad Request", got 415 "Unsupported Media Type"

[Timeout] EqualityOperator
src/openapi-generator.js:648:8
         apis: [`${__dirname}/seguridad.js`]
     });
     dirAPIsSeguridad = dirAPIsSeguridad || dirAPIs
-    if(dirAPIsSeguridad === '/') dirAPIsSeguridad = '';
+    if(dirAPIsSeguridad !== '/') dirAPIsSeguridad = '';
     swaggerDocument.tags = [ ...swaggerDocument.tags, ...apisSeguridad.tags ]
     for(let path in apisSeguridad.paths) {

[Timeout] BlockStatement
src/openapi-generator.js:650:42
     dirAPIsSeguridad = dirAPIsSeguridad || dirAPIs
     if(dirAPIsSeguridad === '/') dirAPIsSeguridad = '';
     swaggerDocument.tags = [ ...swaggerDocument.tags, ...apisSeguridad.tags ]
-    for(let path in apisSeguridad.paths) {
-        swaggerDocument.paths[dirAPIsSeguridad + path] = apisSeguridad.paths[path]
-    }
+    for(let path in apisSeguridad.paths) {}
     for(let component in apisSeguridad.components) {
             if(!swaggerDocument.components[component]) swaggerDocument.components[component] = {}

[Timeout] ArithmeticOperator
src/openapi-generator.js:651:31
     if(dirAPIsSeguridad === '/') dirAPIsSeguridad = '';
     swaggerDocument.tags = [ ...swaggerDocument.tags, ...apisSeguridad.tags ]
     for(let path in apisSeguridad.paths) {
-        swaggerDocument.paths[dirAPIsSeguridad + path] = apisSeguridad.paths[path]
+        swaggerDocument.paths[dirAPIsSeguridad - path] = apisSeguridad.paths[path]
     }
     for(let component in apisSeguridad.components) {

[Timeout] BlockStatement
src/openapi-generator.js:653:52
     for(let path in apisSeguridad.paths) {
         swaggerDocument.paths[dirAPIsSeguridad + path] = apisSeguridad.paths[path]
     }
-    for(let component in apisSeguridad.components) {
-            if(!swaggerDocument.components[component]) swaggerDocument.components[component] = {}
-            Object.assign(swaggerDocument.components[component], swaggerDocument.components[component],  apisSeguridad.components[component])
-    }
+    for(let component in apisSeguridad.components) {}
     return swaggerDocument;
 }

[Survived] ConditionalExpression
src/openapi-generator.js:654:16
         swaggerDocument.paths[dirAPIsSeguridad + path] = apisSeguridad.paths[path]
     }
     for(let component in apisSeguridad.components) {
-            if(!swaggerDocument.components[component]) swaggerDocument.components[component] = {}
+            if(false) swaggerDocument.components[component] = {}
             Object.assign(swaggerDocument.components[component], swaggerDocument.components[component],  apisSeguridad.components[component])
     }

[Timeout] BooleanLiteral
src/openapi-generator.js:654:16
         swaggerDocument.paths[dirAPIsSeguridad + path] = apisSeguridad.paths[path]
     }
     for(let component in apisSeguridad.components) {
-            if(!swaggerDocument.components[component]) swaggerDocument.components[component] = {}
+            if(swaggerDocument.components[component]) swaggerDocument.components[component] = {}
             Object.assign(swaggerDocument.components[component], swaggerDocument.components[component],  apisSeguridad.components[component])
     }
