[Timeout] LogicalOperator
src/utils.js:85:9
     const problem = Object.assign({}, details[status] ?? details[0], { status, instance: req.originalUrl })
     if (detail && detail !== problem.title) problem.detail = detail
     if (errors) problem.errors = errors
-    if (!production && source) problem.source = source
+    if (!production || source) problem.source = source
     return problem
 }

[Timeout] ArrowFunction
src/utils.js:88:32
     if (!production && source) problem.source = source
     return problem
 }
-module.exports.generateError = (res, detail, status = 500, errors = undefined, source = undefined) =>
-    new ApiError(status, http.STATUS_CODES[status], module.exports.problemDetails(res, status, detail, errors, source))
+module.exports.generateError = () => undefined
 module.exports.generateErrorByStatus = (res, status = 500) => module.exports.generateError(res, http.STATUS_CODES[status], status)
 module.exports.generateErrorByError = (req, error, status = 500) => {

[Killed] ArrowFunction
src/utils.js:90:40
 }
 module.exports.generateError = (res, detail, status = 500, errors = undefined, source = undefined) =>
     new ApiError(status, http.STATUS_CODES[status], module.exports.problemDetails(res, status, detail, errors, source))
-module.exports.generateErrorByStatus = (res, status = 500) => module.exports.generateError(res, http.STATUS_CODES[status], status)
+module.exports.generateErrorByStatus = () => undefined
 module.exports.generateErrorByError = (req, error, status = 500) => {
     switch (error.name) {
killedBy: Seguridad Pruebas Aisladas Middleware: Autorización onlyAuthenticated: sin autenticar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 200

[Timeout] BlockStatement
src/utils.js:91:69
 module.exports.generateError = (res, detail, status = 500, errors = undefined, source = undefined) =>
     new ApiError(status, http.STATUS_CODES[status], module.exports.problemDetails(res, status, detail, errors, source))
 module.exports.generateErrorByStatus = (res, status = 500) => module.exports.generateError(res, http.STATUS_CODES[status], status)
-module.exports.generateErrorByError = (req, error, status = 500) => {
-    switch (error.name) {
-        case 'dbJSONError':
-            return module.exports.generateError(req, error.message, error.code)
-        case 'SequelizeValidationError':
-        case 'SequelizeUniqueConstraintError':
-        case 'Bad Request': // OpenApiValidator
-            return module.exports.generateError(req, 'One or more validation errors occurred.', 400,
-                ...error.errors.map(item => ({ [item.path]: item.message })), error.trace ?? error.stack)
-        default:
-            return module.exports.generateError(req, error.message, error.statusCode ?? error.status ?? status, error.errors, error.trace ?? error.stack)
-    }
-}
+module.exports.generateErrorByError = (req, error, status = 500) => {}
 

[Timeout] ConditionalExpression
src/utils.js:93:9
 module.exports.generateErrorByStatus = (res, status = 500) => module.exports.generateError(res, http.STATUS_CODES[status], status)
 module.exports.generateErrorByError = (req, error, status = 500) => {
     switch (error.name) {
-        case 'dbJSONError':
-            return module.exports.generateError(req, error.message, error.code)
+        case 'dbJSONError':
         case 'SequelizeValidationError':
         case 'SequelizeUniqueConstraintError':

[Timeout] StringLiteral
src/utils.js:96:14
         case 'dbJSONError':
             return module.exports.generateError(req, error.message, error.code)
         case 'SequelizeValidationError':
-        case 'SequelizeUniqueConstraintError':
+        case "":
         case 'Bad Request': // OpenApiValidator
             return module.exports.generateError(req, 'One or more validation errors occurred.', 400,

[NoCoverage] ConditionalExpression
src/utils.js:97:9
             return module.exports.generateError(req, error.message, error.code)
         case 'SequelizeValidationError':
         case 'SequelizeUniqueConstraintError':
-        case 'Bad Request': // OpenApiValidator
-            return module.exports.generateError(req, 'One or more validation errors occurred.', 400,
-                ...error.errors.map(item => ({ [item.path]: item.message })), error.trace ?? error.stack)
+        case 'Bad Request':
         default:
             return module.exports.generateError(req, error.message, error.statusCode ?? error.status ?? status, error.errors, error.trace ?? error.stack)

[Timeout] StringLiteral
src/utils.js:97:14
             return module.exports.generateError(req, error.message, error.code)
         case 'SequelizeValidationError':
         case 'SequelizeUniqueConstraintError':
-        case 'Bad Request': // OpenApiValidator
+        case "": // OpenApiValidator
             return module.exports.generateError(req, 'One or more validation errors occurred.', 400,
                 ...error.errors.map(item => ({ [item.path]: item.message })), error.trace ?? error.stack)

[NoCoverage] StringLiteral
src/utils.js:98:54
         case 'SequelizeValidationError':
         case 'SequelizeUniqueConstraintError':
         case 'Bad Request': // OpenApiValidator
-            return module.exports.generateError(req, 'One or more validation errors occurred.', 400,
+            return module.exports.generateError(req, "", 400,
                 ...error.errors.map(item => ({ [item.path]: item.message })), error.trace ?? error.stack)
         default:

[NoCoverage] LogicalOperator
src/utils.js:99:79
         case 'SequelizeUniqueConstraintError':
         case 'Bad Request': // OpenApiValidator
             return module.exports.generateError(req, 'One or more validation errors occurred.', 400,
-                ...error.errors.map(item => ({ [item.path]: item.message })), error.trace ?? error.stack)
+                ...error.errors.map(item => ({ [item.path]: item.message })), error.trace && error.stack)
         default:
             return module.exports.generateError(req, error.message, error.statusCode ?? error.status ?? status, error.errors, error.trace ?? error.stack)

[NoCoverage] ArrowFunction
src/utils.js:99:37
         case 'SequelizeUniqueConstraintError':
         case 'Bad Request': // OpenApiValidator
             return module.exports.generateError(req, 'One or more validation errors occurred.', 400,
-                ...error.errors.map(item => ({ [item.path]: item.message })), error.trace ?? error.stack)
+                ...error.errors.map(() => undefined), error.trace ?? error.stack)
         default:
             return module.exports.generateError(req, error.message, error.statusCode ?? error.status ?? status, error.errors, error.trace ?? error.stack)

[Timeout] ConditionalExpression
src/utils.js:100:9
         case 'Bad Request': // OpenApiValidator
             return module.exports.generateError(req, 'One or more validation errors occurred.', 400,
                 ...error.errors.map(item => ({ [item.path]: item.message })), error.trace ?? error.stack)
-        default:
-            return module.exports.generateError(req, error.message, error.statusCode ?? error.status ?? status, error.errors, error.trace ?? error.stack)
+        default:
     }
 }

[Timeout] LogicalOperator
src/utils.js:101:69
             return module.exports.generateError(req, 'One or more validation errors occurred.', 400,
                 ...error.errors.map(item => ({ [item.path]: item.message })), error.trace ?? error.stack)
         default:
-            return module.exports.generateError(req, error.message, error.statusCode ?? error.status ?? status, error.errors, error.trace ?? error.stack)
+            return module.exports.generateError(req, error.message, error.statusCode && error.status ?? status, error.errors, error.trace ?? error.stack)
     }
 }

[Timeout] LogicalOperator
src/utils.js:101:127
             return module.exports.generateError(req, 'One or more validation errors occurred.', 400,
                 ...error.errors.map(item => ({ [item.path]: item.message })), error.trace ?? error.stack)
         default:
-            return module.exports.generateError(req, error.message, error.statusCode ?? error.status ?? status, error.errors, error.trace ?? error.stack)
+            return module.exports.generateError(req, error.message, error.statusCode ?? error.status ?? status, error.errors, error.trace && error.stack)
     }
 }
