[Timeout] BlockStatement
src/seguridad.js:14:43
 module.exports = router
 
 // Criptografía
-async function encriptaPassword(password) {
-    const salt = await bcrypt.genSalt(10)
-    return bcrypt.hash(password, salt)
-}
+async function encriptaPassword(password) {}
 
 const RefreshTokenHMAC256 = {

[Timeout] BlockStatement
src/seguridad.js:25:24
             usr: usuario[config.security.PROP_USERNAME],
     },
-    decode: (token) => {
-        return jwt.verify(token, config.security.REFRESH_KEY);
-    }
+    decode: (token) => {}
 }
 

[Timeout] BlockStatement
src/seguridad.js:40:24
             roles: usuario.roles
     },
-    decode: (token) => {
-        let buff = Buffer.from(config.security.PUBLIC_KEY, 'base64');
-        return jwt.verify(token, createPublicKey({ key: buff, format: 'der', type: 'spki' }), { algorithms: ['RS256'] });
-    }
+    decode: (token) => {}
 }
 const CreatedTokenHMAC256 = {

[Timeout] StringLiteral
src/seguridad.js:41:60
     },
     decode: (token) => {
-        let buff = Buffer.from(config.security.PUBLIC_KEY, 'base64');
+        let buff = Buffer.from(config.security.PUBLIC_KEY, "");
         return jwt.verify(token, createPublicKey({ key: buff, format: 'der', type: 'spki' }), { algorithms: ['RS256'] });
     }

[Timeout] StringLiteral
src/seguridad.js:42:110
     },
     decode: (token) => {
         let buff = Buffer.from(config.security.PUBLIC_KEY, 'base64');
-        return jwt.verify(token, createPublicKey({ key: buff, format: 'der', type: 'spki' }), { algorithms: ['RS256'] });
+        return jwt.verify(token, createPublicKey({ key: buff, format: 'der', type: 'spki' }), { algorithms: [""] });
     }
 }

[Timeout] ObjectLiteral
src/seguridad.js:45:29
         return jwt.verify(token, createPublicKey({ key: buff, format: 'der', type: 'spki' }), { algorithms: ['RS256'] });
     }
 }
-const CreatedTokenHMAC256 = {
-    generar: (usuario) => {
-        return jwt.sign({
-            usr: usuario[config.security.PROP_USERNAME],
-        }, config.security.REFRESH_KEY, { expiresIn: '24h' })
-    },
-    decode: (token) => {
-        return jwt.verify(token, config.security.REFRESH_KEY);
-    }
-}
+const CreatedTokenHMAC256 = {}
 module.exports.CreatedTokenHMAC256 = CreatedTokenHMAC256;
 

[Timeout] BlockStatement
src/seguridad.js:46:27
     }
 }
 const CreatedTokenHMAC256 = {
-    generar: (usuario) => {
-        return jwt.sign({
-            usr: usuario[config.security.PROP_USERNAME],
-        }, config.security.REFRESH_KEY, { expiresIn: '24h' })
-    },
+    generar: (usuario) => {},
     decode: (token) => {
         return jwt.verify(token, config.security.REFRESH_KEY);

[Timeout] ObjectLiteral
src/seguridad.js:47:25
 }
 const CreatedTokenHMAC256 = {
     generar: (usuario) => {
-        return jwt.sign({
-            usr: usuario[config.security.PROP_USERNAME],
-        }, config.security.REFRESH_KEY, { expiresIn: '24h' })
+        return jwt.sign({}, config.security.REFRESH_KEY, { expiresIn: '24h' })
     },
     decode: (token) => {

[Timeout] BlockStatement
src/seguridad.js:59:50
 
 module.exports.generarTokenJWT = TokenRS256.generar
 
-module.exports.generarTokenScheme = (usuario) => {
-    return config.security.AUTHENTICATION_SCHEME + module.exports.generarTokenJWT(usuario)
-}
+module.exports.generarTokenScheme = (usuario) => {}
 
 // Middleware: Cross-origin resource sharing (CORS)

[Timeout] ArithmeticOperator
src/seguridad.js:60:12
 module.exports.generarTokenJWT = TokenRS256.generar
 
 module.exports.generarTokenScheme = (usuario) => {
-    return config.security.AUTHENTICATION_SCHEME + module.exports.generarTokenJWT(usuario)
+    return config.security.AUTHENTICATION_SCHEME - module.exports.generarTokenJWT(usuario)
 }
 

[Timeout] BlockStatement
src/seguridad.js:64:46
 }
 
 // Middleware: Cross-origin resource sharing (CORS)
-module.exports.useCORS = (req, res, next) => {
-    let origen = req.header("origin")
-    if (/*req.method !== 'OPTIONS' ||*/ !origen || origen === '*') {
-        return next()
-    }
-    res.header('Access-Control-Allow-Origin', origen)
-    // res.header('Access-Control-Allow-Headers', 'Origin, Content-Type, Accept, authorization, X-Requested-With, X-XSRF-TOKEN, accept-language')
-    res.header('Access-Control-Allow-Headers', '*')
-    res.header('Access-Control-Allow-Methods', 'GET, POST, PUT, DELETE, PATCH, OPTIONS')
-    res.header('Access-Control-Allow-Credentials', validator.isURL(origen, { require_tld: false }))
-    return next()
-}
+module.exports.useCORS = (req, res, next) => {}
 
 // Middleware: Autenticación

[Killed] EqualityOperator
src/seguridad.js:66:52
 // Middleware: Cross-origin resource sharing (CORS)
 module.exports.useCORS = (req, res, next) => {
     let origen = req.header("origin")
-    if (/*req.method !== 'OPTIONS' ||*/ !origen || origen === '*') {
+    if (/*req.method !== 'OPTIONS' ||*/ !origen || origen !== '*') {
         return next()
     }
killedBy: Seguridad Pruebas Aisladas Middleware: Cross-origin resource sharing (CORS) Con Origin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "www.example.com"
Received: undefined

[Killed] ConditionalExpression
src/seguridad.js:66:41
 // Middleware: Cross-origin resource sharing (CORS)
 module.exports.useCORS = (req, res, next) => {
     let origen = req.header("origin")
-    if (/*req.method !== 'OPTIONS' ||*/ !origen || origen === '*') {
+    if (/*req.method !== 'OPTIONS' ||*/ true) {
         return next()
     }
killedBy: Seguridad Pruebas Aisladas Middleware: Cross-origin resource sharing (CORS) Con Origin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "www.example.com"
Received: undefined

[Timeout] BooleanLiteral
src/seguridad.js:73:91
     // res.header('Access-Control-Allow-Headers', 'Origin, Content-Type, Accept, authorization, X-Requested-With, X-XSRF-TOKEN, accept-language')
     res.header('Access-Control-Allow-Headers', '*')
     res.header('Access-Control-Allow-Methods', 'GET, POST, PUT, DELETE, PATCH, OPTIONS')
-    res.header('Access-Control-Allow-Credentials', validator.isURL(origen, { require_tld: false }))
+    res.header('Access-Control-Allow-Credentials', validator.isURL(origen, { require_tld: true }))
     return next()
 }

[Timeout] BooleanLiteral
src/seguridad.js:79:34
 
 // Middleware: Autenticación
 module.exports.useAuthentication = (req, res, next) => {
-    res.locals.isAuthenticated = false;
+    res.locals.isAuthenticated = true;
     let token = ''
     if (!req.headers['authorization']) {

[Survived] StringLiteral
src/seguridad.js:80:17
 // Middleware: Autenticación
 module.exports.useAuthentication = (req, res, next) => {
     res.locals.isAuthenticated = false;
-    let token = ''
+    let token = "Stryker was here!"
     if (!req.headers['authorization']) {
         if (!req.cookies['Authorization']) {

[Killed] BlockStatement
src/seguridad.js:81:40
 module.exports.useAuthentication = (req, res, next) => {
     res.locals.isAuthenticated = false;
     let token = ''
-    if (!req.headers['authorization']) {
-        if (!req.cookies['Authorization']) {
-            next();
-            return;
-        }
-        token = req.cookies['Authorization'];
-    } else
+    if (!req.headers['authorization']) {} else
         token = req.headers['authorization'].substring(config.security.AUTHENTICATION_SCHEME.length)
     try {
killedBy: Seguridad Pruebas Aisladas Middleware: Autenticación Sin cabecera
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Timeout] BooleanLiteral
src/seguridad.js:81:9
 module.exports.useAuthentication = (req, res, next) => {
     res.locals.isAuthenticated = false;
     let token = ''
-    if (!req.headers['authorization']) {
+    if (req.headers['authorization']) {
         if (!req.cookies['Authorization']) {
             next();

[Timeout] BooleanLiteral
src/seguridad.js:82:13
     res.locals.isAuthenticated = false;
     let token = ''
     if (!req.headers['authorization']) {
-        if (!req.cookies['Authorization']) {
+        if (req.cookies['Authorization']) {
             next();
             return;

[Timeout] ConditionalExpression
src/seguridad.js:82:13
     res.locals.isAuthenticated = false;
     let token = ''
     if (!req.headers['authorization']) {
-        if (!req.cookies['Authorization']) {
+        if (false) {
             next();
             return;

[Timeout] StringLiteral
src/seguridad.js:86:29
             next();
             return;
         }
-        token = req.cookies['Authorization'];
+        token = req.cookies[""];
     } else
         token = req.headers['authorization'].substring(config.security.AUTHENTICATION_SCHEME.length)

[Timeout] MethodExpression
src/seguridad.js:88:17
         }
         token = req.cookies['Authorization'];
     } else
-        token = req.headers['authorization'].substring(config.security.AUTHENTICATION_SCHEME.length)
+        token = req.headers['authorization']
     try {
         let decoded = TokenRS256.decode(token);

[Timeout] StringLiteral
src/seguridad.js:88:29
         }
         token = req.cookies['Authorization'];
     } else
-        token = req.headers['authorization'].substring(config.security.AUTHENTICATION_SCHEME.length)
+        token = req.headers[""].substring(config.security.AUTHENTICATION_SCHEME.length)
     try {
         let decoded = TokenRS256.decode(token);

[Timeout] BlockStatement
src/seguridad.js:89:9
         token = req.cookies['Authorization'];
     } else
         token = req.headers['authorization'].substring(config.security.AUTHENTICATION_SCHEME.length)
-    try {
-        let decoded = TokenRS256.decode(token);
-        res.locals.isAuthenticated = true;
-        res.locals.usr = decoded.usr;
-        res.locals.name = decoded.name;
-        res.locals.roles = decoded.roles;
-        res.locals.isInRole = role => res.locals.roles.includes(role)
-        next();
-    } catch (err) {
+    try {} catch (err) {
         if (err.name === 'TokenExpiredError') {
             res.set('WWW-Authenticate', 'Bearer realm="MicroserviciosJWT", error="invalid_token", error_description="The access token expired"')

[Timeout] BooleanLiteral
src/seguridad.js:91:38
         token = req.headers['authorization'].substring(config.security.AUTHENTICATION_SCHEME.length)
     try {
         let decoded = TokenRS256.decode(token);
-        res.locals.isAuthenticated = true;
+        res.locals.isAuthenticated = false;
         res.locals.usr = decoded.usr;
         res.locals.name = decoded.name;

[Timeout] ArrowFunction
src/seguridad.js:95:31
         res.locals.usr = decoded.usr;
         res.locals.name = decoded.name;
         res.locals.roles = decoded.roles;
-        res.locals.isInRole = role => res.locals.roles.includes(role)
+        res.locals.isInRole = () => undefined
         next();
     } catch (err) {

[Timeout] BlockStatement
src/seguridad.js:97:19
         res.locals.roles = decoded.roles;
         res.locals.isInRole = role => res.locals.roles.includes(role)
         next();
-    } catch (err) {
-        if (err.name === 'TokenExpiredError') {
-            res.set('WWW-Authenticate', 'Bearer realm="MicroserviciosJWT", error="invalid_token", error_description="The access token expired"')
-            return next(generateError(req, `Invalid token: token expired`, 403, [{ expiredAt: err.expiredAt }]))
-        }
-        return next(generateError(req, 'Invalid token', 401))
-    }
+    } catch (err) {}
 }
 // Middleware: Autorización

[Timeout] BlockStatement
src/seguridad.js:98:47
         res.locals.isInRole = role => res.locals.roles.includes(role)
         next();
     } catch (err) {
-        if (err.name === 'TokenExpiredError') {
-            res.set('WWW-Authenticate', 'Bearer realm="MicroserviciosJWT", error="invalid_token", error_description="The access token expired"')
-            return next(generateError(req, `Invalid token: token expired`, 403, [{ expiredAt: err.expiredAt }]))
-        }
+        if (err.name === 'TokenExpiredError') {}
         return next(generateError(req, 'Invalid token', 401))
     }

[Timeout] ConditionalExpression
src/seguridad.js:98:13
         res.locals.isInRole = role => res.locals.roles.includes(role)
         next();
     } catch (err) {
-        if (err.name === 'TokenExpiredError') {
+        if (false) {
             res.set('WWW-Authenticate', 'Bearer realm="MicroserviciosJWT", error="invalid_token", error_description="The access token expired"')
             return next(generateError(req, `Invalid token: token expired`, 403, [{ expiredAt: err.expiredAt }]))

[Timeout] ArrayDeclaration
src/seguridad.js:100:81
     } catch (err) {
         if (err.name === 'TokenExpiredError') {
             res.set('WWW-Authenticate', 'Bearer realm="MicroserviciosJWT", error="invalid_token", error_description="The access token expired"')
-            return next(generateError(req, `Invalid token: token expired`, 403, [{ expiredAt: err.expiredAt }]))
+            return next(generateError(req, `Invalid token: token expired`, 403, []))
         }
         return next(generateError(req, 'Invalid token', 401))

[Timeout] StringLiteral
src/seguridad.js:100:44
     } catch (err) {
         if (err.name === 'TokenExpiredError') {
             res.set('WWW-Authenticate', 'Bearer realm="MicroserviciosJWT", error="invalid_token", error_description="The access token expired"')
-            return next(generateError(req, `Invalid token: token expired`, 403, [{ expiredAt: err.expiredAt }]))
+            return next(generateError(req, ``, 403, [{ expiredAt: err.expiredAt }]))
         }
         return next(generateError(req, 'Invalid token', 401))

[Timeout] BlockStatement
src/seguridad.js:106:56
     }
 }
 // Middleware: Autorización
-module.exports.onlyAuthenticated = (req, res, next) => {
-    if (req.method === 'OPTIONS') {
-        return next()
-    }
-    if (!res.locals.isAuthenticated) {
-        return next(generateErrorByStatus(req, 401))
-    }
-    next()
-}
+module.exports.onlyAuthenticated = (req, res, next) => {}
 module.exports.onlyInRole = (roles) => (req, res, next) => {
     if (req.method === 'OPTIONS') {

[Timeout] ConditionalExpression
src/seguridad.js:107:9
 }
 // Middleware: Autorización
 module.exports.onlyAuthenticated = (req, res, next) => {
-    if (req.method === 'OPTIONS') {
+    if (true) {
         return next()
     }

[Timeout] BlockStatement
src/seguridad.js:107:35
 }
 // Middleware: Autorización
 module.exports.onlyAuthenticated = (req, res, next) => {
-    if (req.method === 'OPTIONS') {
-        return next()
-    }
+    if (req.method === 'OPTIONS') {}
     if (!res.locals.isAuthenticated) {
         return next(generateErrorByStatus(req, 401))

[Timeout] BlockStatement
src/seguridad.js:110:38
     if (req.method === 'OPTIONS') {
         return next()
     }
-    if (!res.locals.isAuthenticated) {
-        return next(generateErrorByStatus(req, 401))
-    }
+    if (!res.locals.isAuthenticated) {}
     next()
 }

[Timeout] BooleanLiteral
src/seguridad.js:110:9
     if (req.method === 'OPTIONS') {
         return next()
     }
-    if (!res.locals.isAuthenticated) {
+    if (res.locals.isAuthenticated) {
         return next(generateErrorByStatus(req, 401))
     }

[Timeout] BlockStatement
src/seguridad.js:115:60
     }
     next()
 }
-module.exports.onlyInRole = (roles) => (req, res, next) => {
-    if (req.method === 'OPTIONS') {
-        return next()
-    }
-    if (!res.locals.isAuthenticated) {
-        return next(generateErrorByStatus(req, 401))
-    }
-
-    if (roles.split(',').some(role => res.locals.isInRole(role))) {
-        next()
-    } else {
-        return next(generateErrorByStatus(req, 403))
-    }
-}
+module.exports.onlyInRole = (roles) => (req, res, next) => {}
 module.exports.onlySelf = (_req, res, next) => {
     res.locals.onlySelf = true;

[Timeout] ConditionalExpression
src/seguridad.js:116:9
     next()
 }
 module.exports.onlyInRole = (roles) => (req, res, next) => {
-    if (req.method === 'OPTIONS') {
+    if (true) {
         return next()
     }

[Timeout] EqualityOperator
src/seguridad.js:116:9
     next()
 }
 module.exports.onlyInRole = (roles) => (req, res, next) => {
-    if (req.method === 'OPTIONS') {
+    if (req.method !== 'OPTIONS') {
         return next()
     }

[Timeout] ConditionalExpression
src/seguridad.js:119:9
     if (req.method === 'OPTIONS') {
         return next()
     }
-    if (!res.locals.isAuthenticated) {
+    if (false) {
         return next(generateErrorByStatus(req, 401))
     }

[Timeout] BlockStatement
src/seguridad.js:123:67
         return next(generateErrorByStatus(req, 401))
     }
 
-    if (roles.split(',').some(role => res.locals.isInRole(role))) {
-        next()
-    } else {
+    if (roles.split(',').some(role => res.locals.isInRole(role))) {} else {
         return next(generateErrorByStatus(req, 403))
     }

[Timeout] ConditionalExpression
src/seguridad.js:123:9
         return next(generateErrorByStatus(req, 401))
     }
 
-    if (roles.split(',').some(role => res.locals.isInRole(role))) {
+    if (false) {
         next()
     } else {

[Timeout] BlockStatement
src/seguridad.js:125:12
 
     if (roles.split(',').some(role => res.locals.isInRole(role))) {
         next()
-    } else {
-        return next(generateErrorByStatus(req, 403))
-    }
+    } else {}
 }
 module.exports.onlySelf = (_req, res, next) => {

[Timeout] BlockStatement
src/seguridad.js:129:48
         return next(generateErrorByStatus(req, 403))
     }
 }
-module.exports.onlySelf = (_req, res, next) => {
-    res.locals.onlySelf = true;
-    next()
-}
+module.exports.onlySelf = (_req, res, next) => {}
 module.exports.readOnly = (req, res, next) => {
     if (req.method !== 'GET' && req.method !== 'OPTIONS' && !res.locals.isAuthenticated) {

[Killed] BooleanLiteral
src/seguridad.js:130:27
     }
 }
 module.exports.onlySelf = (_req, res, next) => {
-    res.locals.onlySelf = true;
+    res.locals.onlySelf = false;
     next()
 }
killedBy: Seguridad Pruebas Aisladas Middleware: Autorización onlySelf: KO
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 403
Received: 200

[Timeout] BlockStatement
src/seguridad.js:133:47
     res.locals.onlySelf = true;
     next()
 }
-module.exports.readOnly = (req, res, next) => {
-    if (req.method !== 'GET' && req.method !== 'OPTIONS' && !res.locals.isAuthenticated) {
-        return next(generateErrorByStatus(req, 401))
-    }
-    next()
-}
+module.exports.readOnly = (req, res, next) => {}
 
 const isSelf = (res, id) => {

[Killed] LogicalOperator
src/seguridad.js:134:9
     next()
 }
 module.exports.readOnly = (req, res, next) => {
-    if (req.method !== 'GET' && req.method !== 'OPTIONS' && !res.locals.isAuthenticated) {
+    if (req.method !== 'GET' || req.method !== 'OPTIONS' && !res.locals.isAuthenticated) {
         return next(generateErrorByStatus(req, 401))
     }
killedBy: Seguridad Pruebas Aisladas Middleware: Autorización readOnly: KO
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] ConditionalExpression
src/seguridad.js:134:9
     next()
 }
 module.exports.readOnly = (req, res, next) => {
-    if (req.method !== 'GET' && req.method !== 'OPTIONS' && !res.locals.isAuthenticated) {
+    if (true) {
         return next(generateErrorByStatus(req, 401))
     }
killedBy: Seguridad Pruebas Aisladas Middleware: Autorización readOnly: OK
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Timeout] BlockStatement
src/seguridad.js:140:29
     next()
 }
 
-const isSelf = (res, id) => {
-    return !res.locals.onlySelf || !id || id == res.locals.usr
-}
+const isSelf = (res, id) => {}
 module.exports.isSelf = isSelf
 

[Killed] ConditionalExpression
src/seguridad.js:141:43
 }
 
 const isSelf = (res, id) => {
-    return !res.locals.onlySelf || !id || id == res.locals.usr
+    return !res.locals.onlySelf || !id || false
 }
 module.exports.isSelf = isSelf
killedBy: Seguridad Pruebas Aisladas Middleware: Autorización onlySelf: OK
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 403

[Killed] LogicalOperator
src/seguridad.js:141:12
 }
 
 const isSelf = (res, id) => {
-    return !res.locals.onlySelf || !id || id == res.locals.usr
+    return (!res.locals.onlySelf || !id) && id == res.locals.usr
 }
 module.exports.isSelf = isSelf
killedBy: Seguridad Pruebas Aisladas Middleware: Autorización onlySelf: OK
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 403

[Killed] BlockStatement
src/seguridad.js:146:45
 module.exports.isSelf = isSelf
 
 // Middleware: Cross-Site Request Forgery (XSRF)
-module.exports.generateXsrfToken = (req) => {
-    const hash = createHash('sha256')
-    let client = `${req.client.remoteFamily}-${req.client.remoteAddress}`
-    hash.update(client)
-    return hash.digest('base64')
-}
+module.exports.generateXsrfToken = (req) => {}
 function generateXsrfCookie(req, res) {
     res.cookie('XSRF-TOKEN', module.exports.generateXsrfToken(req), { httpOnly: false, maxAge: 30 * 60 * 1000 })
killedBy: Seguridad Pruebas Aisladas Middleware: Cross-Site Request Forgery (XSRF) Cookie-to-Header Token
statusReason: TypeError: Invalid value "undefined" for header "x-xsrf-token"

[Timeout] BlockStatement
src/seguridad.js:152:39
     hash.update(client)
     return hash.digest('base64')
 }
-function generateXsrfCookie(req, res) {
-    res.cookie('XSRF-TOKEN', module.exports.generateXsrfToken(req), { httpOnly: false, maxAge: 30 * 60 * 1000 })
-}
+function generateXsrfCookie(req, res) {}
 function isInvalidXsrfToken(req) {
     let token = req.headers['x-xsrf-token'] || req.body['xsrftoken']

[Timeout] BooleanLiteral
src/seguridad.js:153:81
     return hash.digest('base64')
 }
 function generateXsrfCookie(req, res) {
-    res.cookie('XSRF-TOKEN', module.exports.generateXsrfToken(req), { httpOnly: false, maxAge: 30 * 60 * 1000 })
+    res.cookie('XSRF-TOKEN', module.exports.generateXsrfToken(req), { httpOnly: true, maxAge: 30 * 60 * 1000 })
 }
 function isInvalidXsrfToken(req) {

[Timeout] ArithmeticOperator
src/seguridad.js:153:96
     return hash.digest('base64')
 }
 function generateXsrfCookie(req, res) {
-    res.cookie('XSRF-TOKEN', module.exports.generateXsrfToken(req), { httpOnly: false, maxAge: 30 * 60 * 1000 })
+    res.cookie('XSRF-TOKEN', module.exports.generateXsrfToken(req), { httpOnly: false, maxAge: 30 / 60 * 1000 })
 }
 function isInvalidXsrfToken(req) {

[Timeout] BlockStatement
src/seguridad.js:155:34
 function generateXsrfCookie(req, res) {
     res.cookie('XSRF-TOKEN', module.exports.generateXsrfToken(req), { httpOnly: false, maxAge: 30 * 60 * 1000 })
 }
-function isInvalidXsrfToken(req) {
-    let token = req.headers['x-xsrf-token'] || req.body['xsrftoken']
-    let cookie = req.cookies['XSRF-TOKEN']
-    let secret = module.exports.generateXsrfToken(req)
-    return !token || cookie !== token || token !== secret
-}
+function isInvalidXsrfToken(req) {}
 // Middleware: Cookie-to-Header Token
 module.exports.useXSRF = (req, res, next) => {

[Timeout] ConditionalExpression
src/seguridad.js:156:17
     res.cookie('XSRF-TOKEN', module.exports.generateXsrfToken(req), { httpOnly: false, maxAge: 30 * 60 * 1000 })
 }
 function isInvalidXsrfToken(req) {
-    let token = req.headers['x-xsrf-token'] || req.body['xsrftoken']
+    let token = false
     let cookie = req.cookies['XSRF-TOKEN']
     let secret = module.exports.generateXsrfToken(req)

[Timeout] LogicalOperator
src/seguridad.js:156:17
     res.cookie('XSRF-TOKEN', module.exports.generateXsrfToken(req), { httpOnly: false, maxAge: 30 * 60 * 1000 })
 }
 function isInvalidXsrfToken(req) {
-    let token = req.headers['x-xsrf-token'] || req.body['xsrftoken']
+    let token = req.headers['x-xsrf-token'] && req.body['xsrftoken']
     let cookie = req.cookies['XSRF-TOKEN']
     let secret = module.exports.generateXsrfToken(req)

[Timeout] StringLiteral
src/seguridad.js:157:30
 }
 function isInvalidXsrfToken(req) {
     let token = req.headers['x-xsrf-token'] || req.body['xsrftoken']
-    let cookie = req.cookies['XSRF-TOKEN']
+    let cookie = req.cookies[""]
     let secret = module.exports.generateXsrfToken(req)
     return !token || cookie !== token || token !== secret

[Timeout] ConditionalExpression
src/seguridad.js:159:12
     let token = req.headers['x-xsrf-token'] || req.body['xsrftoken']
     let cookie = req.cookies['XSRF-TOKEN']
     let secret = module.exports.generateXsrfToken(req)
-    return !token || cookie !== token || token !== secret
+    return true
 }
 // Middleware: Cookie-to-Header Token

[Timeout] BooleanLiteral
src/seguridad.js:159:12
     let token = req.headers['x-xsrf-token'] || req.body['xsrftoken']
     let cookie = req.cookies['XSRF-TOKEN']
     let secret = module.exports.generateXsrfToken(req)
-    return !token || cookie !== token || token !== secret
+    return token || cookie !== token || token !== secret
 }
 // Middleware: Cookie-to-Header Token

[Timeout] BlockStatement
src/seguridad.js:162:46
     return !token || cookie !== token || token !== secret
 }
 // Middleware: Cookie-to-Header Token
-module.exports.useXSRF = (req, res, next) => {
-    if (!req.cookies['XSRF-TOKEN'])
-        generateXsrfCookie(req, res)
-    if ('POST|PUT|DELETE|PATCH'.includes(req.method.toUpperCase()) && isInvalidXsrfToken(req)) {
-        if (req.cookies['XSRF-TOKEN'] !== module.exports.generateXsrfToken(req))
-            generateXsrfCookie(req, res)
-        return next(generateError(req, 'Invalid XSRF-TOKEN', 401))
-    }
-    res.XsrfToken = module.exports.generateXsrfToken(req)
-    next()
-}
+module.exports.useXSRF = (req, res, next) => {}
 
 // Rutas: Control de acceso

[Timeout] ConditionalExpression
src/seguridad.js:163:9
 }
 // Middleware: Cookie-to-Header Token
 module.exports.useXSRF = (req, res, next) => {
-    if (!req.cookies['XSRF-TOKEN'])
+    if (false)
         generateXsrfCookie(req, res)
     if ('POST|PUT|DELETE|PATCH'.includes(req.method.toUpperCase()) && isInvalidXsrfToken(req)) {

[Timeout] BooleanLiteral
src/seguridad.js:163:9
 }
 // Middleware: Cookie-to-Header Token
 module.exports.useXSRF = (req, res, next) => {
-    if (!req.cookies['XSRF-TOKEN'])
+    if (req.cookies['XSRF-TOKEN'])
         generateXsrfCookie(req, res)
     if ('POST|PUT|DELETE|PATCH'.includes(req.method.toUpperCase()) && isInvalidXsrfToken(req)) {

[Timeout] LogicalOperator
src/seguridad.js:165:9
 module.exports.useXSRF = (req, res, next) => {
     if (!req.cookies['XSRF-TOKEN'])
         generateXsrfCookie(req, res)
-    if ('POST|PUT|DELETE|PATCH'.includes(req.method.toUpperCase()) && isInvalidXsrfToken(req)) {
+    if ('POST|PUT|DELETE|PATCH'.includes(req.method.toUpperCase()) || isInvalidXsrfToken(req)) {
         if (req.cookies['XSRF-TOKEN'] !== module.exports.generateXsrfToken(req))
             generateXsrfCookie(req, res)

[Timeout] ConditionalExpression
src/seguridad.js:165:9
 module.exports.useXSRF = (req, res, next) => {
     if (!req.cookies['XSRF-TOKEN'])
         generateXsrfCookie(req, res)
-    if ('POST|PUT|DELETE|PATCH'.includes(req.method.toUpperCase()) && isInvalidXsrfToken(req)) {
+    if (true) {
         if (req.cookies['XSRF-TOKEN'] !== module.exports.generateXsrfToken(req))
             generateXsrfCookie(req, res)

[Timeout] EqualityOperator
src/seguridad.js:166:13
     if (!req.cookies['XSRF-TOKEN'])
         generateXsrfCookie(req, res)
     if ('POST|PUT|DELETE|PATCH'.includes(req.method.toUpperCase()) && isInvalidXsrfToken(req)) {
-        if (req.cookies['XSRF-TOKEN'] !== module.exports.generateXsrfToken(req))
+        if (req.cookies['XSRF-TOKEN'] === module.exports.generateXsrfToken(req))
             generateXsrfCookie(req, res)
         return next(generateError(req, 'Invalid XSRF-TOKEN', 401))

[Timeout] ConditionalExpression
src/seguridad.js:166:13
     if (!req.cookies['XSRF-TOKEN'])
         generateXsrfCookie(req, res)
     if ('POST|PUT|DELETE|PATCH'.includes(req.method.toUpperCase()) && isInvalidXsrfToken(req)) {
-        if (req.cookies['XSRF-TOKEN'] !== module.exports.generateXsrfToken(req))
+        if (true)
             generateXsrfCookie(req, res)
         return next(generateError(req, 'Invalid XSRF-TOKEN', 401))

[Timeout] StringLiteral
src/seguridad.js:168:40
     if ('POST|PUT|DELETE|PATCH'.includes(req.method.toUpperCase()) && isInvalidXsrfToken(req)) {
         if (req.cookies['XSRF-TOKEN'] !== module.exports.generateXsrfToken(req))
             generateXsrfCookie(req, res)
-        return next(generateError(req, 'Invalid XSRF-TOKEN', 401))
+        return next(generateError(req, "", 401))
     }
     res.XsrfToken = module.exports.generateXsrfToken(req)

[Timeout] BlockStatement
src/seguridad.js:239:47
  *       "200":
  *         description: "OK"
  */
-router.options('/login', function (_req, res) {
-    res.sendStatus(200)
-})
+router.options('/login', function (_req, res) {})
 /**
  * @swagger

[Timeout] OptionalChaining
src/seguridad.js:280:33
  *         $ref: "#/components/responses/BadRequest"
  */
 router.post('/login', function (req, res, next) {
-    if (!req.body?.username || !req.body?.password) {
+    if (!req.body?.username || !req.body.password) {
         // setTimeout(() => next(generateErrorByStatus(req, 400)), 1000)
         return next(generateErrorByStatus(req, 400))

[Timeout] ConditionalExpression
src/seguridad.js:280:9
  *         $ref: "#/components/responses/BadRequest"
  */
 router.post('/login', function (req, res, next) {
-    if (!req.body?.username || !req.body?.password) {
+    if (true) {
         // setTimeout(() => next(generateErrorByStatus(req, 400)), 1000)
         return next(generateErrorByStatus(req, 400))
