[Timeout] BlockStatement
src/seguridad.js:286:54
     }
     let usr = req.body.username
     let pwd = req.body.password
-    if (!config.security.PASSWORD_PATTERN.test(pwd)) {
-        // setTimeout(() => next(generateErrorByStatus(req, 400)), 1000)
-        return next(generateErrorByStatus(req, 400))
-    }
+    if (!config.security.PASSWORD_PATTERN.test(pwd)) {}
     (async () => {
         try {

[Timeout] ConditionalExpression
src/seguridad.js:286:9
     }
     let usr = req.body.username
     let pwd = req.body.password
-    if (!config.security.PASSWORD_PATTERN.test(pwd)) {
+    if (false) {
         // setTimeout(() => next(generateErrorByStatus(req, 400)), 1000)
         return next(generateErrorByStatus(req, 400))

[Timeout] BlockStatement
src/seguridad.js:290:18
         // setTimeout(() => next(generateErrorByStatus(req, 400)), 1000)
         return next(generateErrorByStatus(req, 400))
     }
-    (async () => {
-        try {
-            let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
-            let list = JSON.parse(data)
-            let element = list.find(item => item[config.security.PROP_USERNAME] == usr && item.activo)
-            if (element && await bcrypt.compare(pwd, element[config.security.PROP_PASSWORD])) {
-                sendLogin(req, res, element)
-            } else {
-                res.status(200).json({ success: false })
-            }
-        } catch (error) {
-            res.status(500).json(generateError(req, error.message, 500).payload)
-        }
-    })()
+    (async () => {})()
 })
 

[Timeout] BlockStatement
src/seguridad.js:291:13
         return next(generateErrorByStatus(req, 400))
     }
     (async () => {
-        try {
-            let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
-            let list = JSON.parse(data)
-            let element = list.find(item => item[config.security.PROP_USERNAME] == usr && item.activo)
-            if (element && await bcrypt.compare(pwd, element[config.security.PROP_PASSWORD])) {
-                sendLogin(req, res, element)
-            } else {
-                res.status(200).json({ success: false })
-            }
-        } catch (error) {
+        try {} catch (error) {
             res.status(500).json(generateError(req, error.message, 500).payload)
         }

[Timeout] ConditionalExpression
src/seguridad.js:294:45
         try {
             let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
             let list = JSON.parse(data)
-            let element = list.find(item => item[config.security.PROP_USERNAME] == usr && item.activo)
+            let element = list.find(item => false)
             if (element && await bcrypt.compare(pwd, element[config.security.PROP_PASSWORD])) {
                 sendLogin(req, res, element)

[Timeout] ArrowFunction
src/seguridad.js:294:37
         try {
             let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
             let list = JSON.parse(data)
-            let element = list.find(item => item[config.security.PROP_USERNAME] == usr && item.activo)
+            let element = list.find(() => undefined)
             if (element && await bcrypt.compare(pwd, element[config.security.PROP_PASSWORD])) {
                 sendLogin(req, res, element)

[Timeout] ConditionalExpression
src/seguridad.js:295:17
             let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
             let list = JSON.parse(data)
             let element = list.find(item => item[config.security.PROP_USERNAME] == usr && item.activo)
-            if (element && await bcrypt.compare(pwd, element[config.security.PROP_PASSWORD])) {
+            if (false) {
                 sendLogin(req, res, element)
             } else {

[Timeout] LogicalOperator
src/seguridad.js:295:17
             let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
             let list = JSON.parse(data)
             let element = list.find(item => item[config.security.PROP_USERNAME] == usr && item.activo)
-            if (element && await bcrypt.compare(pwd, element[config.security.PROP_PASSWORD])) {
+            if (element || (await bcrypt.compare(pwd, element[config.security.PROP_PASSWORD]))) {
                 sendLogin(req, res, element)
             } else {

[Timeout] BlockStatement
src/seguridad.js:297:20
             let element = list.find(item => item[config.security.PROP_USERNAME] == usr && item.activo)
             if (element && await bcrypt.compare(pwd, element[config.security.PROP_PASSWORD])) {
                 sendLogin(req, res, element)
-            } else {
-                res.status(200).json({ success: false })
-            }
+            } else {}
         } catch (error) {
             res.status(500).json(generateError(req, error.message, 500).payload)

[Timeout] BooleanLiteral
src/seguridad.js:298:49
             if (element && await bcrypt.compare(pwd, element[config.security.PROP_PASSWORD])) {
                 sendLogin(req, res, element)
             } else {
-                res.status(200).json({ success: false })
+                res.status(200).json({ success: true })
             }
         } catch (error) {

[NoCoverage] BlockStatement
src/seguridad.js:300:25
             } else {
                 res.status(200).json({ success: false })
             }
-        } catch (error) {
-            res.status(500).json(generateError(req, error.message, 500).payload)
-        }
+        } catch (error) {}
     })()
 })

[Killed] BlockStatement
src/seguridad.js:343:27
  *         $ref: "#/components/responses/Forbidden"
  */
 router.post('/login/refresh', function (req, res, next) {
-    if (!req.body?.token) {
-        return next(generateErrorByStatus(req, 400))
-    }
+    if (!req.body?.token) {}
     (async () => {
         try {
killedBy: Seguridad Pruebas con ficheros simulados /login/refresh KO POST: sin token
statusReason: Error: expected 400 "Bad Request", got 403 "Forbidden"

[Timeout] ConditionalExpression
src/seguridad.js:343:9
  *         $ref: "#/components/responses/Forbidden"
  */
 router.post('/login/refresh', function (req, res, next) {
-    if (!req.body?.token) {
+    if (false) {
         return next(generateErrorByStatus(req, 400))
     }

[Timeout] BlockStatement
src/seguridad.js:347:13
         return next(generateErrorByStatus(req, 400))
     }
     (async () => {
-        try {
-            let decoded = RefreshTokenHMAC256.decode(req.body.token);
-            let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
-            let list = JSON.parse(data)
-            let element = list.find(item => item[config.security.PROP_USERNAME] == decoded.usr && item.activo)
-            if (element) {
-                sendLogin(req, res, element)
-            } else {
-                res.status(200).json({ success: false })
-            }
-        } catch (err) {
+        try {} catch (err) {
             let rslt;
             switch (err.name) {

[NoCoverage] StringLiteral
src/seguridad.js:349:72
     (async () => {
         try {
             let decoded = RefreshTokenHMAC256.decode(req.body.token);
-            let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
+            let data = await fs.readFile(config.security.USR_FILENAME, "")
             let list = JSON.parse(data)
             let element = list.find(item => item[config.security.PROP_USERNAME] == decoded.usr && item.activo)

[NoCoverage] EqualityOperator
src/seguridad.js:351:45
             let decoded = RefreshTokenHMAC256.decode(req.body.token);
             let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
             let list = JSON.parse(data)
-            let element = list.find(item => item[config.security.PROP_USERNAME] == decoded.usr && item.activo)
+            let element = list.find(item => item[config.security.PROP_USERNAME] != decoded.usr && item.activo)
             if (element) {
                 sendLogin(req, res, element)

[NoCoverage] ConditionalExpression
src/seguridad.js:351:45
             let decoded = RefreshTokenHMAC256.decode(req.body.token);
             let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
             let list = JSON.parse(data)
-            let element = list.find(item => item[config.security.PROP_USERNAME] == decoded.usr && item.activo)
+            let element = list.find(item => false)
             if (element) {
                 sendLogin(req, res, element)

[NoCoverage] ConditionalExpression
src/seguridad.js:352:17
             let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
             let list = JSON.parse(data)
             let element = list.find(item => item[config.security.PROP_USERNAME] == decoded.usr && item.activo)
-            if (element) {
+            if (true) {
                 sendLogin(req, res, element)
             } else {

[NoCoverage] ConditionalExpression
src/seguridad.js:352:17
             let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
             let list = JSON.parse(data)
             let element = list.find(item => item[config.security.PROP_USERNAME] == decoded.usr && item.activo)
-            if (element) {
+            if (false) {
                 sendLogin(req, res, element)
             } else {

[Timeout] BlockStatement
src/seguridad.js:357:23
             } else {
                 res.status(200).json({ success: false })
             }
-        } catch (err) {
-            let rslt;
-            switch (err.name) {
-                case 'TokenExpiredError':
-                    res.set('WWW-Authenticate', 'Bearer realm="MicroserviciosJWT", error="invalid_token", error_description="The access token expired"')
-                    rslt = generateError(req, `Invalid token: token expired`, 403, [{ expiredAt: err.expiredAt }])
-                    break;
-                case 'NotBeforeError':
-                    rslt = generateError(req, `Invalid token: token not active`, 403, [{ notBefore: err.date }])
-                    break;
-                default:
-                    rslt = generateError(req, 'Invalid token', 403)
-                    break;
-
-            }
-            res.status(403).json(rslt.payload)
-        }
+        } catch (err) {}
     })()
 })

[Timeout] ConditionalExpression
src/seguridad.js:360:17
         } catch (err) {
             let rslt;
             switch (err.name) {
-                case 'TokenExpiredError':
-                    res.set('WWW-Authenticate', 'Bearer realm="MicroserviciosJWT", error="invalid_token", error_description="The access token expired"')
-                    rslt = generateError(req, `Invalid token: token expired`, 403, [{ expiredAt: err.expiredAt }])
-                    break;
+                case 'TokenExpiredError':
                 case 'NotBeforeError':
                     rslt = generateError(req, `Invalid token: token not active`, 403, [{ notBefore: err.date }])

[Survived] StringLiteral
src/seguridad.js:361:49
             let rslt;
             switch (err.name) {
                 case 'TokenExpiredError':
-                    res.set('WWW-Authenticate', 'Bearer realm="MicroserviciosJWT", error="invalid_token", error_description="The access token expired"')
+                    res.set('WWW-Authenticate', "")
                     rslt = generateError(req, `Invalid token: token expired`, 403, [{ expiredAt: err.expiredAt }])
                     break;

[Timeout] ObjectLiteral
src/seguridad.js:362:85
             switch (err.name) {
                 case 'TokenExpiredError':
                     res.set('WWW-Authenticate', 'Bearer realm="MicroserviciosJWT", error="invalid_token", error_description="The access token expired"')
-                    rslt = generateError(req, `Invalid token: token expired`, 403, [{ expiredAt: err.expiredAt }])
+                    rslt = generateError(req, `Invalid token: token expired`, 403, [{}])
                     break;
                 case 'NotBeforeError':

[Timeout] StringLiteral
src/seguridad.js:362:47
             switch (err.name) {
                 case 'TokenExpiredError':
                     res.set('WWW-Authenticate', 'Bearer realm="MicroserviciosJWT", error="invalid_token", error_description="The access token expired"')
-                    rslt = generateError(req, `Invalid token: token expired`, 403, [{ expiredAt: err.expiredAt }])
+                    rslt = generateError(req, ``, 403, [{ expiredAt: err.expiredAt }])
                     break;
                 case 'NotBeforeError':

[NoCoverage] ConditionalExpression
src/seguridad.js:364:17
                     res.set('WWW-Authenticate', 'Bearer realm="MicroserviciosJWT", error="invalid_token", error_description="The access token expired"')
                     rslt = generateError(req, `Invalid token: token expired`, 403, [{ expiredAt: err.expiredAt }])
                     break;
-                case 'NotBeforeError':
-                    rslt = generateError(req, `Invalid token: token not active`, 403, [{ notBefore: err.date }])
-                    break;
+                case 'NotBeforeError':
                 default:
                     rslt = generateError(req, 'Invalid token', 403)

[NoCoverage] StringLiteral
src/seguridad.js:364:22
                     res.set('WWW-Authenticate', 'Bearer realm="MicroserviciosJWT", error="invalid_token", error_description="The access token expired"')
                     rslt = generateError(req, `Invalid token: token expired`, 403, [{ expiredAt: err.expiredAt }])
                     break;
-                case 'NotBeforeError':
+                case "":
                     rslt = generateError(req, `Invalid token: token not active`, 403, [{ notBefore: err.date }])
                     break;

[NoCoverage] ConditionalExpression
src/seguridad.js:367:17
                 case 'NotBeforeError':
                     rslt = generateError(req, `Invalid token: token not active`, 403, [{ notBefore: err.date }])
                     break;
-                default:
-                    rslt = generateError(req, 'Invalid token', 403)
-                    break;
+                default:
 
             }

[Timeout] BlockStatement
src/seguridad.js:391:53
  *             schema:
  *               type: string
  */
-router.get('/login/signature', function (_req, res) {
-    res.contentType('text/plain').send(config.security.PUBLIC_KEY)
-})
+router.get('/login/signature', function (_req, res) {})
 
 function sendLogin(req, res, element) {

[Timeout] BlockStatement
src/seguridad.js:395:39
     res.contentType('text/plain').send(config.security.PUBLIC_KEY)
 })
 
-function sendLogin(req, res, element) {
-    let token = module.exports.generarTokenScheme(element)
-    let payload = {
-        success: true,
-        token: module.exports.generarTokenScheme(element),
-        refresh: RefreshTokenHMAC256.generar(element),
-        name: element.nombre || element[config.security.PROP_NAME],
-        roles: element.roles,
-        expires_in: config.security.EXPIRACION_MIN * 60
-    }
-    if (req.query.cookie)
-        res.cookie('Authorization', token.substring(config.security.AUTHENTICATION_SCHEME.length), { maxAge: 3600000 })
-    res.status(200).json(payload)
-
-}
+function sendLogin(req, res, element) {}
 
 /**

[Timeout] BooleanLiteral
src/seguridad.js:398:18
 function sendLogin(req, res, element) {
     let token = module.exports.generarTokenScheme(element)
     let payload = {
-        success: true,
+        success: false,
         token: module.exports.generarTokenScheme(element),
         refresh: RefreshTokenHMAC256.generar(element),

[Timeout] LogicalOperator
src/seguridad.js:401:15
         success: true,
         token: module.exports.generarTokenScheme(element),
         refresh: RefreshTokenHMAC256.generar(element),
-        name: element.nombre || element[config.security.PROP_NAME],
+        name: element.nombre && element[config.security.PROP_NAME],
         roles: element.roles,
         expires_in: config.security.EXPIRACION_MIN * 60

[Timeout] ConditionalExpression
src/seguridad.js:401:15
         success: true,
         token: module.exports.generarTokenScheme(element),
         refresh: RefreshTokenHMAC256.generar(element),
-        name: element.nombre || element[config.security.PROP_NAME],
+        name: false,
         roles: element.roles,
         expires_in: config.security.EXPIRACION_MIN * 60

[Timeout] ArithmeticOperator
src/seguridad.js:403:21
         refresh: RefreshTokenHMAC256.generar(element),
         name: element.nombre || element[config.security.PROP_NAME],
         roles: element.roles,
-        expires_in: config.security.EXPIRACION_MIN * 60
+        expires_in: config.security.EXPIRACION_MIN / 60
     }
     if (req.query.cookie)

[Timeout] ConditionalExpression
src/seguridad.js:405:9
         roles: element.roles,
         expires_in: config.security.EXPIRACION_MIN * 60
     }
-    if (req.query.cookie)
+    if (false)
         res.cookie('Authorization', token.substring(config.security.AUTHENTICATION_SCHEME.length), { maxAge: 3600000 })
     res.status(200).json(payload)

[Timeout] ConditionalExpression
src/seguridad.js:405:9
         roles: element.roles,
         expires_in: config.security.EXPIRACION_MIN * 60
     }
-    if (req.query.cookie)
+    if (true)
         res.cookie('Authorization', token.substring(config.security.AUTHENTICATION_SCHEME.length), { maxAge: 3600000 })
     res.status(200).json(payload)

[Timeout] MethodExpression
src/seguridad.js:406:37
         expires_in: config.security.EXPIRACION_MIN * 60
     }
     if (req.query.cookie)
-        res.cookie('Authorization', token.substring(config.security.AUTHENTICATION_SCHEME.length), { maxAge: 3600000 })
+        res.cookie('Authorization', token, { maxAge: 3600000 })
     res.status(200).json(payload)
 

[Timeout] StringLiteral
src/seguridad.js:406:20
         expires_in: config.security.EXPIRACION_MIN * 60
     }
     if (req.query.cookie)
-        res.cookie('Authorization', token.substring(config.security.AUTHENTICATION_SCHEME.length), { maxAge: 3600000 })
+        res.cookie("", token.substring(config.security.AUTHENTICATION_SCHEME.length), { maxAge: 3600000 })
     res.status(200).json(payload)
 

[Timeout] BlockStatement
src/seguridad.js:422:44
  *       "200":
  *         description: "OK"
  */
-router.all('/logout', function (_req, res) {
-    res.clearCookie('Authorization');
-    res.sendStatus(200)
-})
+router.all('/logout', function (_req, res) {})
 /**
  * @swagger

[Killed] StringLiteral
src/seguridad.js:422:12
  *       "200":
  *         description: "OK"
  */
-router.all('/logout', function (_req, res) {
+router.all("", function (_req, res) {
     res.clearCookie('Authorization');
     res.sendStatus(200)
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] StringLiteral
src/seguridad.js:472:13
  *       "400":
  *         $ref: "#/components/responses/BadRequest"
  */
-router.post('/register', function (req, res, next) {
+router.post("", function (req, res, next) {
     (async () => {
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')

[Timeout] ConditionalExpression
src/seguridad.js:477:13
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
         let element = req.body
-        if (element[config.security.PROP_USERNAME] == undefined) {
+        if (false) {
             return next(generateError(req, 'Falta el nombre de usuario.', 400))
         } else if (list.find(item => item[config.security.PROP_USERNAME] == element[config.security.PROP_USERNAME])) {

[Timeout] EqualityOperator
src/seguridad.js:477:13
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
         let element = req.body
-        if (element[config.security.PROP_USERNAME] == undefined) {
+        if (element[config.security.PROP_USERNAME] != undefined) {
             return next(generateError(req, 'Falta el nombre de usuario.', 400))
         } else if (list.find(item => item[config.security.PROP_USERNAME] == element[config.security.PROP_USERNAME])) {

[Timeout] EqualityOperator
src/seguridad.js:479:38
         let element = req.body
         if (element[config.security.PROP_USERNAME] == undefined) {
             return next(generateError(req, 'Falta el nombre de usuario.', 400))
-        } else if (list.find(item => item[config.security.PROP_USERNAME] == element[config.security.PROP_USERNAME])) {
+        } else if (list.find(item => item[config.security.PROP_USERNAME] != element[config.security.PROP_USERNAME])) {
             return next(generateError(req, 'El usuario ya existe.', 400))
         } else if (config.security.PASSWORD_PATTERN.test(element[config.security.PROP_PASSWORD])) {

[Timeout] ConditionalExpression
src/seguridad.js:479:38
         let element = req.body
         if (element[config.security.PROP_USERNAME] == undefined) {
             return next(generateError(req, 'Falta el nombre de usuario.', 400))
-        } else if (list.find(item => item[config.security.PROP_USERNAME] == element[config.security.PROP_USERNAME])) {
+        } else if (list.find(item => false)) {
             return next(generateError(req, 'El usuario ya existe.', 400))
         } else if (config.security.PASSWORD_PATTERN.test(element[config.security.PROP_PASSWORD])) {

[Timeout] ConditionalExpression
src/seguridad.js:481:20
             return next(generateError(req, 'Falta el nombre de usuario.', 400))
         } else if (list.find(item => item[config.security.PROP_USERNAME] == element[config.security.PROP_USERNAME])) {
             return next(generateError(req, 'El usuario ya existe.', 400))
-        } else if (config.security.PASSWORD_PATTERN.test(element[config.security.PROP_PASSWORD])) {
+        } else if (false) {
             element[config.security.PROP_PASSWORD] = await encriptaPassword(element[config.security.PROP_PASSWORD])
             element.roles = ["Usuarios"]

[Timeout] ConditionalExpression
src/seguridad.js:481:20
             return next(generateError(req, 'Falta el nombre de usuario.', 400))
         } else if (list.find(item => item[config.security.PROP_USERNAME] == element[config.security.PROP_USERNAME])) {
             return next(generateError(req, 'El usuario ya existe.', 400))
-        } else if (config.security.PASSWORD_PATTERN.test(element[config.security.PROP_PASSWORD])) {
+        } else if (true) {
             element[config.security.PROP_PASSWORD] = await encriptaPassword(element[config.security.PROP_PASSWORD])
             element.roles = ["Usuarios"]

[Timeout] StringLiteral
src/seguridad.js:483:30
             return next(generateError(req, 'El usuario ya existe.', 400))
         } else if (config.security.PASSWORD_PATTERN.test(element[config.security.PROP_PASSWORD])) {
             element[config.security.PROP_PASSWORD] = await encriptaPassword(element[config.security.PROP_PASSWORD])
-            element.roles = ["Usuarios"]
+            element.roles = [""]
             delete element.activo
             list.push(element)

[Timeout] BlockStatement
src/seguridad.js:487:29
             delete element.activo
             list.push(element)
             fs.writeFile(config.security.USR_FILENAME, JSON.stringify(list))
-                .then(() => {
-                    const token = CreatedTokenHMAC256.generar(element)
-                    const location = `${req.protocol}://${req.hostname}:${req.connection.localPort}${req.originalUrl}`
-                    res.status(202).json({
-                        statusGetUri: `${location}/status?instance=${token}`,
-                        confirmGetUri: `${location}/confirm?instance=${token}`,
-                        rejectGetUri: `${location}/reject?instance=${token}`
-                    })
-                })
+                .then(() => {})
                 .catch(err => { return next(generateErrorByError(req, err, 500)) })
         } else {

[Timeout] ObjectLiteral
src/seguridad.js:490:42
                 .then(() => {
                     const token = CreatedTokenHMAC256.generar(element)
                     const location = `${req.protocol}://${req.hostname}:${req.connection.localPort}${req.originalUrl}`
-                    res.status(202).json({
-                        statusGetUri: `${location}/status?instance=${token}`,
-                        confirmGetUri: `${location}/confirm?instance=${token}`,
-                        rejectGetUri: `${location}/reject?instance=${token}`
-                    })
+                    res.status(202).json({})
                 })
                 .catch(err => { return next(generateErrorByError(req, err, 500)) })

[NoCoverage] BlockStatement
src/seguridad.js:496:31
                         rejectGetUri: `${location}/reject?instance=${token}`
                     })
                 })
-                .catch(err => { return next(generateErrorByError(req, err, 500)) })
+                .catch(err => {})
         } else {
             return next(generateError(req, 'Formato incorrecto de la password.', 400))

[Timeout] BlockStatement
src/seguridad.js:497:16
                     })
                 })
                 .catch(err => { return next(generateErrorByError(req, err, 500)) })
-        } else {
-            return next(generateError(req, 'Formato incorrecto de la password.', 400))
-        }
+        } else {}
     })()
 })

[Timeout] StringLiteral
src/seguridad.js:498:44
                 })
                 .catch(err => { return next(generateErrorByError(req, err, 500)) })
         } else {
-            return next(generateError(req, 'Formato incorrecto de la password.', 400))
+            return next(generateError(req, "", 400))
         }
     })()

[Timeout] BlockStatement
src/seguridad.js:552:58
  *       "400":
  *         $ref: "#/components/responses/BadRequest"
  */
-router.get('/register/status', function (req, res, next) {
-    if (!req.query.instance) {
-        return next(generateError(req, 'Falta la instancia.', 400))
-    }
-    let usr;
-    try {
-        usr = CreatedTokenHMAC256.decode(req.query.instance).usr
-    } catch (ex) {
-        res.status(200).json({ status: 'canceled', result: 'timeout' }).end()
-        return
-    }
-    (async () => {
-        let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
-        let list = JSON.parse(data)
-        let element = list.find(item => item[config.security.PROP_USERNAME] == usr)
-        if (!element) {
-            res.status(200).json({ status: 'complete', result: 'reject' }).end()
-        } else if (typeof (element.activo) === 'undefined') {
-            res.status(202).json({ status: 'pending' }).end()
-        } else {
-            res.status(200).json({ status: 'complete', result: element.activo ? 'confirm' : 'reject' }).end()
-        }
-    })()
-})
+router.get('/register/status', function (req, res, next) {})
 /**
 * @swagger

[Timeout] StringLiteral
src/seguridad.js:552:12
  *       "400":
  *         $ref: "#/components/responses/BadRequest"
  */
-router.get('/register/status', function (req, res, next) {
+router.get("", function (req, res, next) {
     if (!req.query.instance) {
         return next(generateError(req, 'Falta la instancia.', 400))

[Timeout] ConditionalExpression
src/seguridad.js:553:9
  *         $ref: "#/components/responses/BadRequest"
  */
 router.get('/register/status', function (req, res, next) {
-    if (!req.query.instance) {
+    if (false) {
         return next(generateError(req, 'Falta la instancia.', 400))
     }

[Timeout] ConditionalExpression
src/seguridad.js:553:9
  *         $ref: "#/components/responses/BadRequest"
  */
 router.get('/register/status', function (req, res, next) {
-    if (!req.query.instance) {
+    if (true) {
         return next(generateError(req, 'Falta la instancia.', 400))
     }

[Timeout] BlockStatement
src/seguridad.js:557:9
         return next(generateError(req, 'Falta la instancia.', 400))
     }
     let usr;
-    try {
-        usr = CreatedTokenHMAC256.decode(req.query.instance).usr
-    } catch (ex) {
+    try {} catch (ex) {
         res.status(200).json({ status: 'canceled', result: 'timeout' }).end()
         return

[Timeout] BlockStatement
src/seguridad.js:559:18
     let usr;
     try {
         usr = CreatedTokenHMAC256.decode(req.query.instance).usr
-    } catch (ex) {
-        res.status(200).json({ status: 'canceled', result: 'timeout' }).end()
-        return
-    }
+    } catch (ex) {}
     (async () => {
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')

[Timeout] StringLiteral
src/seguridad.js:560:60
     try {
         usr = CreatedTokenHMAC256.decode(req.query.instance).usr
     } catch (ex) {
-        res.status(200).json({ status: 'canceled', result: 'timeout' }).end()
+        res.status(200).json({ status: 'canceled', result: "" }).end()
         return
     }

[Timeout] BlockStatement
src/seguridad.js:563:18
         res.status(200).json({ status: 'canceled', result: 'timeout' }).end()
         return
     }
-    (async () => {
-        let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
-        let list = JSON.parse(data)
-        let element = list.find(item => item[config.security.PROP_USERNAME] == usr)
-        if (!element) {
-            res.status(200).json({ status: 'complete', result: 'reject' }).end()
-        } else if (typeof (element.activo) === 'undefined') {
-            res.status(202).json({ status: 'pending' }).end()
-        } else {
-            res.status(200).json({ status: 'complete', result: element.activo ? 'confirm' : 'reject' }).end()
-        }
-    })()
+    (async () => {})()
 })
 /**
