[Timeout] ConditionalExpression
src/seguridad.js:566:41
     (async () => {
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
-        let element = list.find(item => item[config.security.PROP_USERNAME] == usr)
+        let element = list.find(item => false)
         if (!element) {
             res.status(200).json({ status: 'complete', result: 'reject' }).end()

[Timeout] ConditionalExpression
src/seguridad.js:566:41
     (async () => {
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
-        let element = list.find(item => item[config.security.PROP_USERNAME] == usr)
+        let element = list.find(item => true)
         if (!element) {
             res.status(200).json({ status: 'complete', result: 'reject' }).end()

[Timeout] BlockStatement
src/seguridad.js:567:23
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
         let element = list.find(item => item[config.security.PROP_USERNAME] == usr)
-        if (!element) {
-            res.status(200).json({ status: 'complete', result: 'reject' }).end()
-        } else if (typeof (element.activo) === 'undefined') {
+        if (!element) {} else if (typeof (element.activo) === 'undefined') {
             res.status(202).json({ status: 'pending' }).end()
         } else {

[Timeout] BooleanLiteral
src/seguridad.js:567:13
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
         let element = list.find(item => item[config.security.PROP_USERNAME] == usr)
-        if (!element) {
+        if (element) {
             res.status(200).json({ status: 'complete', result: 'reject' }).end()
         } else if (typeof (element.activo) === 'undefined') {

[Timeout] StringLiteral
src/seguridad.js:568:64
         let list = JSON.parse(data)
         let element = list.find(item => item[config.security.PROP_USERNAME] == usr)
         if (!element) {
-            res.status(200).json({ status: 'complete', result: 'reject' }).end()
+            res.status(200).json({ status: 'complete', result: "" }).end()
         } else if (typeof (element.activo) === 'undefined') {
             res.status(202).json({ status: 'pending' }).end()

[Timeout] EqualityOperator
src/seguridad.js:569:20
         let element = list.find(item => item[config.security.PROP_USERNAME] == usr)
         if (!element) {
             res.status(200).json({ status: 'complete', result: 'reject' }).end()
-        } else if (typeof (element.activo) === 'undefined') {
+        } else if (typeof element.activo !== 'undefined') {
             res.status(202).json({ status: 'pending' }).end()
         } else {

[Timeout] BlockStatement
src/seguridad.js:569:61
         let element = list.find(item => item[config.security.PROP_USERNAME] == usr)
         if (!element) {
             res.status(200).json({ status: 'complete', result: 'reject' }).end()
-        } else if (typeof (element.activo) === 'undefined') {
-            res.status(202).json({ status: 'pending' }).end()
-        } else {
+        } else if (typeof (element.activo) === 'undefined') {} else {
             res.status(200).json({ status: 'complete', result: element.activo ? 'confirm' : 'reject' }).end()
         }

[Timeout] BlockStatement
src/seguridad.js:571:16
             res.status(200).json({ status: 'complete', result: 'reject' }).end()
         } else if (typeof (element.activo) === 'undefined') {
             res.status(202).json({ status: 'pending' }).end()
-        } else {
-            res.status(200).json({ status: 'complete', result: element.activo ? 'confirm' : 'reject' }).end()
-        }
+        } else {}
     })()
 })

[Timeout] StringLiteral
src/seguridad.js:572:44
         } else if (typeof (element.activo) === 'undefined') {
             res.status(202).json({ status: 'pending' }).end()
         } else {
-            res.status(200).json({ status: 'complete', result: element.activo ? 'confirm' : 'reject' }).end()
+            res.status(200).json({ status: "", result: element.activo ? 'confirm' : 'reject' }).end()
         }
     })()

[Timeout] ConditionalExpression
src/seguridad.js:595:9
 *       "404": { "$ref": "#/components/responses/NotFound" }
 */
 router.get('/register/confirm', function (req, res, next) {
-    if (!req.query.instance) {
+    if (true) {
         return next(generateError(req, 'Falta la instancia.', 400))
     }

[NoCoverage] BlockStatement
src/seguridad.js:595:30
 *       "404": { "$ref": "#/components/responses/NotFound" }
 */
 router.get('/register/confirm', function (req, res, next) {
-    if (!req.query.instance) {
-        return next(generateError(req, 'Falta la instancia.', 400))
-    }
+    if (!req.query.instance) {}
     let usr;
     try {

[NoCoverage] StringLiteral
src/seguridad.js:596:40
 */
 router.get('/register/confirm', function (req, res, next) {
     if (!req.query.instance) {
-        return next(generateError(req, 'Falta la instancia.', 400))
+        return next(generateError(req, "", 400))
     }
     let usr;

[Timeout] BlockStatement
src/seguridad.js:601:18
     let usr;
     try {
         usr = CreatedTokenHMAC256.decode(req.query.instance).usr
-    } catch (ex) {
-        return next(generateError(req, 'Ya no existe la instancia.', 400))
-    }
+    } catch (ex) {}
     (async () => {
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')

[Timeout] StringLiteral
src/seguridad.js:602:40
     try {
         usr = CreatedTokenHMAC256.decode(req.query.instance).usr
     } catch (ex) {
-        return next(generateError(req, 'Ya no existe la instancia.', 400))
+        return next(generateError(req, "", 400))
     }
     (async () => {

[Timeout] BlockStatement
src/seguridad.js:604:18
     } catch (ex) {
         return next(generateError(req, 'Ya no existe la instancia.', 400))
     }
-    (async () => {
-        let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
-        let list = JSON.parse(data)
-        let index = list.findIndex(row => row[config.security.PROP_USERNAME] == usr)
-        if (index == -1) {
-            return next(generateErrorByStatus(req, 404))
-        }
-        let element = list.find(item => item[config.security.PROP_USERNAME] == usr)
-        if (!element.activo) {
-            element.activo = true
-            fs.writeFile(config.security.USR_FILENAME, JSON.stringify(list))
-                .then(() => { res.sendStatus(204) })
-                .catch(err => { return next(generateErrorByError(req, err, 500)) })
-        }
-        res.sendStatus(204)
-    })()
+    (async () => {})()
 })
 /**

[Timeout] ConditionalExpression
src/seguridad.js:607:43
     (async () => {
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
-        let index = list.findIndex(row => row[config.security.PROP_USERNAME] == usr)
+        let index = list.findIndex(row => true)
         if (index == -1) {
             return next(generateErrorByStatus(req, 404))

[Timeout] ConditionalExpression
src/seguridad.js:607:43
     (async () => {
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
-        let index = list.findIndex(row => row[config.security.PROP_USERNAME] == usr)
+        let index = list.findIndex(row => false)
         if (index == -1) {
             return next(generateErrorByStatus(req, 404))

[Timeout] UnaryOperator
src/seguridad.js:608:22
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
         let index = list.findIndex(row => row[config.security.PROP_USERNAME] == usr)
-        if (index == -1) {
+        if (index == +1) {
             return next(generateErrorByStatus(req, 404))
         }

[Timeout] ConditionalExpression
src/seguridad.js:608:13
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
         let index = list.findIndex(row => row[config.security.PROP_USERNAME] == usr)
-        if (index == -1) {
+        if (true) {
             return next(generateErrorByStatus(req, 404))
         }

[Killed] ConditionalExpression
src/seguridad.js:611:41
         if (index == -1) {
             return next(generateErrorByStatus(req, 404))
         }
-        let element = list.find(item => item[config.security.PROP_USERNAME] == usr)
+        let element = list.find(item => true)
         if (!element.activo) {
             element.activo = true
killedBy: Seguridad Pruebas con ficheros simulados /register OK /register/confirm status: pending
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] EqualityOperator
src/seguridad.js:611:41
         if (index == -1) {
             return next(generateErrorByStatus(req, 404))
         }
-        let element = list.find(item => item[config.security.PROP_USERNAME] == usr)
+        let element = list.find(item => item[config.security.PROP_USERNAME] != usr)
         if (!element.activo) {
             element.activo = true
killedBy: Seguridad Pruebas con ficheros simulados /register OK /register/confirm status: pending
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Timeout] BlockStatement
src/seguridad.js:612:30
             return next(generateErrorByStatus(req, 404))
         }
         let element = list.find(item => item[config.security.PROP_USERNAME] == usr)
-        if (!element.activo) {
-            element.activo = true
-            fs.writeFile(config.security.USR_FILENAME, JSON.stringify(list))
-                .then(() => { res.sendStatus(204) })
-                .catch(err => { return next(generateErrorByError(req, err, 500)) })
-        }
+        if (!element.activo) {}
         res.sendStatus(204)
     })()

[Timeout] ConditionalExpression
src/seguridad.js:612:13
             return next(generateErrorByStatus(req, 404))
         }
         let element = list.find(item => item[config.security.PROP_USERNAME] == usr)
-        if (!element.activo) {
+        if (false) {
             element.activo = true
             fs.writeFile(config.security.USR_FILENAME, JSON.stringify(list))

[Killed] BooleanLiteral
src/seguridad.js:613:30
         }
         let element = list.find(item => item[config.security.PROP_USERNAME] == usr)
         if (!element.activo) {
-            element.activo = true
+            element.activo = false
             fs.writeFile(config.security.USR_FILENAME, JSON.stringify(list))
                 .then(() => { res.sendStatus(204) })
killedBy: Seguridad Pruebas con ficheros simulados /register OK /register/confirm status: pending
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Timeout] BlockStatement
src/seguridad.js:615:29
         if (!element.activo) {
             element.activo = true
             fs.writeFile(config.security.USR_FILENAME, JSON.stringify(list))
-                .then(() => { res.sendStatus(204) })
+                .then(() => {})
                 .catch(err => { return next(generateErrorByError(req, err, 500)) })
         }

[Timeout] BlockStatement
src/seguridad.js:616:31
             element.activo = true
             fs.writeFile(config.security.USR_FILENAME, JSON.stringify(list))
                 .then(() => { res.sendStatus(204) })
-                .catch(err => { return next(generateErrorByError(req, err, 500)) })
+                .catch(err => {})
         }
         res.sendStatus(204)

[Killed] ConditionalExpression
src/seguridad.js:640:9
 *       "404": { "$ref": "#/components/responses/NotFound" }
 */
 router.get('/register/reject', function (req, res, next) {
-    if (!req.query.instance) {
+    if (true) {
         return next(generateError(req, 'Falta la instancia.', 400))
     }
killedBy: Seguridad Pruebas con ficheros simulados /register OK /register/reject status: pending
statusReason: Error: expected 204 "No Content", got 400 "Bad Request"

[Killed] BooleanLiteral
src/seguridad.js:640:9
 *       "404": { "$ref": "#/components/responses/NotFound" }
 */
 router.get('/register/reject', function (req, res, next) {
-    if (!req.query.instance) {
+    if (req.query.instance) {
         return next(generateError(req, 'Falta la instancia.', 400))
     }
killedBy: Seguridad Pruebas con ficheros simulados /register OK /register/reject status: pending
statusReason: Error: expected 204 "No Content", got 400 "Bad Request"

[Timeout] BlockStatement
src/seguridad.js:649:18
     } catch (ex) {
         return next(generateError(req, 'Ya no existe la instancia.', 400))
     }
-    (async () => {
-        let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
-        let list = JSON.parse(data)
-        let index = list.findIndex(row => row[config.security.PROP_USERNAME] == usr)
-        if (index == -1) {
-            return next(generateErrorByStatus(req, 404))
-        }
-        if (list[index].activo) {
-            return next(generateError(req, 'Ya esta confirmado.', 400))
-        }
-        list.splice(index, 1)
-        fs.writeFile(config.security.USR_FILENAME, JSON.stringify(list))
-            .then(() => { res.sendStatus(204) })
-            .catch(err => { return next(generateErrorByError(req, err, 500)) })
-    })()
+    (async () => {})()
 })
 

[Timeout] StringLiteral
src/seguridad.js:650:68
         return next(generateError(req, 'Ya no existe la instancia.', 400))
     }
     (async () => {
-        let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
+        let data = await fs.readFile(config.security.USR_FILENAME, "")
         let list = JSON.parse(data)
         let index = list.findIndex(row => row[config.security.PROP_USERNAME] == usr)

[Killed] ArrowFunction
src/seguridad.js:652:36
     (async () => {
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
-        let index = list.findIndex(row => row[config.security.PROP_USERNAME] == usr)
+        let index = list.findIndex(() => undefined)
         if (index == -1) {
             return next(generateErrorByStatus(req, 404))
killedBy: Seguridad Pruebas con ficheros simulados /register OK /register/reject status: pending
statusReason: Error: expected 204 "No Content", got 404 "Not Found"

[Timeout] BlockStatement
src/seguridad.js:653:26
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
         let index = list.findIndex(row => row[config.security.PROP_USERNAME] == usr)
-        if (index == -1) {
-            return next(generateErrorByStatus(req, 404))
-        }
+        if (index == -1) {}
         if (list[index].activo) {
             return next(generateError(req, 'Ya esta confirmado.', 400))

[Timeout] EqualityOperator
src/seguridad.js:653:13
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
         let index = list.findIndex(row => row[config.security.PROP_USERNAME] == usr)
-        if (index == -1) {
+        if (index != -1) {
             return next(generateErrorByStatus(req, 404))
         }

[Timeout] ConditionalExpression
src/seguridad.js:656:13
         if (index == -1) {
             return next(generateErrorByStatus(req, 404))
         }
-        if (list[index].activo) {
+        if (true) {
             return next(generateError(req, 'Ya esta confirmado.', 400))
         }

[Timeout] BlockStatement
src/seguridad.js:656:33
         if (index == -1) {
             return next(generateErrorByStatus(req, 404))
         }
-        if (list[index].activo) {
-            return next(generateError(req, 'Ya esta confirmado.', 400))
-        }
+        if (list[index].activo) {}
         list.splice(index, 1)
         fs.writeFile(config.security.USR_FILENAME, JSON.stringify(list))

[Timeout] StringLiteral
src/seguridad.js:657:44
             return next(generateErrorByStatus(req, 404))
         }
         if (list[index].activo) {
-            return next(generateError(req, 'Ya esta confirmado.', 400))
+            return next(generateError(req, "", 400))
         }
         list.splice(index, 1)

[Timeout] BlockStatement
src/seguridad.js:697:44
  *                  items:
  *                    type: string
  */
-autenticados.get('/', function (_req, res) {
-    res.status(200).json({ isAuthenticated: res.locals.isAuthenticated, usr: res.locals.usr, name: res.locals.name, roles: res.locals.roles })
-})
+autenticados.get('/', function (_req, res) {})
 router.use('/auth', autenticados)
 

[Timeout] ObjectLiteral
src/seguridad.js:698:26
  *                    type: string
  */
 autenticados.get('/', function (_req, res) {
-    res.status(200).json({ isAuthenticated: res.locals.isAuthenticated, usr: res.locals.usr, name: res.locals.name, roles: res.locals.roles })
+    res.status(200).json({})
 })
 router.use('/auth', autenticados)

[Timeout] BlockStatement
src/seguridad.js:737:49
  *       "401":
  *         $ref: "#/components/responses/Unauthorized"
  */
-autenticados.get('/', function (req, res, next) {
-    let usr = res.locals.usr;
-    (async () => {
-        let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
-        let list = JSON.parse(data)
-        let element = list.find(item => item[config.security.PROP_USERNAME] == usr)
-        if (element) {
-            delete element[config.security.PROP_PASSWORD]
-            res.status(200).json(element)
-        } else {
-            return next(generateErrorByStatus(req, 401))
-        }
-    })()
-})
+autenticados.get('/', function (req, res, next) {})
 /**
  * @swagger

[Killed] StringLiteral
src/seguridad.js:737:18
  *       "401":
  *         $ref: "#/components/responses/Unauthorized"
  */
-autenticados.get('/', function (req, res, next) {
+autenticados.get("", function (req, res, next) {
     let usr = res.locals.usr;
     (async () => {
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] BlockStatement
src/seguridad.js:739:18
  */
 autenticados.get('/', function (req, res, next) {
     let usr = res.locals.usr;
-    (async () => {
-        let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
-        let list = JSON.parse(data)
-        let element = list.find(item => item[config.security.PROP_USERNAME] == usr)
-        if (element) {
-            delete element[config.security.PROP_PASSWORD]
-            res.status(200).json(element)
-        } else {
-            return next(generateErrorByStatus(req, 401))
-        }
-    })()
+    (async () => {})()
 })
 /**

[Killed] ArrowFunction
src/seguridad.js:742:33
     (async () => {
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
-        let element = list.find(item => item[config.security.PROP_USERNAME] == usr)
+        let element = list.find(() => undefined)
         if (element) {
             delete element[config.security.PROP_PASSWORD]
killedBy: Seguridad Pruebas con ficheros simulados /login OK Autenticación por cookies
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Killed] ConditionalExpression
src/seguridad.js:743:13
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
         let element = list.find(item => item[config.security.PROP_USERNAME] == usr)
-        if (element) {
+        if (false) {
             delete element[config.security.PROP_PASSWORD]
             res.status(200).json(element)
killedBy: Seguridad Pruebas con ficheros simulados /login OK Autenticación por cookies
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 401

[Timeout] ConditionalExpression
src/seguridad.js:743:13
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
         let element = list.find(item => item[config.security.PROP_USERNAME] == usr)
-        if (element) {
+        if (true) {
             delete element[config.security.PROP_PASSWORD]
             res.status(200).json(element)

[Timeout] BlockStatement
src/seguridad.js:746:16
         if (element) {
             delete element[config.security.PROP_PASSWORD]
             res.status(200).json(element)
-        } else {
-            return next(generateErrorByStatus(req, 401))
-        }
+        } else {}
     })()
 })

[Timeout] BlockStatement
src/seguridad.js:782:49
  *       "404":
  *         $ref: "#/components/responses/NotFound"
  */
-autenticados.put('/', function (req, res, next) {
-    if (!isSelf(res, req.body.idUsuario))
-        return next(generateErrorByStatus(req, 403))
-    let element = req.body;
-    (async () => {
-        let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
-        let list = JSON.parse(data)
-        let index = list.findIndex(row => row[config.security.PROP_USERNAME] == res.locals.usr)
-        if (index == -1) {
-            return next(generateErrorByStatus(req, 404))
-        } else {
-            if (element.nombre)
-                list[index].nombre = element.nombre;
-            fs.writeFile(config.security.USR_FILENAME, JSON.stringify(list))
-                .then(() => { res.sendStatus(204) })
-                .catch(err => { return next(generateErrorByError(req, err, 500)) })
-        }
-    })()
-})
+autenticados.put('/', function (req, res, next) {})
 /**
  * @swagger

[Killed] BooleanLiteral
src/seguridad.js:783:9
  *         $ref: "#/components/responses/NotFound"
  */
 autenticados.put('/', function (req, res, next) {
-    if (!isSelf(res, req.body.idUsuario))
+    if (isSelf(res, req.body.idUsuario))
         return next(generateErrorByStatus(req, 403))
     let element = req.body;
killedBy: Seguridad Pruebas con ficheros simulados /register OK PUT: Modificar usuario
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 204
Received: 403

[Killed] ConditionalExpression
src/seguridad.js:783:9
  *         $ref: "#/components/responses/NotFound"
  */
 autenticados.put('/', function (req, res, next) {
-    if (!isSelf(res, req.body.idUsuario))
+    if (true)
         return next(generateErrorByStatus(req, 403))
     let element = req.body;
killedBy: Seguridad Pruebas con ficheros simulados /register OK PUT: Modificar usuario
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 204
Received: 403

[Timeout] BlockStatement
src/seguridad.js:786:18
     if (!isSelf(res, req.body.idUsuario))
         return next(generateErrorByStatus(req, 403))
     let element = req.body;
-    (async () => {
-        let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
-        let list = JSON.parse(data)
-        let index = list.findIndex(row => row[config.security.PROP_USERNAME] == res.locals.usr)
-        if (index == -1) {
-            return next(generateErrorByStatus(req, 404))
-        } else {
-            if (element.nombre)
-                list[index].nombre = element.nombre;
-            fs.writeFile(config.security.USR_FILENAME, JSON.stringify(list))
-                .then(() => { res.sendStatus(204) })
-                .catch(err => { return next(generateErrorByError(req, err, 500)) })
-        }
-    })()
+    (async () => {})()
 })
 /**

[Killed] ConditionalExpression
src/seguridad.js:789:43
     (async () => {
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
-        let index = list.findIndex(row => row[config.security.PROP_USERNAME] == res.locals.usr)
+        let index = list.findIndex(row => true)
         if (index == -1) {
             return next(generateErrorByStatus(req, 404))
killedBy: Seguridad Pruebas con ficheros simulados /register KO PUT: Usuario eliminado
statusReason: Error: expected 404 "Not Found", got 204 "No Content"

[Killed] ArrowFunction
src/seguridad.js:789:36
     (async () => {
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
-        let index = list.findIndex(row => row[config.security.PROP_USERNAME] == res.locals.usr)
+        let index = list.findIndex(() => undefined)
         if (index == -1) {
             return next(generateErrorByStatus(req, 404))
killedBy: Seguridad Pruebas con ficheros simulados /register OK PUT: Modificar usuario
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 204
Received: 404

[Killed] ConditionalExpression
src/seguridad.js:790:13
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
         let index = list.findIndex(row => row[config.security.PROP_USERNAME] == res.locals.usr)
-        if (index == -1) {
+        if (true) {
             return next(generateErrorByStatus(req, 404))
         } else {
killedBy: Seguridad Pruebas con ficheros simulados /register OK PUT: Modificar usuario
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 204
Received: 404

[Timeout] BlockStatement
src/seguridad.js:790:26
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
         let index = list.findIndex(row => row[config.security.PROP_USERNAME] == res.locals.usr)
-        if (index == -1) {
-            return next(generateErrorByStatus(req, 404))
-        } else {
+        if (index == -1) {} else {
             if (element.nombre)
                 list[index].nombre = element.nombre;

[Timeout] BlockStatement
src/seguridad.js:792:16
         let index = list.findIndex(row => row[config.security.PROP_USERNAME] == res.locals.usr)
         if (index == -1) {
             return next(generateErrorByStatus(req, 404))
-        } else {
-            if (element.nombre)
-                list[index].nombre = element.nombre;
-            fs.writeFile(config.security.USR_FILENAME, JSON.stringify(list))
-                .then(() => { res.sendStatus(204) })
-                .catch(err => { return next(generateErrorByError(req, err, 500)) })
-        }
+        } else {}
     })()
 })

[Killed] ConditionalExpression
src/seguridad.js:793:17
         if (index == -1) {
             return next(generateErrorByStatus(req, 404))
         } else {
-            if (element.nombre)
+            if (false)
                 list[index].nombre = element.nombre;
             fs.writeFile(config.security.USR_FILENAME, JSON.stringify(list))
killedBy: Seguridad Pruebas con ficheros simulados /register OK PUT: Modificar usuario
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Nuevo nombre"
Received: "Administrador"

[Survived] ConditionalExpression
src/seguridad.js:793:17
         if (index == -1) {
             return next(generateErrorByStatus(req, 404))
         } else {
-            if (element.nombre)
+            if (true)
                 list[index].nombre = element.nombre;
             fs.writeFile(config.security.USR_FILENAME, JSON.stringify(list))

[Timeout] BlockStatement
src/seguridad.js:837:57
  *       "404":
  *         $ref: "#/components/responses/NotFound"
  */
-autenticados.put('/password', function (req, res, next) {
-    let element = req.body;
-    (async () => {
-        let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
-        let list = JSON.parse(data)
-        let index = list.findIndex(row => row[config.security.PROP_USERNAME] == res.locals.usr)
-        if (index == -1) {
-            return next(generateErrorByStatus(req, 404))
-        } else if (config.security.PASSWORD_PATTERN.test(element.newPassword) && await bcrypt.compare(element.oldPassword, list[index][config.security.PROP_PASSWORD])) {
-            list[index][config.security.PROP_PASSWORD] = await encriptaPassword(element.newPassword)
-            fs.writeFile(config.security.USR_FILENAME, JSON.stringify(list))
-                .then(() => { res.sendStatus(204) })
-                .catch(err => { return next(generateErrorByError(req, err, 500)) })
-        } else {
-            return next(generateError(req, 'Invalid data', 400))
-        }
-    })()
-})
+autenticados.put('/password', function (req, res, next) {})
 
 router.use('/register', autenticados)

[Timeout] BlockStatement
src/seguridad.js:839:18
  */
 autenticados.put('/password', function (req, res, next) {
     let element = req.body;
-    (async () => {
-        let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
-        let list = JSON.parse(data)
-        let index = list.findIndex(row => row[config.security.PROP_USERNAME] == res.locals.usr)
-        if (index == -1) {
-            return next(generateErrorByStatus(req, 404))
-        } else if (config.security.PASSWORD_PATTERN.test(element.newPassword) && await bcrypt.compare(element.oldPassword, list[index][config.security.PROP_PASSWORD])) {
-            list[index][config.security.PROP_PASSWORD] = await encriptaPassword(element.newPassword)
-            fs.writeFile(config.security.USR_FILENAME, JSON.stringify(list))
-                .then(() => { res.sendStatus(204) })
-                .catch(err => { return next(generateErrorByError(req, err, 500)) })
-        } else {
-            return next(generateError(req, 'Invalid data', 400))
-        }
-    })()
+    (async () => {})()
 })
 
