[Killed] ConditionalExpression
src/seguridad.js:842:43
     (async () => {
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
-        let index = list.findIndex(row => row[config.security.PROP_USERNAME] == res.locals.usr)
+        let index = list.findIndex(row => false)
         if (index == -1) {
             return next(generateErrorByStatus(req, 404))
killedBy: Seguridad Pruebas con ficheros simulados /register/password OK PUT: Cambiar contraseña
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 204
Received: 404

[Timeout] UnaryOperator
src/seguridad.js:843:22
         let data = await fs.readFile(config.security.USR_FILENAME, 'utf8')
         let list = JSON.parse(data)
         let index = list.findIndex(row => row[config.security.PROP_USERNAME] == res.locals.usr)
-        if (index == -1) {
+        if (index == +1) {
             return next(generateErrorByStatus(req, 404))
         } else if (config.security.PASSWORD_PATTERN.test(element.newPassword) && await bcrypt.compare(element.oldPassword, list[index][config.security.PROP_PASSWORD])) {

[Killed] ConditionalExpression
src/seguridad.js:845:20
         let index = list.findIndex(row => row[config.security.PROP_USERNAME] == res.locals.usr)
         if (index == -1) {
             return next(generateErrorByStatus(req, 404))
-        } else if (config.security.PASSWORD_PATTERN.test(element.newPassword) && await bcrypt.compare(element.oldPassword, list[index][config.security.PROP_PASSWORD])) {
+        } else if (true) {
             list[index][config.security.PROP_PASSWORD] = await encriptaPassword(element.newPassword)
             fs.writeFile(config.security.USR_FILENAME, JSON.stringify(list))
killedBy: Seguridad Pruebas con ficheros simulados /register/password KO PUT: Contraseña anterior invalida
statusReason: Error: expected 400 "Bad Request", got 204 "No Content"

[Killed] ConditionalExpression
src/seguridad.js:845:20
         let index = list.findIndex(row => row[config.security.PROP_USERNAME] == res.locals.usr)
         if (index == -1) {
             return next(generateErrorByStatus(req, 404))
-        } else if (config.security.PASSWORD_PATTERN.test(element.newPassword) && await bcrypt.compare(element.oldPassword, list[index][config.security.PROP_PASSWORD])) {
+        } else if (false) {
             list[index][config.security.PROP_PASSWORD] = await encriptaPassword(element.newPassword)
             fs.writeFile(config.security.USR_FILENAME, JSON.stringify(list))
killedBy: Seguridad Pruebas con ficheros simulados /register/password OK PUT: Cambiar contraseña
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 204
Received: 400

[Timeout] BlockStatement
src/seguridad.js:850:16
             fs.writeFile(config.security.USR_FILENAME, JSON.stringify(list))
                 .then(() => { res.sendStatus(204) })
                 .catch(err => { return next(generateErrorByError(req, err, 500)) })
-        } else {
-            return next(generateError(req, 'Invalid data', 400))
-        }
+        } else {}
     })()
 })
