[Survived] ArithmeticOperator
src/web-sockets.js:13:19
 module.exports.createWSServer = app => {
     // limitación de velocidad para evitar ataques de denegación de servicio
     app.use(rateLimit({
-        windowMs: 1 * 60 * 1000, // 1 minutes
+        windowMs: 1 * 60 / 1000, // 1 minutes
         max: 1000, // Limit each IP to 100 requests per `window` (here, per 1 minutes)
         standardHeaders: false, // Disable rate limit info in the `RateLimit-*` headers

[Timeout] ArithmeticOperator
src/web-sockets.js:13:19
 module.exports.createWSServer = app => {
     // limitación de velocidad para evitar ataques de denegación de servicio
     app.use(rateLimit({
-        windowMs: 1 * 60 * 1000, // 1 minutes
+        windowMs: 1 / 60 * 1000, // 1 minutes
         max: 1000, // Limit each IP to 100 requests per `window` (here, per 1 minutes)
         standardHeaders: false, // Disable rate limit info in the `RateLimit-*` headers

[Killed] BooleanLiteral
src/web-sockets.js:15:26
     app.use(rateLimit({
         windowMs: 1 * 60 * 1000, // 1 minutes
         max: 1000, // Limit each IP to 100 requests per `window` (here, per 1 minutes)
-        standardHeaders: false, // Disable rate limit info in the `RateLimit-*` headers
+        standardHeaders: true, // Disable rate limit info in the `RateLimit-*` headers
         legacyHeaders: false, // Disable the `X-RateLimit-*` headers
     }))
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Survived] BooleanLiteral
src/web-sockets.js:16:24
         windowMs: 1 * 60 * 1000, // 1 minutes
         max: 1000, // Limit each IP to 100 requests per `window` (here, per 1 minutes)
         standardHeaders: false, // Disable rate limit info in the `RateLimit-*` headers
-        legacyHeaders: false, // Disable the `X-RateLimit-*` headers
+        legacyHeaders: true, // Disable the `X-RateLimit-*` headers
     }))
 

[NoCoverage] BlockStatement
src/web-sockets.js:19:52
         legacyHeaders: false, // Disable the `X-RateLimit-*` headers
     }))
 
-    app.get('/ws/xss.min.js', async (_req, res) => {
-        try {
-            await access(config.paths.APP_ROOT + '/node_modules/xss/dist/xss.min.js', constants.R_OK);
-            res.sendFile(config.paths.APP_ROOT + '/node_modules/xss/dist/xss.min.js');
-        } catch {
-            res.sendFile('/node_modules/xss/dist/xss.min.js');
-        }
-    });
+    app.get('/ws/xss.min.js', async (_req, res) => {});
     app.get('/ws/chat', (_req, res) => {
         res.sendFile(config.paths.APP_ROOT + '/static/chat.html');

[Timeout] StringLiteral
src/web-sockets.js:19:13
         legacyHeaders: false, // Disable the `X-RateLimit-*` headers
     }))
 
-    app.get('/ws/xss.min.js', async (_req, res) => {
+    app.get("", async (_req, res) => {
         try {
             await access(config.paths.APP_ROOT + '/node_modules/xss/dist/xss.min.js', constants.R_OK);

[NoCoverage] BlockStatement
src/web-sockets.js:20:13
     }))
 
     app.get('/ws/xss.min.js', async (_req, res) => {
-        try {
-            await access(config.paths.APP_ROOT + '/node_modules/xss/dist/xss.min.js', constants.R_OK);
-            res.sendFile(config.paths.APP_ROOT + '/node_modules/xss/dist/xss.min.js');
-        } catch {
+        try {} catch {
             res.sendFile('/node_modules/xss/dist/xss.min.js');
         }

[NoCoverage] BlockStatement
src/web-sockets.js:23:17
         try {
             await access(config.paths.APP_ROOT + '/node_modules/xss/dist/xss.min.js', constants.R_OK);
             res.sendFile(config.paths.APP_ROOT + '/node_modules/xss/dist/xss.min.js');
-        } catch {
-            res.sendFile('/node_modules/xss/dist/xss.min.js');
-        }
+        } catch {}
     });
     app.get('/ws/chat', (_req, res) => {

[NoCoverage] BlockStatement
src/web-sockets.js:27:40
             res.sendFile('/node_modules/xss/dist/xss.min.js');
         }
     });
-    app.get('/ws/chat', (_req, res) => {
-        res.sendFile(config.paths.APP_ROOT + '/static/chat.html');
-    });
+    app.get('/ws/chat', (_req, res) => {});
     app.get('/ws/auto-chat', (_req, res) => {
         res.sendFile(config.paths.APP_ROOT + '/static/chat.html');

[Timeout] StringLiteral
src/web-sockets.js:27:13
             res.sendFile('/node_modules/xss/dist/xss.min.js');
         }
     });
-    app.get('/ws/chat', (_req, res) => {
+    app.get("", (_req, res) => {
         res.sendFile(config.paths.APP_ROOT + '/static/chat.html');
     });

[NoCoverage] BlockStatement
src/web-sockets.js:30:45
     app.get('/ws/chat', (_req, res) => {
         res.sendFile(config.paths.APP_ROOT + '/static/chat.html');
     });
-    app.get('/ws/auto-chat', (_req, res) => {
-        res.sendFile(config.paths.APP_ROOT + '/static/chat.html');
-    });
+    app.get('/ws/auto-chat', (_req, res) => {});
     app.get('/ws/dashboard', (_req, res) => {
         res.sendFile(config.paths.APP_ROOT + '/static/dashboard.html');

[NoCoverage] BlockStatement
src/web-sockets.js:33:45
     app.get('/ws/auto-chat', (_req, res) => {
         res.sendFile(config.paths.APP_ROOT + '/static/chat.html');
     });
-    app.get('/ws/dashboard', (_req, res) => {
-        res.sendFile(config.paths.APP_ROOT + '/static/dashboard.html');
-    });
+    app.get('/ws/dashboard', (_req, res) => {});
     app.get('/ws/listener', (_req, res) => {
         res.sendFile(config.paths.APP_ROOT + '/static/listener.html');

[NoCoverage] BlockStatement
src/web-sockets.js:36:44
     app.get('/ws/dashboard', (_req, res) => {
         res.sendFile(config.paths.APP_ROOT + '/static/dashboard.html');
     });
-    app.get('/ws/listener', (_req, res) => {
-        res.sendFile(config.paths.APP_ROOT + '/static/listener.html');
-    });
+    app.get('/ws/listener', (_req, res) => {});
 
     const wss = new WebSocketServer({ server: app.server });

[Survived] StringLiteral
src/web-sockets.js:36:13
     app.get('/ws/dashboard', (_req, res) => {
         res.sendFile(config.paths.APP_ROOT + '/static/dashboard.html');
     });
-    app.get('/ws/listener', (_req, res) => {
+    app.get("", (_req, res) => {
         res.sendFile(config.paths.APP_ROOT + '/static/listener.html');
     });

[Killed] ArrowFunction
src/web-sockets.js:41:29
     });
 
     const wss = new WebSocketServer({ server: app.server });
-    const generaAleatorio = (rango = 100) => randomInt(0, rango);
+    const generaAleatorio = () => undefined;
     const dashboard = { count: 0, interval: null }
     const resources = { count: 0, interval: null }
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] ObjectLiteral
src/web-sockets.js:43:23
     const wss = new WebSocketServer({ server: app.server });
     const generaAleatorio = (rango = 100) => randomInt(0, rango);
     const dashboard = { count: 0, interval: null }
-    const resources = { count: 0, interval: null }
+    const resources = {}
     const autoChat = { count: 0, interval: null }
 
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] BlockStatement
src/web-sockets.js:46:51
     const resources = { count: 0, interval: null }
     const autoChat = { count: 0, interval: null }
 
-    function broadcastInclude(ws, data, isBinary) {
-        wss.clients.forEach(client => {
-            if ((client.channel === 'listener' || client.channel === ws.channel) && client.readyState === WebSocket.OPEN) {
-                client.send(data, { binary: isBinary });
-            }
-        });
-    }
+    function broadcastInclude(ws, data, isBinary) {}
     function broadcastExclude(ws, data, isBinary) {
         wss.clients.forEach(client => {

[Timeout] BlockStatement
src/web-sockets.js:47:39
     const autoChat = { count: 0, interval: null }
 
     function broadcastInclude(ws, data, isBinary) {
-        wss.clients.forEach(client => {
-            if ((client.channel === 'listener' || client.channel === ws.channel) && client.readyState === WebSocket.OPEN) {
-                client.send(data, { binary: isBinary });
-            }
-        });
+        wss.clients.forEach(client => {});
     }
     function broadcastExclude(ws, data, isBinary) {

[Killed] ConditionalExpression
src/web-sockets.js:48:85
 
     function broadcastInclude(ws, data, isBinary) {
         wss.clients.forEach(client => {
-            if ((client.channel === 'listener' || client.channel === ws.channel) && client.readyState === WebSocket.OPEN) {
+            if ((client.channel === 'listener' || client.channel === ws.channel) && true) {
                 client.send(data, { binary: isBinary });
             }
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Killed] EqualityOperator
src/web-sockets.js:48:51
 
     function broadcastInclude(ws, data, isBinary) {
         wss.clients.forEach(client => {
-            if ((client.channel === 'listener' || client.channel === ws.channel) && client.readyState === WebSocket.OPEN) {
+            if ((client.channel === 'listener' || client.channel !== ws.channel) && client.readyState === WebSocket.OPEN) {
                 client.send(data, { binary: isBinary });
             }
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] BlockStatement
src/web-sockets.js:53:51
             }
         });
     }
-    function broadcastExclude(ws, data, isBinary) {
-        wss.clients.forEach(client => {
-            if (client !== ws && (client.channel === 'listener' || client.channel === ws.channel) && client.readyState === WebSocket.OPEN) {
-                client.send(data, { binary: isBinary });
-            }
-        });
-    }
+    function broadcastExclude(ws, data, isBinary) {}
     function broadcastExcludeById(data) {
         wss.clients.forEach(client => {

[Survived] BlockStatement
src/web-sockets.js:54:39
         });
     }
     function broadcastExclude(ws, data, isBinary) {
-        wss.clients.forEach(client => {
-            if (client !== ws && (client.channel === 'listener' || client.channel === ws.channel) && client.readyState === WebSocket.OPEN) {
-                client.send(data, { binary: isBinary });
-            }
-        });
+        wss.clients.forEach(client => {});
     }
     function broadcastExcludeById(data) {

[NoCoverage] LogicalOperator
src/web-sockets.js:55:35
     }
     function broadcastExclude(ws, data, isBinary) {
         wss.clients.forEach(client => {
-            if (client !== ws && (client.channel === 'listener' || client.channel === ws.channel) && client.readyState === WebSocket.OPEN) {
+            if (client !== ws && (client.channel === 'listener' && client.channel === ws.channel) && client.readyState === WebSocket.OPEN) {
                 client.send(data, { binary: isBinary });
             }

[Timeout] ConditionalExpression
src/web-sockets.js:55:17
     }
     function broadcastExclude(ws, data, isBinary) {
         wss.clients.forEach(client => {
-            if (client !== ws && (client.channel === 'listener' || client.channel === ws.channel) && client.readyState === WebSocket.OPEN) {
+            if (true) {
                 client.send(data, { binary: isBinary });
             }

[Timeout] BlockStatement
src/web-sockets.js:60:41
             }
         });
     }
-    function broadcastExcludeById(data) {
-        wss.clients.forEach(client => {
-            if (client.clientId != data.clientId) {
-                client.send(JSON.stringify(data), { binary: false });
-            }
-        });
-    }
+    function broadcastExcludeById(data) {}
 
     function wssDashboard(ws) {

[Survived] BlockStatement
src/web-sockets.js:61:39
         });
     }
     function broadcastExcludeById(data) {
-        wss.clients.forEach(client => {
-            if (client.clientId != data.clientId) {
-                client.send(JSON.stringify(data), { binary: false });
-            }
-        });
+        wss.clients.forEach(client => {});
     }
 

[Killed] ConditionalExpression
src/web-sockets.js:62:17
     }
     function broadcastExcludeById(data) {
         wss.clients.forEach(client => {
-            if (client.clientId != data.clientId) {
+            if (false) {
                 client.send(JSON.stringify(data), { binary: false });
             }
killedBy: Web Sockets auto-chat
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Survived] ConditionalExpression
src/web-sockets.js:62:17
     }
     function broadcastExcludeById(data) {
         wss.clients.forEach(client => {
-            if (client.clientId != data.clientId) {
+            if (true) {
                 client.send(JSON.stringify(data), { binary: false });
             }

[Survived] BooleanLiteral
src/web-sockets.js:63:61
     function broadcastExcludeById(data) {
         wss.clients.forEach(client => {
             if (client.clientId != data.clientId) {
-                client.send(JSON.stringify(data), { binary: false });
+                client.send(JSON.stringify(data), { binary: true });
             }
         });

[Timeout] BlockStatement
src/web-sockets.js:68:31
         });
     }
 
-    function wssDashboard(ws) {
-        if (dashboard.count) return;
-        console.log('stating client interval');
-        dashboard.count++;
-        dashboard.interval = setInterval(function () {
-            broadcastInclude(ws, JSON.stringify(['developer', 'staging', 'production 1', 'production 2']
-                .map(srv => ({
-                    name: srv,
-                    cpu: generaAleatorio(),
-                    memory: generaAleatorio(),
-                    disk: generaAleatorio(),
-                    network: generaAleatorio(),
-                }))), false);
-        }, 1000);
-        ws.on('close', function () {
-            dashboard.count--;
-            if (!dashboard.count && dashboard.interval) {
-                console.log('stopping client interval');
-                clearInterval(dashboard.interval);
-                dashboard.interval = null;
-            }
-        });
-    }
+    function wssDashboard(ws) {}
 
     function wssResources(ws) {

[Survived] ConditionalExpression
src/web-sockets.js:69:13
     }
 
     function wssDashboard(ws) {
-        if (dashboard.count) return;
+        if (false) return;
         console.log('stating client interval');
         dashboard.count++;

[Timeout] ConditionalExpression
src/web-sockets.js:69:13
     }
 
     function wssDashboard(ws) {
-        if (dashboard.count) return;
+        if (true) return;
         console.log('stating client interval');
         dashboard.count++;

[Survived] UpdateOperator
src/web-sockets.js:71:9
     function wssDashboard(ws) {
         if (dashboard.count) return;
         console.log('stating client interval');
-        dashboard.count++;
+        dashboard.count--;
         dashboard.interval = setInterval(function () {
             broadcastInclude(ws, JSON.stringify(['developer', 'staging', 'production 1', 'production 2']

[Survived] BlockStatement
src/web-sockets.js:72:54
         if (dashboard.count) return;
         console.log('stating client interval');
         dashboard.count++;
-        dashboard.interval = setInterval(function () {
-            broadcastInclude(ws, JSON.stringify(['developer', 'staging', 'production 1', 'production 2']
-                .map(srv => ({
-                    name: srv,
-                    cpu: generaAleatorio(),
-                    memory: generaAleatorio(),
-                    disk: generaAleatorio(),
-                    network: generaAleatorio(),
-                }))), false);
-        }, 1000);
+        dashboard.interval = setInterval(function () {}, 1000);
         ws.on('close', function () {
             dashboard.count--;

[Timeout] StringLiteral
src/web-sockets.js:73:63
         console.log('stating client interval');
         dashboard.count++;
         dashboard.interval = setInterval(function () {
-            broadcastInclude(ws, JSON.stringify(['developer', 'staging', 'production 1', 'production 2']
+            broadcastInclude(ws, JSON.stringify(['developer', "", 'production 1', 'production 2']
                 .map(srv => ({
                     name: srv,

[Timeout] ArrowFunction
src/web-sockets.js:74:22
         dashboard.count++;
         dashboard.interval = setInterval(function () {
             broadcastInclude(ws, JSON.stringify(['developer', 'staging', 'production 1', 'production 2']
-                .map(srv => ({
-                    name: srv,
-                    cpu: generaAleatorio(),
-                    memory: generaAleatorio(),
-                    disk: generaAleatorio(),
-                    network: generaAleatorio(),
-                }))), false);
+                .map(() => undefined)), false);
         }, 1000);
         ws.on('close', function () {

[Timeout] ObjectLiteral
src/web-sockets.js:74:30
         dashboard.count++;
         dashboard.interval = setInterval(function () {
             broadcastInclude(ws, JSON.stringify(['developer', 'staging', 'production 1', 'production 2']
-                .map(srv => ({
-                    name: srv,
-                    cpu: generaAleatorio(),
-                    memory: generaAleatorio(),
-                    disk: generaAleatorio(),
-                    network: generaAleatorio(),
-                }))), false);
+                .map(srv => ({}))), false);
         }, 1000);
         ws.on('close', function () {

[Survived] BooleanLiteral
src/web-sockets.js:80:23
                     memory: generaAleatorio(),
                     disk: generaAleatorio(),
                     network: generaAleatorio(),
-                }))), false);
+                }))), true);
         }, 1000);
         ws.on('close', function () {

[Timeout] BlockStatement
src/web-sockets.js:82:36
                     network: generaAleatorio(),
                 }))), false);
         }, 1000);
-        ws.on('close', function () {
-            dashboard.count--;
-            if (!dashboard.count && dashboard.interval) {
-                console.log('stopping client interval');
-                clearInterval(dashboard.interval);
-                dashboard.interval = null;
-            }
-        });
+        ws.on('close', function () {});
     }
 

[Survived] UpdateOperator
src/web-sockets.js:83:13
                 }))), false);
         }, 1000);
         ws.on('close', function () {
-            dashboard.count--;
+            dashboard.count++;
             if (!dashboard.count && dashboard.interval) {
                 console.log('stopping client interval');

[Timeout] ConditionalExpression
src/web-sockets.js:84:17
         }, 1000);
         ws.on('close', function () {
             dashboard.count--;
-            if (!dashboard.count && dashboard.interval) {
+            if (false) {
                 console.log('stopping client interval');
                 clearInterval(dashboard.interval);

[Survived] BlockStatement
src/web-sockets.js:84:57
         }, 1000);
         ws.on('close', function () {
             dashboard.count--;
-            if (!dashboard.count && dashboard.interval) {
-                console.log('stopping client interval');
-                clearInterval(dashboard.interval);
-                dashboard.interval = null;
-            }
+            if (!dashboard.count && dashboard.interval) {}
         });
     }

[Survived] StringLiteral
src/web-sockets.js:85:29
         ws.on('close', function () {
             dashboard.count--;
             if (!dashboard.count && dashboard.interval) {
-                console.log('stopping client interval');
+                console.log("");
                 clearInterval(dashboard.interval);
                 dashboard.interval = null;

[Survived] BlockStatement
src/web-sockets.js:92:31
         });
     }
 
-    function wssResources(ws) {
-        if (resources.count) return;
-        console.log('stating client interval');
-        resources.count++;
-        resources.interval = setInterval(function () {
-            broadcastInclude(ws, JSON.stringify({ memory: process.memoryUsage(), cpu: os.cpus() }), false);
-        }, 500);
-        ws.on('close', function () {
-            resources.count--;
-            if (!resources.count && resources.interval) {
-                console.log('stopping client interval');
-                clearInterval(resources.interval);
-                resources.interval = null;
-            }
-        });
-    }
+    function wssResources(ws) {}
 
     function wssChat(ws, clientId, channel) {

[Survived] ConditionalExpression
src/web-sockets.js:93:13
     }
 
     function wssResources(ws) {
-        if (resources.count) return;
+        if (false) return;
         console.log('stating client interval');
         resources.count++;

[Survived] ConditionalExpression
src/web-sockets.js:93:13
     }
 
     function wssResources(ws) {
-        if (resources.count) return;
+        if (true) return;
         console.log('stating client interval');
         resources.count++;

[Timeout] UpdateOperator
src/web-sockets.js:95:9
     function wssResources(ws) {
         if (resources.count) return;
         console.log('stating client interval');
-        resources.count++;
+        resources.count--;
         resources.interval = setInterval(function () {
             broadcastInclude(ws, JSON.stringify({ memory: process.memoryUsage(), cpu: os.cpus() }), false);

[Survived] BlockStatement
src/web-sockets.js:96:54
         if (resources.count) return;
         console.log('stating client interval');
         resources.count++;
-        resources.interval = setInterval(function () {
-            broadcastInclude(ws, JSON.stringify({ memory: process.memoryUsage(), cpu: os.cpus() }), false);
-        }, 500);
+        resources.interval = setInterval(function () {}, 500);
         ws.on('close', function () {
             resources.count--;

[Survived] BooleanLiteral
src/web-sockets.js:97:101
         console.log('stating client interval');
         resources.count++;
         resources.interval = setInterval(function () {
-            broadcastInclude(ws, JSON.stringify({ memory: process.memoryUsage(), cpu: os.cpus() }), false);
+            broadcastInclude(ws, JSON.stringify({ memory: process.memoryUsage(), cpu: os.cpus() }), true);
         }, 500);
         ws.on('close', function () {

[Survived] BlockStatement
src/web-sockets.js:99:36
         resources.interval = setInterval(function () {
             broadcastInclude(ws, JSON.stringify({ memory: process.memoryUsage(), cpu: os.cpus() }), false);
         }, 500);
-        ws.on('close', function () {
-            resources.count--;
-            if (!resources.count && resources.interval) {
-                console.log('stopping client interval');
-                clearInterval(resources.interval);
-                resources.interval = null;
-            }
-        });
+        ws.on('close', function () {});
     }
 

[Survived] UpdateOperator
src/web-sockets.js:100:13
             broadcastInclude(ws, JSON.stringify({ memory: process.memoryUsage(), cpu: os.cpus() }), false);
         }, 500);
         ws.on('close', function () {
-            resources.count--;
+            resources.count++;
             if (!resources.count && resources.interval) {
                 console.log('stopping client interval');

[Survived] LogicalOperator
src/web-sockets.js:101:17
         }, 500);
         ws.on('close', function () {
             resources.count--;
-            if (!resources.count && resources.interval) {
+            if (!resources.count || resources.interval) {
                 console.log('stopping client interval');
                 clearInterval(resources.interval);

[Survived] ConditionalExpression
src/web-sockets.js:101:17
         }, 500);
         ws.on('close', function () {
             resources.count--;
-            if (!resources.count && resources.interval) {
+            if (false) {
                 console.log('stopping client interval');
                 clearInterval(resources.interval);

[Timeout] BlockStatement
src/web-sockets.js:109:45
         });
     }
 
-    function wssChat(ws, clientId, channel) {
-        ws.clientId = clientId;
-        ws.send(JSON.stringify({ clientId: 0, message: `Te has conectado al canal ${channel} como ${clientId}` }));
-        ws.on('message', function (message, isBinary) {
-            console.log(`Received message of ${ws.clientId} to ${ws.channel}: ${message}`);
-            // broadcastInclude(ws, message, isBinary)
-            broadcastExclude(ws, JSON.stringify({ clientId: ws.clientId, message: `${message}` }), isBinary);
-        });
-        ws.on('close', () => console.log('stopping client chat'));
-    }
+    function wssChat(ws, clientId, channel) {}
 
     function wssAutoChat(ws, clientId, channel) {

[Survived] ObjectLiteral
src/web-sockets.js:111:32
 
     function wssChat(ws, clientId, channel) {
         ws.clientId = clientId;
-        ws.send(JSON.stringify({ clientId: 0, message: `Te has conectado al canal ${channel} como ${clientId}` }));
+        ws.send(JSON.stringify({}));
         ws.on('message', function (message, isBinary) {
             console.log(`Received message of ${ws.clientId} to ${ws.channel}: ${message}`);

[Survived] BlockStatement
src/web-sockets.js:112:55
     function wssChat(ws, clientId, channel) {
         ws.clientId = clientId;
         ws.send(JSON.stringify({ clientId: 0, message: `Te has conectado al canal ${channel} como ${clientId}` }));
-        ws.on('message', function (message, isBinary) {
-            console.log(`Received message of ${ws.clientId} to ${ws.channel}: ${message}`);
-            // broadcastInclude(ws, message, isBinary)
-            broadcastExclude(ws, JSON.stringify({ clientId: ws.clientId, message: `${message}` }), isBinary);
-        });
+        ws.on('message', function (message, isBinary) {});
         ws.on('close', () => console.log('stopping client chat'));
     }

[Survived] StringLiteral
src/web-sockets.js:112:15
     function wssChat(ws, clientId, channel) {
         ws.clientId = clientId;
         ws.send(JSON.stringify({ clientId: 0, message: `Te has conectado al canal ${channel} como ${clientId}` }));
-        ws.on('message', function (message, isBinary) {
+        ws.on("", function (message, isBinary) {
             console.log(`Received message of ${ws.clientId} to ${ws.channel}: ${message}`);
             // broadcastInclude(ws, message, isBinary)

[Timeout] ObjectLiteral
src/web-sockets.js:115:49
         ws.on('message', function (message, isBinary) {
             console.log(`Received message of ${ws.clientId} to ${ws.channel}: ${message}`);
             // broadcastInclude(ws, message, isBinary)
-            broadcastExclude(ws, JSON.stringify({ clientId: ws.clientId, message: `${message}` }), isBinary);
+            broadcastExclude(ws, JSON.stringify({}), isBinary);
         });
         ws.on('close', () => console.log('stopping client chat'));

[Timeout] StringLiteral
src/web-sockets.js:115:83
         ws.on('message', function (message, isBinary) {
             console.log(`Received message of ${ws.clientId} to ${ws.channel}: ${message}`);
             // broadcastInclude(ws, message, isBinary)
-            broadcastExclude(ws, JSON.stringify({ clientId: ws.clientId, message: `${message}` }), isBinary);
+            broadcastExclude(ws, JSON.stringify({ clientId: ws.clientId, message: `` }), isBinary);
         });
         ws.on('close', () => console.log('stopping client chat'));

[Timeout] ArrowFunction
src/web-sockets.js:117:24
             // broadcastInclude(ws, message, isBinary)
             broadcastExclude(ws, JSON.stringify({ clientId: ws.clientId, message: `${message}` }), isBinary);
         });
-        ws.on('close', () => console.log('stopping client chat'));
+        ws.on('close', () => undefined);
     }
 

[Survived] StringLiteral
src/web-sockets.js:117:15
             // broadcastInclude(ws, message, isBinary)
             broadcastExclude(ws, JSON.stringify({ clientId: ws.clientId, message: `${message}` }), isBinary);
         });
-        ws.on('close', () => console.log('stopping client chat'));
+        ws.on("", () => console.log('stopping client chat'));
     }
 

[Survived] ConditionalExpression
src/web-sockets.js:121:13
     }
 
     function wssAutoChat(ws, clientId, channel) {
-        if (autoChat.count) return;
+        if (false) return;
         ws.clientId = clientId;
         autoChat.count++;

[Survived] ConditionalExpression
src/web-sockets.js:121:13
     }
 
     function wssAutoChat(ws, clientId, channel) {
-        if (autoChat.count) return;
+        if (true) return;
         ws.clientId = clientId;
         autoChat.count++;

[Timeout] UpdateOperator
src/web-sockets.js:123:9
     function wssAutoChat(ws, clientId, channel) {
         if (autoChat.count) return;
         ws.clientId = clientId;
-        autoChat.count++;
+        autoChat.count--;
         ws.send(JSON.stringify({ clientId: 0, message: `Te has conectado al canal ${channel} como ${clientId}` }));
         ws.on('message', function (message, isBinary) {

[Survived] ObjectLiteral
src/web-sockets.js:124:32
         if (autoChat.count) return;
         ws.clientId = clientId;
         autoChat.count++;
-        ws.send(JSON.stringify({ clientId: 0, message: `Te has conectado al canal ${channel} como ${clientId}` }));
+        ws.send(JSON.stringify({}));
         ws.on('message', function (message, isBinary) {
             console.log(`Received message of ${ws.clientId} to ${ws.channel}: ${message}`);
