[Survived] StringLiteral
src/web-sockets.js:124:56
         if (autoChat.count) return;
         ws.clientId = clientId;
         autoChat.count++;
-        ws.send(JSON.stringify({ clientId: 0, message: `Te has conectado al canal ${channel} como ${clientId}` }));
+        ws.send(JSON.stringify({ clientId: 0, message: `` }));
         ws.on('message', function (message, isBinary) {
             console.log(`Received message of ${ws.clientId} to ${ws.channel}: ${message}`);

[Timeout] BlockStatement
src/web-sockets.js:125:55
         ws.clientId = clientId;
         autoChat.count++;
         ws.send(JSON.stringify({ clientId: 0, message: `Te has conectado al canal ${channel} como ${clientId}` }));
-        ws.on('message', function (message, isBinary) {
-            console.log(`Received message of ${ws.clientId} to ${ws.channel}: ${message}`);
-            broadcastExclude(ws, JSON.stringify({ clientId: ws.clientId, message: `${message}` }), isBinary);
-        });
+        ws.on('message', function (message, isBinary) {});
         ws.on('close', function () {
             if (autoChat.count > 1) {

[Survived] ObjectLiteral
src/web-sockets.js:127:49
         ws.send(JSON.stringify({ clientId: 0, message: `Te has conectado al canal ${channel} como ${clientId}` }));
         ws.on('message', function (message, isBinary) {
             console.log(`Received message of ${ws.clientId} to ${ws.channel}: ${message}`);
-            broadcastExclude(ws, JSON.stringify({ clientId: ws.clientId, message: `${message}` }), isBinary);
+            broadcastExclude(ws, JSON.stringify({}), isBinary);
         });
         ws.on('close', function () {

[Survived] StringLiteral
src/web-sockets.js:127:83
         ws.send(JSON.stringify({ clientId: 0, message: `Te has conectado al canal ${channel} como ${clientId}` }));
         ws.on('message', function (message, isBinary) {
             console.log(`Received message of ${ws.clientId} to ${ws.channel}: ${message}`);
-            broadcastExclude(ws, JSON.stringify({ clientId: ws.clientId, message: `${message}` }), isBinary);
+            broadcastExclude(ws, JSON.stringify({ clientId: ws.clientId, message: `` }), isBinary);
         });
         ws.on('close', function () {

[Survived] BlockStatement
src/web-sockets.js:129:36
             console.log(`Received message of ${ws.clientId} to ${ws.channel}: ${message}`);
             broadcastExclude(ws, JSON.stringify({ clientId: ws.clientId, message: `${message}` }), isBinary);
         });
-        ws.on('close', function () {
-            if (autoChat.count > 1) {
-                autoChat.count--;
-            } else {
-                console.log('stopping client chat');
-                if (autoChat.interval) {
-                    console.log('stopping char interval');
-                    clearInterval(autoChat.interval);
-                    autoChat.interval = null;
-                    autoChat.count = 0;
-                }
-            }
-        });
+        ws.on('close', function () {});
         if (!autoChat.interval)
             autoChat.interval = setInterval(function () {

[Timeout] EqualityOperator
src/web-sockets.js:130:17
             broadcastExclude(ws, JSON.stringify({ clientId: ws.clientId, message: `${message}` }), isBinary);
         });
         ws.on('close', function () {
-            if (autoChat.count > 1) {
+            if (autoChat.count >= 1) {
                 autoChat.count--;
             } else {

[Timeout] EqualityOperator
src/web-sockets.js:130:17
             broadcastExclude(ws, JSON.stringify({ clientId: ws.clientId, message: `${message}` }), isBinary);
         });
         ws.on('close', function () {
-            if (autoChat.count > 1) {
+            if (autoChat.count <= 1) {
                 autoChat.count--;
             } else {

[NoCoverage] UpdateOperator
src/web-sockets.js:131:17
         });
         ws.on('close', function () {
             if (autoChat.count > 1) {
-                autoChat.count--;
+                autoChat.count++;
             } else {
                 console.log('stopping client chat');

[Timeout] BlockStatement
src/web-sockets.js:132:20
         ws.on('close', function () {
             if (autoChat.count > 1) {
                 autoChat.count--;
-            } else {
-                console.log('stopping client chat');
-                if (autoChat.interval) {
-                    console.log('stopping char interval');
-                    clearInterval(autoChat.interval);
-                    autoChat.interval = null;
-                    autoChat.count = 0;
-                }
-            }
+            } else {}
         });
         if (!autoChat.interval)

[Timeout] BlockStatement
src/web-sockets.js:134:40
                 autoChat.count--;
             } else {
                 console.log('stopping client chat');
-                if (autoChat.interval) {
-                    console.log('stopping char interval');
-                    clearInterval(autoChat.interval);
-                    autoChat.interval = null;
-                    autoChat.count = 0;
-                }
+                if (autoChat.interval) {}
             }
         });

[Survived] ConditionalExpression
src/web-sockets.js:134:21
                 autoChat.count--;
             } else {
                 console.log('stopping client chat');
-                if (autoChat.interval) {
+                if (true) {
                     console.log('stopping char interval');
                     clearInterval(autoChat.interval);

[Timeout] ConditionalExpression
src/web-sockets.js:142:13
                 }
             }
         });
-        if (!autoChat.interval)
+        if (false)
             autoChat.interval = setInterval(function () {
                 const clientRnd = generaAleatorio();

[Survived] BooleanLiteral
src/web-sockets.js:142:13
                 }
             }
         });
-        if (!autoChat.interval)
+        if (autoChat.interval)
             autoChat.interval = setInterval(function () {
                 const clientRnd = generaAleatorio();

[Survived] BlockStatement
src/web-sockets.js:143:57
             }
         });
         if (!autoChat.interval)
-            autoChat.interval = setInterval(function () {
-                const clientRnd = generaAleatorio();
-                try {
-                    broadcastExcludeById({ clientId: clientRnd, message: `${clientRnd % 2 ? fakerES.company.catchPhrase() : fakerES.hacker.phrase()}` });
-                } catch {
-                    broadcastExcludeById({ clientId: clientRnd, message: `${clientRnd % 2 ? faker.company.catchPhrase() : faker.hacker.phrase()}` });
-                }
-            }, 2000);
+            autoChat.interval = setInterval(function () {}, 2000);
     }
 

[Timeout] BlockStatement
src/web-sockets.js:145:21
         if (!autoChat.interval)
             autoChat.interval = setInterval(function () {
                 const clientRnd = generaAleatorio();
-                try {
-                    broadcastExcludeById({ clientId: clientRnd, message: `${clientRnd % 2 ? fakerES.company.catchPhrase() : fakerES.hacker.phrase()}` });
-                } catch {
+                try {} catch {
                     broadcastExcludeById({ clientId: clientRnd, message: `${clientRnd % 2 ? faker.company.catchPhrase() : faker.hacker.phrase()}` });
                 }

[Survived] ArithmeticOperator
src/web-sockets.js:146:77
             autoChat.interval = setInterval(function () {
                 const clientRnd = generaAleatorio();
                 try {
-                    broadcastExcludeById({ clientId: clientRnd, message: `${clientRnd % 2 ? fakerES.company.catchPhrase() : fakerES.hacker.phrase()}` });
+                    broadcastExcludeById({ clientId: clientRnd, message: `${clientRnd * 2 ? fakerES.company.catchPhrase() : fakerES.hacker.phrase()}` });
                 } catch {
                     broadcastExcludeById({ clientId: clientRnd, message: `${clientRnd % 2 ? faker.company.catchPhrase() : faker.hacker.phrase()}` });

[Timeout] BlockStatement
src/web-sockets.js:147:25
                 const clientRnd = generaAleatorio();
                 try {
                     broadcastExcludeById({ clientId: clientRnd, message: `${clientRnd % 2 ? fakerES.company.catchPhrase() : fakerES.hacker.phrase()}` });
-                } catch {
-                    broadcastExcludeById({ clientId: clientRnd, message: `${clientRnd % 2 ? faker.company.catchPhrase() : faker.hacker.phrase()}` });
-                }
+                } catch {}
             }, 2000);
     }

[Survived] ArithmeticOperator
src/web-sockets.js:148:77
                 try {
                     broadcastExcludeById({ clientId: clientRnd, message: `${clientRnd % 2 ? fakerES.company.catchPhrase() : fakerES.hacker.phrase()}` });
                 } catch {
-                    broadcastExcludeById({ clientId: clientRnd, message: `${clientRnd % 2 ? faker.company.catchPhrase() : faker.hacker.phrase()}` });
+                    broadcastExcludeById({ clientId: clientRnd, message: `${clientRnd * 2 ? faker.company.catchPhrase() : faker.hacker.phrase()}` });
                 }
             }, 2000);

[Timeout] MethodExpression
src/web-sockets.js:154:20
     }
 
     wss.on('connection', function (ws, req) {
-        let path = req.url.toLocaleLowerCase().split('/')
+        let path = req.url.toLocaleUpperCase().split('/')
         let index = path[1] === 'ws' ? 2 : 1
         let channel = path[index] ? path[index] : '(default)'

[Timeout] StringLiteral
src/web-sockets.js:154:54
     }
 
     wss.on('connection', function (ws, req) {
-        let path = req.url.toLocaleLowerCase().split('/')
+        let path = req.url.toLocaleLowerCase().split("")
         let index = path[1] === 'ws' ? 2 : 1
         let channel = path[index] ? path[index] : '(default)'

[Timeout] ConditionalExpression
src/web-sockets.js:155:21
 
     wss.on('connection', function (ws, req) {
         let path = req.url.toLocaleLowerCase().split('/')
-        let index = path[1] === 'ws' ? 2 : 1
+        let index = false ? 2 : 1
         let channel = path[index] ? path[index] : '(default)'
         let clientId = path[index + 1] ? path[index + 1] : '(unknown)'

[Timeout] ConditionalExpression
src/web-sockets.js:155:21
 
     wss.on('connection', function (ws, req) {
         let path = req.url.toLocaleLowerCase().split('/')
-        let index = path[1] === 'ws' ? 2 : 1
+        let index = true ? 2 : 1
         let channel = path[index] ? path[index] : '(default)'
         let clientId = path[index + 1] ? path[index + 1] : '(unknown)'

[Survived] ArithmeticOperator
src/web-sockets.js:157:29
         let path = req.url.toLocaleLowerCase().split('/')
         let index = path[1] === 'ws' ? 2 : 1
         let channel = path[index] ? path[index] : '(default)'
-        let clientId = path[index + 1] ? path[index + 1] : '(unknown)'
+        let clientId = path[index - 1] ? path[index + 1] : '(unknown)'
         ws.channel = channel
         switch (channel) {

[Timeout] ArithmeticOperator
src/web-sockets.js:157:47
         let path = req.url.toLocaleLowerCase().split('/')
         let index = path[1] === 'ws' ? 2 : 1
         let channel = path[index] ? path[index] : '(default)'
-        let clientId = path[index + 1] ? path[index + 1] : '(unknown)'
+        let clientId = path[index + 1] ? path[index - 1] : '(unknown)'
         ws.channel = channel
         switch (channel) {

[Survived] ConditionalExpression
src/web-sockets.js:160:13
         let clientId = path[index + 1] ? path[index + 1] : '(unknown)'
         ws.channel = channel
         switch (channel) {
-            case 'listener':
-                if (clientId !== '(unknown)')
-                    ws.channel = clientId;
-                break;
+            case 'listener':
             case 'resources':
                 wssResources(ws);

[Survived] EqualityOperator
src/web-sockets.js:161:21
         ws.channel = channel
         switch (channel) {
             case 'listener':
-                if (clientId !== '(unknown)')
+                if (clientId === '(unknown)')
                     ws.channel = clientId;
                 break;

[Timeout] ConditionalExpression
src/web-sockets.js:161:21
         ws.channel = channel
         switch (channel) {
             case 'listener':
-                if (clientId !== '(unknown)')
+                if (false)
                     ws.channel = clientId;
                 break;

[Survived] ConditionalExpression
src/web-sockets.js:164:13
                 if (clientId !== '(unknown)')
                     ws.channel = clientId;
                 break;
-            case 'resources':
-                wssResources(ws);
-                break;
+            case 'resources':
             case 'dashboard':
                 wssDashboard(ws);

[Killed] ConditionalExpression
src/web-sockets.js:167:13
             case 'resources':
                 wssResources(ws);
                 break;
-            case 'dashboard':
-                wssDashboard(ws);
-                break;
+            case 'dashboard':
             case 'auto-chat':
                 wssAutoChat(ws, clientId, channel);
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] ConditionalExpression
src/web-sockets.js:170:13
             case 'dashboard':
                 wssDashboard(ws);
                 break;
-            case 'auto-chat':
-                wssAutoChat(ws, clientId, channel);
-                break;
+            case 'auto-chat':
             case 'chat':
                 wssChat(ws, clientId, channel);

[Killed] StringLiteral
src/web-sockets.js:170:18
             case 'dashboard':
                 wssDashboard(ws);
                 break;
-            case 'auto-chat':
+            case "":
                 wssAutoChat(ws, clientId, channel);
                 break;
killedBy: Web Sockets chat
statusReason: Error: listen EADDRINUSE: address already in use :::4444

[Timeout] ConditionalExpression
src/web-sockets.js:173:13
             case 'auto-chat':
                 wssAutoChat(ws, clientId, channel);
                 break;
-            case 'chat':
-                wssChat(ws, clientId, channel);
-                break;
+            case 'chat':
             default:
                 ws.on('message', function (message, isBinary) {

[Timeout] ConditionalExpression
src/web-sockets.js:176:13
             case 'chat':
                 wssChat(ws, clientId, channel);
                 break;
-            default:
-                ws.on('message', function (message, isBinary) {
-                    broadcastInclude(ws, message, isBinary)
-                });
-                ws.on('close', () => console.log('stopping client chat'));
-                break;
+            default:
         }
         console.log(`started client ${channel}`);

[Timeout] BlockStatement
src/web-sockets.js:177:63
                 wssChat(ws, clientId, channel);
                 break;
             default:
-                ws.on('message', function (message, isBinary) {
-                    broadcastInclude(ws, message, isBinary)
-                });
+                ws.on('message', function (message, isBinary) {});
                 ws.on('close', () => console.log('stopping client chat'));
                 break;

[Timeout] StringLiteral
src/web-sockets.js:177:23
                 wssChat(ws, clientId, channel);
                 break;
             default:
-                ws.on('message', function (message, isBinary) {
+                ws.on("", function (message, isBinary) {
                     broadcastInclude(ws, message, isBinary)
                 });

[Killed] StringLiteral
src/web-sockets.js:183:21
                 ws.on('close', () => console.log('stopping client chat'));
                 break;
         }
-        console.log(`started client ${channel}`);
+        console.log(``);
     });
     return wss
killedBy: Web Sockets dashboard
statusReason: Error: listen EADDRINUSE: address already in use :::4444
